--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/anniebryan/Documents/College/2021-22/14.33/Project/scripts/l
> ogs/2022.03.22-11.58.37.log.txt
  log type:  text
 opened on:  22 Mar 2022, 11:58:37

. 
. ssc install estout, replace
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. 
. * Configure Stata's library environment and record system parameters
. run "$MyProject/scripts/programs/_config.do"
-------------------------------------------------------------------------------
Date and time: 22 Mar 2022 11:58:39
Stata version: 17
Updated as of: 15 Feb 2022
Variant:       SE
Processors:    1
OS:            MacOSX 12.2.0
Machine type:  Macintosh (Intel 64-bit)
-------------------------------------------------------------------------------

. 
. * Stata version control
. version 15

. 
. * Create directories for output files
. cap mkdir "$MyProject/processed"

. cap mkdir "$MyProject/processed/intermediate"

. cap mkdir "$MyProject/results"

. cap mkdir "$MyProject/results/figures"

. cap mkdir "$MyProject/results/intermediate"

. cap mkdir "$MyProject/results/tables"

. 
. * Run project analysis
. do "$MyProject/scripts/1_process_data.do"

. ************
. * SCRIPT: 1_process_data.do
. * PURPOSE: imports the raw datasets and converts them into a stata-readable fo
> rmat
. ************
. 
. // MA zoning data
. insheet using "$MyProject/data/ma-zoning-laws/ma-zoning-laws.csv", comma clear
(3 vars, 352 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/ma_zoning_laws_uncleaned.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/ma_zoning_laws_uncleaned.dta saved

. 
. // US states legality data
. // insheet using "$MyProject/data/TODO", comma clear
. // compress
. // save "$MyProject/processed/intermediate/TODO_uncleaned.dta", replace
. 
. // MA dispensaries data
. insheet using "$MyProject/data/dispensaries.csv", comma clear
(66 vars, 944 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/dispensaries_uncleaned.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/dispensaries_uncleaned.dta saved

. 
. // MA property assessments data
. forvalues y = 2014/2021 {
  2.         insheet using "$MyProject/data/property_assessment/property-assessm
> ent-fy`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/property_assessments_ma_`y'
> _uncleaned.dta", replace
  5. }
(56 vars, 164,091 obs)
  variable st_name was str25 now str24
  variable u_heat_typ was str2 now str1
  (328,182 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/property_assessments_ma_2014_uncleaned.dta saved
(56 vars, 168,115 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  variable full_address was str55 now str48
  variable u_heat_typ was str2 now str1
  (1,681,150 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/property_assessments_ma_2015_uncleaned.dta saved
(77 vars, 169,199 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (338,398 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/property_assessments_ma_2016_uncleaned.dta saved
(75 vars, 170,910 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (341,820 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/property_assessments_ma_2017_uncleaned.dta saved
(75 vars, 172,841 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/property_assessments_ma_2018_uncleaned.dta saved
(75 vars, 174,668 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (349,336 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/property_assessments_ma_2019_uncleaned.dta saved
(75 vars, 175,052 obs)
  variable st_name_suf was str5 now str4
  (175,052 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/property_assessments_ma_2020_uncleaned.dta saved
(63 vars, 177,091 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/property_assessments_ma_2021_uncleaned.dta saved

. 
. // Zillow home value data
. insheet using "$MyProject/data/zhvi_sa_35_65.csv", comma clear
(274 vars, 30,468 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/zillow_home_values_uncleaned.dta", rep
> lace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/zillow_home_values_uncleaned.dta saved

. 
. // Boston crash data
. insheet using "$MyProject/data/boston_crashes.csv", comma clear
(25 vars, 108,919 obs)

. compress
  variable v23 was str170 now str169
  (108,919 bytes saved)

. save "$MyProject/processed/intermediate/crashes_boston_uncleaned.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crashes_boston_uncleaned.dta saved

. 
. // US crash data
. insheet using "$MyProject/data/fars_nhtsa_fatality_rates_by_state.csv", comma 
> clear
(56 vars, 53 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/crashes_us_uncleaned.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crashes_us_uncleaned.dta saved

. 
. // Boston crime data
. forvalues y = 2015/2021 {
  2.         insheet using "$MyProject/data/crime-incident-reports/crime-inciden
> t-reports-`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crime_boston_`y'_uncleaned.
> dta", replace
  5. }
(27 vars, 68,528 obs)
  variable v10 was str2045 now str1638
  variable v11 was str1860 now str860
  variable v14 was str1557 now str528
  variable v20 was str70 now str66
  variable v21 was str12 now str2
  variable v22 was str579 now str11
  variable v23 was str253 now str3
  variable v24 was str88 now str65
  variable v27 was str158 now str1
  (236,284,544 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_boston_2015_uncleaned.dta saved
(14 vars, 78,877 obs)
  variable v12 was str1040 now str603
  (34,469,249 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_boston_2016_uncleaned.dta saved
(13 vars, 65,746 obs)
  variable v8 was str2045 now str1192
  (56,081,338 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_boston_2017_uncleaned.dta saved
(18 vars, 67,639 obs)
  variable v17 was str65 now str1
  variable v18 was str47 now str7
  (7,034,456 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_boston_2018_uncleaned.dta saved
(13 vars, 58,357 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_boston_2019_uncleaned.dta saved
(18 vars, 49,833 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_boston_2020_uncleaned.dta saved
(20 vars, 51,644 obs)
  variable v6 was str2045 now str1975
  (3,615,080 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_boston_2021_uncleaned.dta saved

. 
. // US crime data
. forvalues y = 2008/2019 {
  2.         import excel "$MyProject/data/fbi_offenses_known_to_law_enforcement
> /fbi_offenses_known_to_law_enforcement_`y'.xls", clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crime_us_`y'_uncleaned.dta"
> , replace
  5. }
(17 vars, 8,784 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2008_uncleaned.dta saved
(13 vars, 9,159 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2009_uncleaned.dta saved
(13 vars, 9,321 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2010_uncleaned.dta saved
(18 vars, 9,325 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2011_uncleaned.dta saved
(15 vars, 9,502 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2012_uncleaned.dta saved
(17 vars, 9,306 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2013_uncleaned.dta saved
(14 vars, 9,368 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2014_uncleaned.dta saved
(14 vars, 9,409 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2015_uncleaned.dta saved
(13 vars, 2,626 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2016_uncleaned.dta saved
(19 vars, 9,593 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2017_uncleaned.dta saved
(13 vars, 9,266 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2018_uncleaned.dta saved
(13 vars, 8,117 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/interm
    > ediate/crime_us_2019_uncleaned.dta saved

. 
. ** EOF
. 
end of do-file

. 
. do "$MyProject/scripts/2a_clean_ma_zoning_data.do"

. ************
. * SCRIPT: 2a_clean_ma_zoning_data.do
. * PURPOSE: processes the massachusetts zoning dataset in preparation for analy
> sis
. ************
. 
. use "$MyProject/processed/intermediate/ma_zoning_laws_uncleaned.dta", clear

. 
. * Rename variable names to be values from the first row
. foreach var of varlist * {
  2.         local x = strtoname(`var'[1])
  3.         rename `var' `x'
  4. }

. drop in 1
(1 observation deleted)

. 
. * Drop cities with no response
. drop if Adult_Use_Status == "No response" & Delivery_Status == "No response"
(22 observations deleted)

. 
. * Create dummy variables for legality of retail, adult use, and delivery
. gen retail_legal = Adult_Use_Status == "Zoning in place" | Adult_Use_Status ==
>  "No zoning in place" | Adult_Use_Status == "Zoning in place, retail license c
> ap" | Adult_Use_Status == "Zoning in place; license cap" | Adult_Use_Status ==
>  "Zoning in place; license cap; delivery ban" | Adult_Use_Status == "Zoning in
>  place; retail cap" | Adult_Use_Status == "Zoning in place; retail license cap
> "

. gen adult_use_legal = retail_legal | Adult_Use_Status == "Retail ban" | Adult_
> Use_Status == "Zoning in place; retail ban"

. gen delivery_legal = Adult_Use_Status != "Ban in place" & (Delivery_Status == 
> "Delivery permitted" | Delivery_Status == "Delivery permitted; Host Community 
> Agreement signed with business maintaining/pursuing delivery license" | Delive
> ry_Status == "No zoning in place" | Adult_Use_Status == "No zoning in place")

. drop Adult_Use_Status

. drop Delivery_Status

. 
. * Rename address variable
. rename City_Town city

. 
. compress
  variable retail_legal was float now byte
  variable adult_use_legal was float now byte
  variable delivery_legal was float now byte
  (2,961 bytes saved)

. save "$MyProject/processed/ma_zoning_laws.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/ma_zon
    > ing_laws.dta saved

. 
. ** EOF
. 
end of do-file

. // do "$MyProject/scripts/2b_clean_states_legality_data.do"
. do "$MyProject/scripts/2c_clean_dispensaries_data.do"

. ************
. * SCRIPT: 2c_clean_dispensaries_data.do
. * PURPOSE: processes the dispensaries dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/dispensaries_uncleaned.dta", clear

. 
. * Select only desired columns
. local keep business_name license_type establishment_address_1 establishment_ci
> ty establishment_zip_code establishment_county commence_operations_date

. ds
business_n~e  applicatio~e  mailing_ad~2  all_packet~t  name
dba_name      lic_fee_am~t  mailing_city  priority_t~e  establishm~o
dba_regist~y  establishm~1  mailing_st~e  app_create~e  dbe
massachuse~s  establishm~2  mailing_zi~e  disability~s  cultivatio~t
approved_l~e  establis~ity  longitude     lesbian_ga~e  cultivatio~r
priority_a~e  establish~te  latitude      minority_o~s  cnb_dt_of_~e
dph_rmd_nu~r  establish~de  geocoded_c~n  veteran_ow~s  commence_o~e
license_nu~r  establis~nty  not_a_dbe     woman_owne~s  row_ct
license_type  business_a~1  establishm~s  cooperativ~n  activity_d~e
lic_status    business_a~2  square_foo~t  establishm~n  version
applicatio~r  business_c~y  abutters_c~t  county
applicatio~s  business_s~e  is_abutter~d  county_lat
rmd_priori~n  business_z~e  cooperativ~m  county_long
name_of_rmd   mailing_ad~1  cooperativ~y  user_id

. local vars `r(varlist)'

. local tokeep : list vars & keep

. keep `tokeep'

. 
. * Keep only entries that have certain license types
. keep if license_type=="Marijuana Retailer"
(564 observations deleted)

. drop license_type

. 
. * Keep only entries that have commenced operations
. keep if commence_operations_date!=""
(186 observations deleted)

. 
. * Create variables for commencement operations month, day, and year
. split commence_operations_date, parse("/")
variables created as string: 
commence_o~1  commence_o~2  commence_o~3

. destring commence_operations_date1, gen(commence_month)
commence_operations_date1: all characters numeric; commence_month generated as b
> yte

. destring commence_operations_date2, gen(commence_day)
commence_operations_date2: all characters numeric; commence_day generated as byt
> e

. destring commence_operations_date3, gen(commence_year)
commence_operations_date3: all characters numeric; commence_year generated as in
> t

. drop commence_operations_date commence_operations_date1 commence_operations_da
> te2 commence_operations_date3

. 
. * Change format of zip code to be 5 digits
. format establishment_zip_code %05.0f

. 
. * Rename address variable
. rename establishment_address_1 establishment_address

. 
. compress
  variable business_name was str60 now str58
  variable establishment_address was str54 now str51
  variable establishment_city was str18 now str16
  (1,358 bytes saved)

. save "$MyProject/processed/dispensaries.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispen
    > saries.dta saved

. 
. ** EOF
. 
end of do-file

. // do "$MyProject/scripts/2d_clean_prop_assessments_data.do"
. // do "$MyProject/scripts/2e_clean_home_values_data.do"
. do "$MyProject/scripts/2f_clean_boston_crash_data.do"

. ************
. * SCRIPT: 2f_clean_boston_crash_data.do
. * PURPOSE: processes the boston crash dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/crashes_boston_uncleaned.dta", clear

. 
. * Delete first 2 rows
. drop if _n==1 | _n==2
(2 observations deleted)

. compress
  variable v1 was str1658 now str12
  (179,277,382 bytes saved)

. 
. * Rename variable names to be values from the first row
. foreach var of varlist * {
  2.         local x = strtoname(`var'[1])
  3.         rename `var' `x'
  4. }

. drop in 1
(1 observation deleted)

. 
. * Select only desired columns
. local keep Crash_Number Crash_Date Crash_Time Number_of_Vehicles Total_Nonfata
> l_Injuries Total_Fatal_Injuries Road_Surface_Condition Ambient_Light Weather_C
> ondition Distance_From_Nearest_Roadway_In

. ds
Crash_Number  Maximum_In~d  Vehicle_Ac~h  Ambient_Li~t  Distance_F~t
City_Town_~e  Number_of_~s  Vehicle_Tr~s  Weather_Co~n  Distance_F~k
Crash_Date    Total_Nonf~s  Most_Harmf~s  At_Roadway~n  Non_Motori~e
Crash_Time    Total_Fata~s  Vehicle_Co~n  Distance_F~n  X_Cooordin~e
Crash_Seve~y  Manner_of_~n  Road_Surfa~n  Distance_F~r  Y_Cooordin~e

. local vars `r(varlist)'

. local tokeep : list vars & keep

. keep `tokeep'

. 
. * Create variables for crash month, day, and year
. split Crash_Date, parse("-")
variables created as string: 
Crash_Date1  Crash_Date2  Crash_Date3

. destring Crash_Date1, gen(crash_date)
Crash_Date1: all characters numeric; crash_date generated as byte

. gen crash_month = month(date(Crash_Date2,"M"))

. destring Crash_Date3, gen(crash_year)
Crash_Date3: all characters numeric; crash_year generated as int

. drop Crash_Date Crash_Date1 Crash_Date2 Crash_Date3

. 
. * Create variable for crash hour (0-23)
. split Crash_Time, parse(" ")
variables created as string: 
Crash_Time1  Crash_Time2

. split Crash_Time1, parse(":")
variables created as string: 
Crash_Time11  Crash_Time12

. destring Crash_Time11, gen(crash_hour)
Crash_Time11: all characters numeric; crash_hour generated as byte

. gen crash_hour_24 = mod(crash_hour + 12 * (Crash_Time2 == "PM" & crash_hour !=
>  12) - 12 * (Crash_Time2 == "AM" & crash_hour == 12), 24)

. drop Crash_Time Crash_Time1 Crash_Time2 Crash_Time11 Crash_Time12

. 
. * Create variable for day of the week (0 = Sunday, 1 = Monday, ..., 6 = Saturd
> ay)
. gen crash_dow = dow(mdy(crash_month, crash_date, crash_year))

. 
. * Convert numerical string variables to ints
. destring Number_of_Vehicles, gen(num_vehicles)
Number_of_Vehicles: all characters numeric; num_vehicles generated as byte

. destring Total_Nonfatal_Injuries, gen(num_nonfatal_injuries)
Total_Nonfatal_Injuries: all characters numeric; num_nonfatal_injuries generated
>  as byte

. destring Total_Fatal_Injuries, gen(num_fatal_injuries)
Total_Fatal_Injuries: all characters numeric; num_fatal_injuries generated as by
> te

. drop Number_of_Vehicles Total_Nonfatal_Injuries Total_Fatal_Injuries

. 
. * Generate dummy variables for road conditions
. gen road_condition_ice = Road_Surface_Condition==`"Ice"'

. gen road_condition_wet = Road_Surface_Condition==`"Wet"' | Road_Surface_Condit
> ion==`"Water (standing, moving)"'

. gen road_condition_snow = Road_Surface_Condition==`"Snow"' | Road_Surface_Cond
> ition==`"Slush"'

. gen road_condition_unknown = Road_Surface_Condition==`"Unknown"' | Road_Surfac
> e_Condition==`"Other"' | Road_Surface_Condition==`"Not reported"'

. drop Road_Surface_Condition

. 
. * Generate dummy variables for light conditions
. gen light_condition_dark = Ambient_Light==`"Dark - roadway not lighted"' | Amb
> ient_Light==`"Dark - unknown roadway lighting"'

. gen light_condition_dark_lighted = Ambient_Light==`"Dark - lighted roadway"'

. gen light_condition_dawn = Ambient_Light==`"Dawn"'

. gen light_condition_dusk = Ambient_Light==`"Dusk"'

. gen light_condition_unknown = Ambient_Light==`"Unknown"' | Ambient_Light==`"Ot
> her"' | Ambient_Light==`"Not reported"'

. drop Ambient_Light

. 
. * Generate dummy variables for weather conditions
. split Weather_Condition, parse("/")
variables created as string: 
Weather_Co~1  Weather_Co~2

. gen weather_condition_rain = Weather_Condition1==`"Rain"' | Weather_Condition2
> ==`"Rain"'

. gen weather_condition_snow = Weather_Condition1==`"Blowing sand, snow"' | Weat
> her_Condition2==`"Blowing sand, snow"' | Weather_Condition1==`"Snow"' | Weathe
> r_Condition2==`"Snow"'

. gen weather_condition_sleet = Weather_Condition1==`"Sleet, hail (freezing rain
>  or drizzle)"' | Weather_Condition2==`"Sleet, hail (freezing rain or drizzle)"
> '

. gen weather_condition_fog = Weather_Condition1==`"Fog, smog, smoke"' | Weather
> _Condition2==`"Fog, smog, smoke"'

. gen weather_condition_wind = Weather_Condition1==`"Severe crosswinds"' | Weath
> er_Condition2==`"Severe crosswinds"'

. gen weather_condition_unknown = (Weather_Condition1==`"Unknown"' & (Weather_Co
> ndition2==`"Unknown"' | Weather_Condition2==`"Other"')) | Weather_Condition1==
> `"Not reported"'

. drop Weather_Condition Weather_Condition1 Weather_Condition2

. 
. compress
  variable crash_month was float now byte
  variable crash_hour_24 was float now byte
  variable crash_dow was float now byte
  variable road_condition_ice was float now byte
  variable road_condition_wet was float now byte
  variable road_condition_snow was float now byte
  variable road_condition_unknown was float now byte
  variable light_condition_dark was float now byte
  variable light_condition_dark_lighted was float now byte
  variable light_condition_dawn was float now byte
  variable light_condition_dusk was float now byte
  variable light_condition_unknown was float now byte
  variable weather_condition_rain was float now byte
  variable weather_condition_snow was float now byte
  variable weather_condition_sleet was float now byte
  variable weather_condition_fog was float now byte
  variable weather_condition_wind was float now byte
  variable weather_condition_unknown was float now byte
  variable Crash_Number was str12 now str7
  (6,426,044 bytes saved)

. save "$MyProject/processed/crashes_boston.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/crashe
    > s_boston.dta saved

. 
. ** EOF
. 
end of do-file

. // do "$MyProject/scripts/2g_clean_us_crash_data.do"
. // do "$MyProject/scripts/2h_clean_boston_crime_data.do"
. // do "$MyProject/scripts/2i_clean_us_crime_data.do"
. 
. // do "$MyProject/scripts/3a_summarize_ma_zoning_data.do"
. // do "$MyProject/scripts/3b_summarize_states_legality_data.do"
. // do "$MyProject/scripts/3c_summarize_dispensaries_data.do"
. // do "$MyProject/scripts/3d_summarize_prop_assessments_data.do"
. // do "$MyProject/scripts/3e_summarize_home_values_data.do"
. // do "$MyProject/scripts/3f_summarize_boston_crash_data.do"
. // do "$MyProject/scripts/3g_summarize_us_crash_data.do"
. // do "$MyProject/scripts/3h_summarize_boston_crime_data.do"
. // do "$MyProject/scripts/3i_summarize_us_crime_data.do"
. 
. * End log
. di "End date and time: $S_DATE $S_TIME"
End date and time: 22 Mar 2022 11:59:21

. log close
      name:  <unnamed>
       log:  /Users/anniebryan/Documents/College/2021-22/14.33/Project/scripts/l
> ogs/2022.03.22-11.58.37.log.txt
  log type:  text
 closed on:  22 Mar 2022, 11:59:21
--------------------------------------------------------------------------------
