-------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/anniebryan/Documents/College/2021-22/14.33/Proj
> ect/scripts/logs/2022.03.28-22.16.03.log.txt
  log type:  text
 opened on:  28 Mar 2022, 22:16:03

. 
. ssc install estout, replace
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. 
. * Stata version control
. version 17

. 
. * Create directories for output files
. cap mkdir "$MyProject/processed"

. cap mkdir "$MyProject/processed/intermediate"

. cap mkdir "$MyProject/results"

. cap mkdir "$MyProject/results/figures"

. cap mkdir "$MyProject/results/intermediate"

. cap mkdir "$MyProject/results/tables"

. 
. * Run project analysis
. do "$MyProject/scripts/1_process_data.do"

. ************
. * SCRIPT: 1_process_data.do
. * PURPOSE: imports the raw datasets and converts them into a stat
> a-readable format
. ************
. 
. // MA zoning data
. insheet using "$MyProject/data/ma-zoning-laws/ma-zoning-laws.csv"
> , comma clear
(3 vars, 352 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/ma_zoning_laws_uncleaned.
> dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/ma_zoning_laws_uncleaned.dta saved

. 
. // US states legality data
. insheet using "$MyProject/data/us-states-legality.csv", comma cle
> ar
(6 vars, 51 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/us_states_legality.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/us_states_legality.dta saved

. 
. // MA dispensaries data
. insheet using "$MyProject/data/dispensaries.csv", comma clear
(66 vars, 944 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/dispensaries_uncleaned.dt
> a", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/dispensaries_uncleaned.dta saved

. 
. // MA property assessments data
. forvalues y = 2014/2021 {
  2.         insheet using "$MyProject/data/property_assessment/pro
> perty-assessment-fy`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/property_asses
> sments_ma_`y'_uncleaned.dta", replace
  5. }
(56 vars, 164,091 obs)
  variable st_name was str25 now str24
  variable u_heat_typ was str2 now str1
  (328,182 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/property_assessments_ma_2014_uncleaned.
    > dta saved
(56 vars, 168,115 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  variable full_address was str55 now str48
  variable u_heat_typ was str2 now str1
  (1,681,150 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/property_assessments_ma_2015_uncleaned.
    > dta saved
(77 vars, 169,199 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (338,398 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/property_assessments_ma_2016_uncleaned.
    > dta saved
(75 vars, 170,910 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (341,820 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/property_assessments_ma_2017_uncleaned.
    > dta saved
(75 vars, 172,841 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/property_assessments_ma_2018_uncleaned.
    > dta saved
(75 vars, 174,668 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (349,336 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/property_assessments_ma_2019_uncleaned.
    > dta saved
(75 vars, 175,052 obs)
  variable st_name_suf was str5 now str4
  (175,052 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/property_assessments_ma_2020_uncleaned.
    > dta saved
(63 vars, 177,091 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/property_assessments_ma_2021_uncleaned.
    > dta saved

. 
. // Zillow home value data
. insheet using "$MyProject/data/zhvi_sa_35_65.csv", comma clear
(274 vars, 30,468 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/zillow_home_values_unclea
> ned.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/zillow_home_values_uncleaned.dta saved

. 
. // Boston crash data
. insheet using "$MyProject/data/boston_crashes.csv", comma clear
(25 vars, 108,919 obs)

. compress
  variable v23 was str170 now str169
  (108,919 bytes saved)

. save "$MyProject/processed/intermediate/crashes_boston_uncleaned.
> dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crashes_boston_uncleaned.dta saved

. 
. // US crash data
. insheet using "$MyProject/data/fars_nhtsa_fatality_rates_by_state
> .csv", comma clear
(56 vars, 53 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/crashes_us_uncleaned.dta"
> , replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crashes_us_uncleaned.dta saved

. 
. // Boston crime data
. forvalues y = 2015/2022 {
  2.         insheet using "$MyProject/data/crime-incident-reports/
> crime-incident-reports-`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crime_boston_`
> y'_uncleaned.dta", replace
  5. }
(17 vars, 53,597 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_boston_2015_uncleaned.dta saved
(17 vars, 99,430 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_boston_2016_uncleaned.dta saved
(17 vars, 101,338 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_boston_2017_uncleaned.dta saved
(17 vars, 98,888 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_boston_2018_uncleaned.dta saved
(17 vars, 87,184 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_boston_2019_uncleaned.dta saved
(17 vars, 70,894 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_boston_2020_uncleaned.dta saved
(17 vars, 71,721 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_boston_2021_uncleaned.dta saved
(17 vars, 14,650 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_boston_2022_uncleaned.dta saved

. 
. // Offense codes for Boston crime data
. import excel "$MyProject/data/rmsoffensecodes.xlsx", clear
(2 vars, 577 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/offense_codes.dta", repla
> ce
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/offense_codes.dta saved

. 
. // US crime data
. forvalues y = 2008/2019 {
  2.         import excel "$MyProject/data/fbi_offenses_known_to_la
> w_enforcement/fbi_offenses_known_to_law_enforcement_`y'.xls", cle
> ar
  3.         compress
  4.         save "$MyProject/processed/intermediate/crime_us_`y'_u
> ncleaned.dta", replace
  5. }
(17 vars, 8,784 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2008_uncleaned.dta saved
(13 vars, 9,159 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2009_uncleaned.dta saved
(13 vars, 9,321 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2010_uncleaned.dta saved
(18 vars, 9,325 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2011_uncleaned.dta saved
(15 vars, 9,502 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2012_uncleaned.dta saved
(17 vars, 9,306 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2013_uncleaned.dta saved
(14 vars, 9,368 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2014_uncleaned.dta saved
(14 vars, 9,409 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2015_uncleaned.dta saved
(13 vars, 2,626 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2016_uncleaned.dta saved
(19 vars, 9,593 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2017_uncleaned.dta saved
(13 vars, 9,266 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2018_uncleaned.dta saved
(13 vars, 8,117 obs)
  (0 bytes saved)
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/intermediate/crime_us_2019_uncleaned.dta saved

. 
. ** EOF
. 
end of do-file

. 
. do "$MyProject/scripts/2a_clean_ma_zoning_data.do"

. ************
. * SCRIPT: 2a_clean_ma_zoning_data.do
. * PURPOSE: processes the massachusetts zoning dataset in preparat
> ion for analysis
. ************
. 
. use "$MyProject/processed/intermediate/ma_zoning_laws_uncleaned.d
> ta", clear

. 
. * Rename variable names to be values from the first row
. foreach var of varlist * {
  2.         local x = strtoname(`var'[1])
  3.         rename `var' `x'
  4. }

. drop in 1
(1 observation deleted)

. 
. * Drop cities with no response
. drop if Adult_Use_Status == "No response" & Delivery_Status == "N
> o response"
(22 observations deleted)

. 
. * Create dummy variables for legality of retail, adult use, and d
> elivery
. gen retail_legal = Adult_Use_Status == "Zoning in place" | Adult_
> Use_Status == "No zoning in place" | Adult_Use_Status == "Zoning 
> in place, retail license cap" | Adult_Use_Status == "Zoning in pl
> ace; license cap" | Adult_Use_Status == "Zoning in place; license
>  cap; delivery ban" | Adult_Use_Status == "Zoning in place; retai
> l cap" | Adult_Use_Status == "Zoning in place; retail license cap
> "

. gen adult_use_legal = retail_legal | Adult_Use_Status == "Retail 
> ban" | Adult_Use_Status == "Zoning in place; retail ban"

. gen delivery_legal = Adult_Use_Status != "Ban in place" & (Delive
> ry_Status == "Delivery permitted" | Delivery_Status == "Delivery 
> permitted; Host Community Agreement signed with business maintain
> ing/pursuing delivery license" | Delivery_Status == "No zoning in
>  place" | Adult_Use_Status == "No zoning in place")

. drop Adult_Use_Status

. drop Delivery_Status

. 
. * Rename address variable
. rename City_Town city

. 
. * Save dataset
. compress
  variable retail_legal was float now byte
  variable adult_use_legal was float now byte
  variable delivery_legal was float now byte
  (2,961 bytes saved)

. save "$MyProject/processed/ma_zoning_laws.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/ma_zoning_laws.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2b_clean_dispensaries_data.do"

. ************
. * SCRIPT: 2b_clean_dispensaries_data.do
. * PURPOSE: processes the dispensaries dataset in preparation for 
> analysis
. ************
. 
. use "$MyProject/processed/intermediate/dispensaries_uncleaned.dta
> ", clear

. 
. * Select only desired columns
. keep business_name license_type establishment_address_1 establish
> ment_city establishment_zip_code establishment_county commence_op
> erations_date

. 
. * Keep only entries that have certain license types
. keep if license_type=="Marijuana Retailer"
(564 observations deleted)

. drop license_type

. 
. * Keep only entries that have commenced operations
. keep if commence_operations_date!=""
(186 observations deleted)

. 
. * Create variables for commencement operations month, day, and ye
> ar
. split commence_operations_date, parse("/")
variables created as string: 
commence_o~1  commence_o~2  commence_o~3

. destring commence_operations_date1, gen(commence_month)
commence_operations_date1: all characters numeric; commence_month g
> enerated as byte

. destring commence_operations_date2, gen(commence_day)
commence_operations_date2: all characters numeric; commence_day gen
> erated as byte

. destring commence_operations_date3, gen(commence_year)
commence_operations_date3: all characters numeric; commence_year ge
> nerated as int

. drop commence_operations_date commence_operations_date1 commence_
> operations_date2 commence_operations_date3

. 
. * Change format of zip code to be 5 digits
. format establishment_zip_code %05.0f

. 
. * Rename address variable
. rename establishment_address_1 establishment_address

. 
. * Save dataset
. compress
  variable business_name was str60 now str58
  variable establishment_address was str54 now str51
  variable establishment_city was str18 now str16
  (1,358 bytes saved)

. save "$MyProject/processed/dispensaries.dta", replace
file
    /Users/anniebryan/Documents/College/2021-22/14.33/Project/pro
    > cessed/dispensaries.dta saved

. 
. ** EOF
. 
end of do-file

. // do "$MyProject/scripts/2c_clean_prop_assessments_data.do"
. // do "$MyProject/scripts/2d_clean_home_values_data.do"
. // do "$MyProject/scripts/2e_clean_boston_crash_data.do"
. // do "$MyProject/scripts/2f_clean_us_crash_data.do"
. // do "$MyProject/scripts/2g_clean_boston_crime_data.do"
. // do "$MyProject/scripts/2h_clean_us_crime_data.do"
. 
. // do "$MyProject/scripts/3a_summarize_ma_zoning_data.do"
. // do "$MyProject/scripts/3b_summarize_states_legality_data.do"
. // do "$MyProject/scripts/3c_summarize_dispensaries_data.do"
. // do "$MyProject/scripts/3d_summarize_prop_assessments_data.do"
. // do "$MyProject/scripts/3e_summarize_home_values_data.do"
. // do "$MyProject/scripts/3f_summarize_boston_crash_data.do"
. // do "$MyProject/scripts/3g_summarize_us_crash_data.do"
. // do "$MyProject/scripts/3h_summarize_boston_crime_data.do"
. // do "$MyProject/scripts/3i_summarize_us_crime_data.do"
. 
. // do "$MyProject/scripts/4a_regression_dispensaries_on_property_
> assessments.do"
. 
. * End log
. di "End date and time: $S_DATE $S_TIME"
End date and time: 28 Mar 2022 22:16:47

. log close
      name:  <unnamed>
       log:  /Users/anniebryan/Documents/College/2021-22/14.33/Proj
> ect/scripts/logs/2022.03.28-22.16.03.log.txt
  log type:  text
 closed on:  28 Mar 2022, 22:16:47
-------------------------------------------------------------------
