-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/anniebryan/Documents/College/2021-22/14.33/Project/scripts/logs/2022.04.04-20.10.12.log.txt
  log type:  text
 opened on:   4 Apr 2022, 20:10:12

. 
. ssc install estout, replace
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install geodist
checking geodist consistency and verifying not already installed...
all files already exist and are up to date.

. 
. * Stata version control
. version 17

. 
. * Create directories for output files
. cap mkdir "$MyProject/processed"

. cap mkdir "$MyProject/processed/intermediate"

. cap mkdir "$MyProject/results"

. cap mkdir "$MyProject/results/figures"

. cap mkdir "$MyProject/results/intermediate"

. cap mkdir "$MyProject/results/tables"

. 
. * Run project analysis
. do "$MyProject/scripts/1_process_data.do"

. ************
. * SCRIPT: 1_process_data.do
. * PURPOSE: imports the raw datasets and converts them into a stata-readable format
. ************
. 
. // MA zoning data
. insheet using "$MyProject/data/ma-zoning-laws/ma-zoning-laws.csv", comma clear
(3 vars, 352 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/ma_zoning_laws_uncleaned.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/ma_zoning_laws_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/ma_zoning_laws_uncleaned.dta saved

. 
. // US states legality data
. insheet using "$MyProject/data/us-states-legality.csv", comma clear
(6 vars, 51 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/us_states_legality.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/us_states_legality.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/us_states_legality.dta saved

. 
. // MA dispensaries data
. insheet using "$MyProject/data/dispensaries.csv", comma clear
(66 vars, 887 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/dispensaries_uncleaned.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/dispensaries_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/dispensaries_uncleaned.dta saved

. 
. // MA property assessments data
. forvalues y = 2014/2021 {
  2.         insheet using "$MyProject/data/property_assessment/property-assessment-fy`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/property_assessments_ma_`y'_uncleaned.dta", replace
  5. }
(56 vars, 164,091 obs)
  variable st_name was str25 now str24
  variable u_heat_typ was str2 now str1
  (328,182 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2014_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2014_uncleaned.dta saved
(56 vars, 168,115 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  variable full_address was str55 now str48
  variable u_heat_typ was str2 now str1
  (1,681,150 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2015_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2015_uncleaned.dta saved
(77 vars, 169,199 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (338,398 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2016_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2016_uncleaned.dta saved
(75 vars, 170,910 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (341,820 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2017_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2017_uncleaned.dta saved
(75 vars, 172,841 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2018_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2018_uncleaned.dta saved
(75 vars, 174,668 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (349,336 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2019_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2019_uncleaned.dta saved
(75 vars, 175,052 obs)
  variable st_name_suf was str5 now str4
  (175,052 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2020_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2020_uncleaned.dta saved
(63 vars, 177,091 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2021_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2021_uncleaned.dta saved

. 
. // Zillow home value data
. insheet using "$MyProject/data/zhvi_sa_35_65.csv", comma clear
(274 vars, 30,468 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/zillow_home_values_uncleaned.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/zillow_home_values_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/zillow_home_values_uncleaned.dta saved

. 
. // Boston crash data
. forvalues y = 2008/2021 {
  2.         insheet using "$MyProject/data/boston-crashes/`y'_Crashes.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crashes_boston_`y'_uncleaned.dta", replace
  5. }
(117 vars, 136,384 obs)
  variable rdwy was str105 now str104
  variable non_mtrst_type_cl was str78 now str77
  variable non_mtrst_loc_cl was str150 now str149
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str52 now str51
  (681,920 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2008_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2008_uncleaned.dta saved
(115 vars, 117,776 obs)
  variable rdwy was str119 now str118
  variable near_int_rdwy was str50 now str49
  variable exit_rte was str5 now str4
  variable non_mtrst_type_cl was str118 now str117
  variable non_mtrst_actn_cl was str136 now str135
  variable non_mtrst_loc_cl was str146 now str145
  variable rmv_doc_ids was str66 now str65
  variable crash_rpt_ids was str70 now str69
  variable tostreetname was str56 now str55
  (1,059,984 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2009_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2009_uncleaned.dta saved
(115 vars, 115,643 obs)
  variable rdwy was str124 now str123
  variable non_mtrst_type_cl was str83 now str82
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str50 now str49
  (693,858 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2010_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2010_uncleaned.dta saved
(115 vars, 120,632 obs)
  variable vehc_seq_events_cl was str727 now str726
  variable rdwy was str126 now str125
  variable near_int_rdwy was str50 now str49
  variable mm_rte was str6 now str5
  variable non_mtrst_type_cl was str91 now str90
  variable non_mtrst_actn_cl was str136 now str135
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str63 now str62
  variable tostreetname was str56 now str55
  (1,206,320 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2011_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2011_uncleaned.dta saved
(115 vars, 122,646 obs)
  variable rdwy was str125 now str124
  variable near_int_rdwy was str50 now str49
  variable non_mtrst_type_cl was str83 now str82
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str62 now str61
  (735,876 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2012_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2012_uncleaned.dta saved
(115 vars, 125,285 obs)
  variable vehc_seq_events_cl was str1128 now str1127
  variable drvr_cntrb_circ_cl was str512 now str511
  variable rdwy was str128 now str127
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str88 now str87
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str100 now str99
  variable crash_rpt_ids was str94 now str93
  variable drvr_distracted_cl was str145 now str144
  variable fromstreetname was str43 now str42
  (1,378,135 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2013_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2013_uncleaned.dta saved
(115 vars, 130,233 obs)
  variable rdwy was str143 now str142
  variable non_mtrst_type_cl was str83 now str82
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str63 now str62
  variable drvr_distracted_cl was str182 now str181
  variable tostreetname was str56 now str55
  (1,041,864 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2014_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2014_uncleaned.dta saved
(115 vars, 139,050 obs)
  variable rdwy was str143 now str142
  variable near_int_rdwy was str50 now str49
  variable non_mtrst_type_cl was str100 now str99
  variable non_mtrst_loc_cl was str134 now str133
  variable rmv_doc_ids was str66 now str65
  variable crash_rpt_ids was str62 now str61
  (834,300 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2015_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2015_uncleaned.dta saved
(115 vars, 143,474 obs)
  variable rdwy was str138 now str137
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str82 now str81
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str151 now str150
  variable crash_rpt_ids was str160 now str159
  variable drvr_distracted_cl was str194 now str193
  (1,147,792 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2016_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2016_uncleaned.dta saved
(115 vars, 145,068 obs)
  variable drvr_cntrb_circ_cl was str512 now str511
  variable rdwy was str149 now str148
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str170 now str169
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str210 now str209
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str73 now str72
  variable drvr_distracted_cl was str228 now str227
  (1,305,612 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2017_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2017_uncleaned.dta saved
(117 vars, 142,272 obs)
  variable rdwy was str114 now str113
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str83 now str82
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str73 now str72
  (995,904 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2018_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2018_uncleaned.dta saved
(117 vars, 140,939 obs)
  variable rdwy was str129 now str128
  variable near_int_rdwy was str53 now str52
  variable non_mtrst_type_cl was str70 now str69
  variable non_mtrst_actn_cl was str136 now str135
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str63 now str62
  (986,573 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2019_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2019_uncleaned.dta saved
(116 vars, 100,724 obs)
  variable vehc_seq_events_cl was str815 now str814
  variable rdwy was str125 now str124
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str66 now str65
  variable non_mtrst_actn_cl was str136 now str135
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str100 now str99
  variable crash_rpt_ids was str88 now str87
  (805,792 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2020_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2020_uncleaned.dta saved
(115 vars, 123,064 obs)
  variable rdwy was str118 now str117
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str66 now str65
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str98 now str97
  variable lclty_name was str15 now str13
  (984,512 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2021_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2021_uncleaned.dta saved

. 
. // US crash data
. insheet using "$MyProject/data/fars_nhtsa_fatality_rates_by_state.csv", comma clear
(56 vars, 53 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/crashes_us_uncleaned.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_us_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_us_uncleaned.dta saved

. 
. // Boston crime data
. forvalues y = 2015/2022 {
  2.         insheet using "$MyProject/data/crime-incident-reports/crime-incident-reports-`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crime_boston_`y'_uncleaned.dta", replace
  5. }
(17 vars, 53,597 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2015_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2015_uncleaned.dta saved
(17 vars, 99,430 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2016_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2016_uncleaned.dta saved
(17 vars, 101,338 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2017_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2017_uncleaned.dta saved
(17 vars, 98,888 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2018_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2018_uncleaned.dta saved
(17 vars, 87,184 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2019_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2019_uncleaned.dta saved
(17 vars, 70,894 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2020_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2020_uncleaned.dta saved
(17 vars, 71,721 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2021_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2021_uncleaned.dta saved
(17 vars, 14,650 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2022_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2022_uncleaned.dta saved

. 
. // Offense codes for Boston crime data
. import excel "$MyProject/data/rmsoffensecodes.xlsx", clear
(2 vars, 577 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/offense_codes.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/offense_codes.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/offense_codes.dta saved

. 
. // US crime data
. forvalues y = 2008/2019 {
  2.         import excel "$MyProject/data/fbi_offenses_known_to_law_enforcement/fbi_offenses_known_to_law_enforcement_`y'.xls", clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crime_us_`y'_uncleaned.dta", replace
  5. }
(17 vars, 8,784 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2008_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2008_uncleaned.dta saved
(13 vars, 9,159 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2009_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2009_uncleaned.dta saved
(13 vars, 9,321 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2010_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2010_uncleaned.dta saved
(18 vars, 9,325 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2011_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2011_uncleaned.dta saved
(15 vars, 9,502 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2012_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2012_uncleaned.dta saved
(17 vars, 9,306 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2013_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2013_uncleaned.dta saved
(14 vars, 9,368 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2014_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2014_uncleaned.dta saved
(14 vars, 9,409 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2015_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2015_uncleaned.dta saved
(13 vars, 2,626 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2016_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2016_uncleaned.dta saved
(19 vars, 9,593 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2017_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2017_uncleaned.dta saved
(13 vars, 9,266 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2018_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2018_uncleaned.dta saved
(13 vars, 8,117 obs)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2019_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2019_uncleaned.dta saved

. 
. // Zip code centroids data
. insheet using "$MyProject/data/ZIP_Code_Population_Weighted_Centroids.csv", comma clear
(10 vars, 35,352 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/zip_code_centroids_uncleaned.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/zip_code_centroids_uncleaned.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/zip_code_centroids_uncleaned.dta saved

. 
. ** EOF
. 
end of do-file

. 
. do "$MyProject/scripts/2a_clean_ma_zoning_data.do"

. ************
. * SCRIPT: 2a_clean_ma_zoning_data.do
. * PURPOSE: processes the massachusetts zoning dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/ma_zoning_laws_uncleaned.dta", clear

. 
. * Rename variable names to be values from the first row
. foreach var of varlist * {
  2.         local x = strtoname(`var'[1])
  3.         rename `var' `x'
  4. }

. drop in 1
(1 observation deleted)

. 
. * Drop cities with no response
. drop if Adult_Use_Status == "No response" & Delivery_Status == "No response"
(22 observations deleted)

. 
. * Create dummy variables for legality of retail, adult use, and delivery
. gen retail_legal = Adult_Use_Status == "Zoning in place" | Adult_Use_Status == "No zoning in place" | Adult_Use_Status == "Zoning in place, retail license cap" | Adult_Use_Statu
> s == "Zoning in place; license cap" | Adult_Use_Status == "Zoning in place; license cap; delivery ban" | Adult_Use_Status == "Zoning in place; retail cap" | Adult_Use_Status == 
> "Zoning in place; retail license cap"

. gen adult_use_legal = retail_legal | Adult_Use_Status == "Retail ban" | Adult_Use_Status == "Zoning in place; retail ban"

. gen delivery_legal = Adult_Use_Status != "Ban in place" & (Delivery_Status == "Delivery permitted" | Delivery_Status == "Delivery permitted; Host Community Agreement signed with
>  business maintaining/pursuing delivery license" | Delivery_Status == "No zoning in place" | Adult_Use_Status == "No zoning in place")

. drop Adult_Use_Status

. drop Delivery_Status

. 
. * Rename address variable
. rename City_Town city

. drop if missing(city)
(1 observation deleted)

. 
. * Save dataset
. compress
  variable retail_legal was float now byte
  variable adult_use_legal was float now byte
  variable delivery_legal was float now byte
  (2,952 bytes saved)

. save "$MyProject/processed/ma_zoning_laws.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/ma_zoning_laws.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/ma_zoning_laws.dta saved

. outsheet using "$MyProject/processed/ma_zoning_laws.csv", comma replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/ma_zoning_laws.csv not found)

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2b_clean_dispensaries_data.do"

. ************
. * SCRIPT: 2b_clean_dispensaries_data.do
. * PURPOSE: processes the dispensaries dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/dispensaries_uncleaned.dta", clear

. 
. * Select only desired columns
. keep business_name dba_name license_type establishment_address_1 establishment_city establishment_zip_code establishment_county commence_operations_date latitude longitude

. 
. * Keep only entries that have certain license types
. keep if license_type=="Marijuana Retailer"
(520 observations deleted)

. drop license_type

. 
. * Keep only entries that have commenced operations
. keep if commence_operations_date!=""
(162 observations deleted)

. 
. * Create variables for commencement operations month, day, and year
. split commence_operations_date, parse("/")
variables created as string: 
commence_o~1  commence_o~2  commence_o~3

. destring commence_operations_date1, gen(commence_month)
commence_operations_date1: all characters numeric; commence_month generated as byte

. destring commence_operations_date2, gen(commence_day)
commence_operations_date2: all characters numeric; commence_day generated as byte

. destring commence_operations_date3, gen(commence_year)
commence_operations_date3: all characters numeric; commence_year generated as int

. drop commence_operations_date commence_operations_date1 commence_operations_date2 commence_operations_date3

. 
. * Change format of zip code to be 5 digits
. format establishment_zip_code %05.0f

. 
. * Rename address variable
. rename establishment_address_1 establishment_address

. 
. * Manually update lat/lon coordinates of HVV Massachusetts, Inc.
. replace lat = 42.387990 if establishment_address=="220 William McClellan Hwy"
(1 real change made)

. replace lon = -71.017820 if establishment_address=="220 William McClellan Hwy"
(1 real change made)

. 
. * Save dataset
. compress
  variable business_name was str60 now str58
  variable dba_name was str64 now str32
  variable establishment_address was str54 now str51
  variable establishment_city was str18 now str16
  (7,995 bytes saved)

. save "$MyProject/processed/dispensaries.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries.dta saved

. outsheet using "$MyProject/processed/dispensaries.csv", comma replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries.csv not found)

. 
. * Create dataset with only dispensaries in the Boston area
. keep if establishment_city=="Boston" | establishment_city=="Brookline"
(194 observations deleted)

. gen id = _n

. order id

. compress
  variable id was float now byte
  variable business_name was str58 now str34
  variable dba_name was str32 now str14
  variable establishment_address was str51 now str25
  variable establishment_city was str16 now str9
  variable establishment_county was str10 now str7
  (891 bytes saved)

. save "$MyProject/processed/dispensaries_boston.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries_boston.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries_boston.dta saved

. outsheet using "$MyProject/processed/dispensaries_boston.csv", comma replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries_boston.csv not found)

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2c_clean_prop_assessments_data.do"

. ************
. * SCRIPT: 2c_clean_prop_assessments_data.do
. * PURPOSE: processes the massachusetts property assessments datasets in preparation for analysis
. ************
. 
. * Clean dataset for each year, one at a time
. forvalues y = 2014/2021 {
  2.         use "$MyProject/processed/intermediate/property_assessments_ma_`y'_uncleaned.dta", clear
  3.         
.         * Rename 2021 variables to have the same name as other years
.         if `y' == 2021 {
  4.                 rename bldg_value av_bldg
  5.                 rename yr_remodel yr_remod
  6.                 rename res_floor num_floors
  7.                 rename bed_rms r_bdrms
  8.                 rename full_bth r_full_bth
  9.                 rename hlf_bth r_half_bth
 10.                 rename kitchen r_kitch
 11.                 rename heat_type r_heat_typ
 12.         }
 13.         
.         * Select only desired columns
.         keep zipcode av_bldg living_area yr_built yr_remod num_floors r_bdrms r_full_bth r_half_bth r_kitch r_heat_typ
 14.         
.         * Create variable for the year the building was assessed
.         gen year_assessed = `y'
 15.         
.         * Change zipcode column to be of uniform format across years
.         if `y' == 2018 | `y' == 2019 | `y' == 2020 | `y' == 2021 {
 16.                 tostring zipcode, replace
 17.                 replace zipcode = "0" + zipcode
 18.         }
 19.         else {
 20.                 replace zipcode = substr(zipcode, 1, 5)
 21.         }
 22.         
.         * Convert dollar amount av_bldg to int (2021 only)
.         if `y' == 2021 {
 23.                 split av_bldg, parse(".00") gen(dollars)
 24.                 destring dollars1, replace ignore("$,")
 25.                 drop av_bldg
 26.                 rename dollars1 av_bldg
 27.         }
 28. 
.         * Drop entries with missing or 0-valued data
.         drop if av_bldg == 0 | missing(av_bldg)
 29.         drop if yr_built == 0 | missing(yr_built)
 30.         drop if num_floors == 0 | missing(num_floors)
 31.         drop if r_bdrms == 0 | missing(r_bdrms)
 32.         
.         * Create variable for years since built
.         gen yrs_since_built = `y' - yr_built
 33.         
.         * Create variable for years since remodel
.         replace yr_remod = 0 if missing(yr_remod)
 34.         replace yr_remod = yr_built if yr_remod==0
 35.         gen yrs_since_remodel = `y' - yr_remod
 36.         drop yr_built yr_remod
 37.         
.         * Replace missing values with 0
.         replace living_area = 0 if missing(living_area)
 38.         replace r_full_bth = 0 if missing(r_full_bth)
 39.         replace r_half_bth = 0 if missing(r_half_bth)
 40.         
.         * Replace string kitchen values with ints
.         if `y' == 2020 {
 41.                 replace r_kitch = "0" if missing(r_kitch)
 42.                 replace r_kitch = substr(r_kitch, 1, 1)
 43.                 replace r_kitch = "0" if real(r_kitch)==. & r_kitch=="N"
 44.                 replace r_kitch = "1" if real(r_kitch)==. & r_kitch!="N"
 45.                 destring r_kitch, replace
 46.         }
 47.         else {
 48.                 replace r_kitch = 0 if missing(r_kitch)
 49.         }
 50.         
.         * Create dummy variables for heat type
.         gen heat_electric = r_heat_typ==`"E"' | r_heat_typ==`"E - Electric"'
 51.         gen heat_forced_hot_air = r_heat_typ==`"F"' | r_heat_typ==`"F - Forced Hot Air"'
 52.         gen heat_pump = r_heat_typ==`"P"' | r_heat_typ==`"P - Heat Pump"'
 53.         gen heat_space = r_heat_typ==`"S"' | r_heat_typ==`"S - Space Heat"'
 54.         gen heat_steam = r_heat_typ==`"W"' | r_heat_typ==`"W - Ht Water/Steam"'
 55.         gen heat_other = r_heat_typ==`"O"' | r_heat_typ==`"O - Other"'
 56.         drop r_heat_typ
 57.         
.         * Save dataset for year `y'
.         compress
 58.         save "$MyProject/processed/intermediate/property_assessments_ma_`y'.dta", replace
 59. }
(164,091 real changes made)
(21,893 observations deleted)
(6,422 observations deleted)
(461 observations deleted)
(72,696 observations deleted)
(0 real changes made)
(43,130 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  variable zipcode was str6 now str5
  (1,690,713 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2014.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2014.dta saved
(168,104 real changes made)
(22,311 observations deleted)
(7,645 observations deleted)
(518 observations deleted)
(74,865 observations deleted)
(2,866 real changes made)
(42,378 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  variable zipcode was str6 now str5
  (1,694,952 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2015.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2015.dta saved
(169,193 real changes made)
(22,306 observations deleted)
(8,193 observations deleted)
(526 observations deleted)
(75,606 observations deleted)
(2,934 real changes made)
(41,584 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  variable zipcode was str6 now str5
  (1,689,336 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2016.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2016.dta saved
(170,903 real changes made)
(22,308 observations deleted)
(9,035 observations deleted)
(561 observations deleted)
(76,542 observations deleted)
(3,030 real changes made)
(40,567 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  variable zipcode was str6 now str5
  (1,686,528 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2017.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2017.dta saved
zipcode was int now str4
variable zipcode was str4 now str5
(172,841 real changes made)
(22,307 observations deleted)
(9,719 observations deleted)
(558 observations deleted)
(77,912 observations deleted)
(3,084 real changes made)
(39,493 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  (1,620,970 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2018.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2018.dta saved
zipcode was int now str4
variable zipcode was str4 now str5
(174,668 real changes made)
(22,445 observations deleted)
(10,281 observations deleted)
(527 observations deleted)
(79,215 observations deleted)
(3,189 real changes made)
(38,519 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  (1,617,200 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2019.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2019.dta saved
zipcode was int now str4
variable zipcode was str4 now str5
(175,052 real changes made)
(17,692 observations deleted)
(15,681 observations deleted)
(335 observations deleted)
(80,015 observations deleted)
(37,082 real changes made)
(37,083 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(10 real changes made)
(61,319 real changes made)
(3 real changes made)
(3 real changes made)
r_kitch: all characters numeric; replaced as byte
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  (1,594,554 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2020.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2020.dta saved
zipcode was int now str4
variable zipcode was str4 now str5
(177,091 real changes made)
variable created as string: 
dollars1
dollars1: characters $ , removed; replaced as long
(18079 missing values generated)
(18,079 observations deleted)
(15,325 observations deleted)
(320 observations deleted)
(17,109 observations deleted)
(59,977 real changes made)
(59,977 real changes made)
(6 real changes made)
(6 real changes made)
(92,652 real changes made)
(10 real changes made)
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  (3,030,192 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2021.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2021.dta saved

. 
. * Merge datasets from 2014-2021 into one dataset containing all years
. use "$MyProject/processed/intermediate/property_assessments_ma_2014.dta", clear

. forvalues y = 2015/2021 {
  2.         append using "$MyProject/processed/intermediate/property_assessments_ma_`y'.dta"
  3. }
(variable living_area was int, now long to accommodate using data's values)

. 
. * Save dataset containing all years
. compress
  (0 bytes saved)

. save "$MyProject/processed/property_assessments_ma.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/property_assessments_ma.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/property_assessments_ma.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2d_clean_home_values_data.do"

. ************
. * SCRIPT: 2d_clean_home_values_data.do
. * PURPOSE: processes the zillow home value dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/zillow_home_values_uncleaned.dta", clear

. 
. * Select only desired columns
. drop regionid sizerank regiontype statename city metro countyname

. 
. * Rename zipcode
. rename regionname zipcode

. 
. * Rename v10-v274 to their label (month/year)
. foreach v of varlist v* {
  2.         local x: variable label `v'
  3.         local year = substr("`x'", 1, 4)
  4.         local month = substr("`x'", 6, 2)
  5.         rename `v' hv_`month'_`year'
  6. }

. 
. * Save dataset
. compress
  (0 bytes saved)

. save "$MyProject/processed/zillow_home_values.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zillow_home_values.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zillow_home_values.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2e_clean_boston_crash_data.do"

. ************
. * SCRIPT: 2e_clean_boston_crash_data.do
. * PURPOSE: processes the boston crash dataset in preparation for analysis
. ************
. 
. * Clean dataset for each year, one at a time
. forvalues y = 2014/2021 {
  2.         use "$MyProject/processed/intermediate/crashes_boston_`y'_uncleaned.dta", clear
  3.         
.         * Rename variables so all years are the same
.         if `y' == 2020 | `y' == 2021 {
  4.                 rename CRASH_NUMB crash_numb
  5.         }
  6.         
.         * Select only desired columns
.         keep crash_numb city_town_name crash_date_text crash_hour numb_vehc  numb_nonfatal_injr numb_fatal_injr ambnt_light_descr weath_cond_descr road_surf_cond_descr lat lon a
> ge_drvr_yngst age_drvr_oldest drvr_distracted_cl
  7.         
.         * Rename variables
.         rename crash_numb crash_num
  8.         rename city_town_name city_town
  9.         rename numb_vehc num_vehicles
 10.         rename numb_nonfatal_injr num_nonfatal_injuries
 11.         rename numb_fatal_injr num_fatal_injuries
 12.         
.         * Drop observations with no vehicles involved
.         drop if num_vehicles==0
 13.         
.         * Replace missing lat/lon data with average of city/town
.         replace city_town = proper(city_town)
 14.         by city_town, sort: egen mean_lat = mean(lat)
 15.         by city_town, sort: egen mean_lon = mean(lon)
 16.         replace lat = mean_lat if missing(lat)
 17.         replace lon = mean_lon if missing(lon)
 18.         drop city_town mean_lat mean_lon
 19.         order crash_num lat lon
 20.         
.         * Save dataset for year `y'
.         compress
 21.         save "$MyProject/processed/intermediate/crashes_boston_`y'.dta", replace
 22. }
(14 observations deleted)
(130,219 real changes made)
(3 missing values generated)
(3 missing values generated)
(5,203 real changes made)
(5,203 real changes made)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2014.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2014.dta saved
(3 observations deleted)
(139,047 real changes made)
(4 missing values generated)
(4 missing values generated)
(6,347 real changes made)
(6,347 real changes made)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2015.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2015.dta saved
(2 observations deleted)
(143,472 real changes made)
(6,800 real changes made)
(6,800 real changes made)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2016.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2016.dta saved
(1 observation deleted)
(145,067 real changes made)
(1 missing value generated)
(1 missing value generated)
(6,144 real changes made)
(6,144 real changes made)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2017.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2017.dta saved
(0 observations deleted)
(142,272 real changes made)
(5,949 real changes made)
(5,949 real changes made)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2018.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2018.dta saved
(0 observations deleted)
(140,939 real changes made)
(7,888 real changes made)
(7,888 real changes made)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2019.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2019.dta saved
(1 observation deleted)
(100,723 real changes made)
(1 missing value generated)
(1 missing value generated)
(3,618 real changes made)
(3,618 real changes made)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2020.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2020.dta saved
(1 observation deleted)
(123,063 real changes made)
(6,006 real changes made)
(6,006 real changes made)
  (0 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2021.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2021.dta saved

. 
. * Merge datasets from 2014-2021 into one dataset containing all years
. use "$MyProject/processed/intermediate/crashes_boston_2014.dta", clear

. forvalues y = 2015/2021 {
  2.         append using "$MyProject/processed/intermediate/crashes_boston_`y'.dta"
  3. }
(variable drvr_distracted_cl was str181, now str245 to accommodate using data's values)

. 
. * Create variables for crash month, day, and year
. split crash_date_text, parse("/")
variables created as string: 
crash_date~1  crash_date~2  crash_date~3

. destring crash_date_text1, gen(crash_month)
crash_date_text1: all characters numeric; crash_month generated as byte

. destring crash_date_text2, gen(crash_day)
crash_date_text2: all characters numeric; crash_day generated as byte

. destring crash_date_text3, gen(crash_year)
crash_date_text3: all characters numeric; crash_year generated as int

. drop crash_date_text crash_date_text1 crash_date_text2 crash_date_text3

. 
. * Create variable for day of the week (0 = Sunday, 1 = Monday, ..., 6 = Saturday)
. gen crash_dow = dow(mdy(crash_month, crash_day, crash_year))

. 
. * Create variable for crash hour (0-23)
. gen hour = substr(crash_hour, 1, 2)
(446 missing values generated)

. destring hour, replace
hour: all characters numeric; replaced as byte
(446 missing values generated)

. gen am = substr(crash_hour, 6, 2)=="AM"

. gen ch = cond(am, cond(hour==12, 0, hour), cond(hour==12, 12, hour+12))
(446 missing values generated)

. drop crash_hour hour am

. rename ch crash_hour

. 
. * Generate dummy variables for road conditions
. gen road_condition_ice = road_surf_cond_descr==`"Ice"'

. gen road_condition_wet = road_surf_cond_descr==`"Wet"' | road_surf_cond_descr==`"Water (standing, moving)"'

. gen road_condition_snow = road_surf_cond_descr==`"Snow"' | road_surf_cond_descr==`"Slush"'

. gen road_condition_unknown = road_surf_cond_descr==`"Unknown"' | road_surf_cond_descr==`"Other"' | road_surf_cond_descr==`"Not reported"' | road_surf_cond_descr==`"Reported but 
> invalid"'

. drop road_surf_cond_descr

. 
. * Generate dummy variables for light conditions
. gen light_condition_dark = ambnt_light_descr==`"Dark - roadway not lighted"' | ambnt_light_descr==`"Dark - unknown roadway lighting"'

. gen light_condition_dark_lighted = ambnt_light_descr==`"Dark - lighted roadway"'

. gen light_condition_dawn = ambnt_light_descr==`"Dawn"'

. gen light_condition_dusk = ambnt_light_descr==`"Dusk"'

. gen light_condition_unknown = ambnt_light_descr==`"Unknown"' | ambnt_light_descr==`"Other"' | ambnt_light_descr==`"Not reported"' | ambnt_light_descr==`"Reported but invalid"'

. drop ambnt_light_descr

. 
. * Generate dummy variables for weather conditions
. split weath_cond_descr, parse("/")
variables created as string: 
weath_cond~1  weath_cond~2

. gen weather_condition_rain = weath_cond_descr1==`"Rain"' | weath_cond_descr2==`"Rain"'

. gen weather_condition_snow = weath_cond_descr1==`"Snow"' | weath_cond_descr2==`"Snow"' | weath_cond_descr1==`"Blowing sand, snow"' | weath_cond_descr2==`"Blowing sand, snow"'

. gen weather_condition_sleet = weath_cond_descr1==`"Sleet, hail (freezing rain or drizzle)"' | weath_cond_descr2==`"Sleet, hail (freezing rain or drizzle)"'

. gen weather_condition_fog = weath_cond_descr1==`"Fog, smog, smoke"' | weath_cond_descr2==`"Fog, smog, smoke"'

. gen weather_condition_wind = weath_cond_descr1==`"Severe crosswinds"' | weath_cond_descr2==`"Severe crosswinds"'

. gen weather_condition_unknown = weath_cond_descr1==`"Not reported"' | weath_cond_descr1==`"Reported but invalid"' | ((weath_cond_descr1==`"Unknown"' | weath_cond_descr1==`"Other
> "') & (weath_cond_descr2==`"Unknown"' | weath_cond_descr2==`"Other"'))

. drop weath_cond_descr weath_cond_descr1 weath_cond_descr2

. 
. * Generate dummy variables for young/old drivers
. gen young_driver_under_16 = age_drvr_yngst==`"<16"' | age_drvr_oldest==`"<16"'

. gen young_driver_under_18 = (age_drvr_yngst==`"16-17"' | age_drvr_oldest==`"16-17"') & !young_driver_under_16

. gen young_driver_under_21 = (age_drvr_yngst==`"18-20"' | age_drvr_oldest==`"18-20"') & !(young_driver_under_16 | young_driver_under_18)

. gen young_driver_under_25 = (age_drvr_yngst==`"21-24"' | age_drvr_oldest==`"21-24"') & !(young_driver_under_16 | young_driver_under_18 | young_driver_under_21)

. gen old_driver_over_84 = age_drvr_yngst==`">84"' | age_drvr_oldest==`">84"'

. gen old_driver_over_74 = (age_drvr_yngst==`"75-84"' | age_drvr_oldest==`"75-84"') & !old_driver_over_84

. gen old_driver_over_64 = (age_drvr_yngst==`"65-74"' | age_drvr_oldest==`"65-74"') & !(old_driver_over_84 | old_driver_over_74)

. drop age_drvr_yngst age_drvr_oldest

. 
. * Generate dummy variables for distracted drivers
. split drvr_distracted_cl, parse(" / ")
variables created as string: 
drvr_dist~l1  drvr_dist~l2  drvr_distr~3  drvr_distr~4  drvr_distr~5  drvr_distr~6  drvr_distr~7  drvr_distr~8  drvr_distr~9  drvr_dist~10  drvr_dist~11  drvr_dist~12

. drop drvr_distracted_cl

. gen distracted = 0

. forvalues i = 1/12 {
  2.         split drvr_distracted_cl`i', parse(": ") generate(d_`i'_)
  3.         replace distracted = 1 if d_`i'_2 == `"Manually operating an electronic device"' | d_`i'_2 == `"Other activity, electronic device"' | d_`i'_2 == `"Talking on hand-hel
> d electronic device"' | d_`i'_2 == `"Talking on hands-free electronic device"' | d_`i'_2 == `"Other activity (searching, eating, personal hygiene, etc.)"' | d_`i'_2 == `"Externa
> l distraction (outside the vehicle)"'
  4. }
variables created as string: 
d_1_1  d_1_2
(63,158 real changes made)
variables created as string: 
d_2_1  d_2_2
(9,293 real changes made)
variables created as string: 
d_3_1  d_3_2
(914 real changes made)
variables created as string: 
d_4_1  d_4_2
(106 real changes made)
variables created as string: 
d_5_1  d_5_2
(13 real changes made)
variables created as string: 
d_6_1  d_6_2
(1 real change made)
variables created as string: 
d_7_1  d_7_2
(1 real change made)
variables created as string: 
d_8_1  d_8_2
(0 real changes made)
variables created as string: 
d_9_1  d_9_2
(0 real changes made)
variables created as string: 
d_10_1  d_10_2
(0 real changes made)
variables created as string: 
d_11_1  d_11_2
(0 real changes made)
variables created as string: 
d_12_1  d_12_2
(0 real changes made)

. forvalues i = 1/12 {
  2.         drop drvr_distracted_cl`i' d_`i'_1 d_`i'_2
  3. }

. 
. * Save dataset containing all years
. compress
  variable crash_dow was float now byte
  variable crash_hour was float now byte
  variable road_condition_ice was float now byte
  variable road_condition_wet was float now byte
  variable road_condition_snow was float now byte
  variable road_condition_unknown was float now byte
  variable light_condition_dark was float now byte
  variable light_condition_dark_lighted was float now byte
  variable light_condition_dawn was float now byte
  variable light_condition_dusk was float now byte
  variable light_condition_unknown was float now byte
  variable weather_condition_rain was float now byte
  variable weather_condition_snow was float now byte
  variable weather_condition_sleet was float now byte
  variable weather_condition_fog was float now byte
  variable weather_condition_wind was float now byte
  variable weather_condition_unknown was float now byte
  variable young_driver_under_16 was float now byte
  variable young_driver_under_18 was float now byte
  variable young_driver_under_21 was float now byte
  variable young_driver_under_25 was float now byte
  variable old_driver_over_84 was float now byte
  variable old_driver_over_74 was float now byte
  variable old_driver_over_64 was float now byte
  variable distracted was float now byte
  (79,860,150 bytes saved)

. save "$MyProject/processed/crashes_boston.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/crashes_boston.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/crashes_boston.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2f_clean_us_crash_data.do"

. ************
. * SCRIPT: 2f_clean_us_crash_data.do
. * PURPOSE: processes the us crash dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/crashes_us_uncleaned.dta", clear

. 
. * Delete first row
. drop if _n==1
(1 observation deleted)

. compress
  (0 bytes saved)

. 
. * Delete row with USA totals
. drop if State=="USA"
(1 observation deleted)

. 
. * Select only desired columns
. keep State v3-v28 v30-v55

. 
. * Rename v3-v28 to their label (fatalities in a given yer)
. foreach v of varlist v3-v28 {
  2.         local x: variable label `v'
  3.         rename `v' num_fatalities_`x'
  4. }

. * Rename v30-v55 to their label (fatalities per 100 million miles traveled)
. foreach v of varlist v30-v55 {
  2.         local x: variable label `v'
  3.         rename `v' fatality_rate_`x'
  4. }

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2g_clean_boston_crime_data.do"

. ************
. * SCRIPT: 2g_clean_boston_crime_data.do
. * PURPOSE: processes the boston crime dataset in preparation for analysis
. ************
. 
. * Clean dataset of offense codes
. use "$MyProject/processed/intermediate/offense_codes.dta", clear

. foreach var of varlist * {
  2.         local x = strtoname(`var'[1])
  3.         rename `var' `x'
  4. }

. drop in 1
(1 observation deleted)

. 
. * Rename variables
. rename CODE code

. rename NAME name

. 
. * Convert code variable to int type
. destring code, replace
code: all characters numeric; replaced as int

. 
. * Drop duplicate codes, keeping the first occurrence
. sort code

. qui by code: gen dup = cond(_N==1, 0, _n)

. drop if dup > 1
(151 observations deleted)

. drop dup

. 
. * Create dummy variables for each type of crime
. gen arson = (code >= 900 & code <= 930)

. gen assault = (code >= 401 & code <= 433) | (code >= 801 & code <= 803) | (code==1702) | (code >= 1725 & code <= 1727) | (code == 3170)

. gen auto_law_violation = (code == 2624) | (code >= 2900 & code <= 2917)

. gen burglary = (code >= 510 & code <= 562) | (code == 2010) | (code == 2616)

. gen counterfeiting = (code == 1001) | (code == 1002)

. gen destruction = (code >= 1401 & code <= 1415) | (code == 3106) | (code == 3701) | (code == 3802) | (code == 3831)

. gen disorderly = (code >= 2401 & code <= 2407) | (code >= 3301 & code <= 3305)

. gen drug = (code >= 1805 & code <= 1875) | (code == 2609) | (code >= 3021 & code <= 3023)

. gen dui = (code == 2101) | (code == 2102)

. gen embezzlement = (code == 1201)

. gen extortion = (code == 2604)

. gen family_offenses = (code >= 2003 & code <= 2005)

. gen fraud = (code >= 1101 & code <= 1109)

. gen gambling = (code >= 1901 & code <= 1904)

. gen harassment = (code == 804) | (code == 2629) | (code == 2670) | (code == 3151)

. gen homicide = (code >= 111 & code <= 125)

. gen kidnapping = (code == 2511) | (code == 2622)

. gen larceny = (code >= 611 & code <= 649)

. gen liquor_law = (code >= 2201 & code <= 2204) | (code == 2646)

. gen motor_vehicle_theft = (code >= 701 & code <= 790)

. gen obscene_material = (code == 2623 | code == 2628)

. gen prostitution = (code >= 1601 & code <= 1607)

. gen robbery = (code >= 301 & code <= 381)

. gen sex_offenses = (code >= 211 & code <= 271) | (code >= 1610 & code <= 1723) | (code == 1730) | (code == 1731)

. gen stolen_property = (code >= 1300 & code <= 1304)

. gen weapon = (code >= 1501 & code <= 1510) | (code == 3119)

. 
. gen motor_vehicle_accident = (code >= 3701 & code <= 3831)

. 
. gen crimes_against_property = (arson + burglary + counterfeiting + destruction + embezzlement + extortion + fraud + larceny + motor_vehicle_theft + robbery + stolen_property >= 
> 1)

. gen crimes_against_persons = (assault + homicide + kidnapping + sex_offenses >= 1)

. gen crimes_against_society = (auto_law_violation + disorderly + drug + dui + family_offenses + gambling + liquor_law + obscene_material + prostitution + weapon >= 1)

. 
. drop arson assault auto_law_violation burglary counterfeiting destruction disorderly drug dui embezzlement extortion family_offenses fraud gambling harassment homicide kidnappin
> g larceny liquor_law motor_vehicle_theft obscene_material prostitution robbery sex_offenses stolen_property weapon

. 
. rename code offense_code

. 
. compress
  variable motor_vehicle_accident was float now byte
  variable crimes_against_property was float now byte
  variable crimes_against_persons was float now byte
  variable crimes_against_society was float now byte
  variable name was str58 now str50
  (8,500 bytes saved)

. save "$MyProject/processed/offense_codes.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/offense_codes.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/offense_codes.dta saved

. 
. * Clean dataset for each year, one at a time
. forvalues y = 2015/2022 {
  2.         use "$MyProject/processed/intermediate/crime_boston_`y'_uncleaned.dta", clear
  3.         
.         * Merge with offense codes dataset
.         sort offense_code
  4.         merge m:1 offense_code using "$MyProject/processed/offense_codes.dta"
  5.         drop if _merge==2
  6.         
.         * Select only desired columns
.         keep district year month day_of_week hour latitude longitude motor_vehicle_accident crimes_against_property crimes_against_persons crimes_against_society
  7.         
.         * Convert day_of_week variable to int (0 = Sunday, 1 = Monday, ..., 6 = Saturday)
.         rename day_of_week dow
  8.         gen day_of_week = cond(dow == "Sunday", 0, cond(dow == "Monday", 1, cond(dow == "Tuesday", 2, cond(dow == "Wednesday", 3, cond(dow == "Thursday", 4, cond(dow == "Frid
> ay", 5, cond(dow == "Saturday", 6, .)))))))
  9.         drop dow
 10.         
.         * Save dataset for year `y'
.         compress
 11.         save "$MyProject/processed/intermediate/crime_boston_`y'.dta", replace
 12. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                           225
        from master                         0  (_merge==1)
        from using                        225  (_merge==2)

    Matched                            53,597  (_merge==3)
    -----------------------------------------
(225 observations deleted)
  variable day_of_week was float now byte
  (160,791 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2015.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2015.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                           221
        from master                         0  (_merge==1)
        from using                        221  (_merge==2)

    Matched                            99,430  (_merge==3)
    -----------------------------------------
(221 observations deleted)
  variable day_of_week was float now byte
  (298,290 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2016.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2016.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                           236
        from master                         0  (_merge==1)
        from using                        236  (_merge==2)

    Matched                           101,338  (_merge==3)
    -----------------------------------------
(236 observations deleted)
  variable day_of_week was float now byte
  (304,014 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2017.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2017.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                           241
        from master                         0  (_merge==1)
        from using                        241  (_merge==2)

    Matched                            98,888  (_merge==3)
    -----------------------------------------
(241 observations deleted)
  variable day_of_week was float now byte
  (296,664 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2018.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2018.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,948
        from master                     1,693  (_merge==1)
        from using                        255  (_merge==2)

    Matched                            85,491  (_merge==3)
    -----------------------------------------
(255 observations deleted)
  variable day_of_week was float now byte
  (261,552 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2019.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2019.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                         5,029
        from master                     4,718  (_merge==1)
        from using                        311  (_merge==2)

    Matched                            66,176  (_merge==3)
    -----------------------------------------
(311 observations deleted)
  variable day_of_week was float now byte
  (212,682 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2020.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2020.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                         5,648
        from master                     5,339  (_merge==1)
        from using                        309  (_merge==2)

    Matched                            66,382  (_merge==3)
    -----------------------------------------
(309 observations deleted)
  variable day_of_week was float now byte
  (215,163 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2021.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2021.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                           407
        from master                        91  (_merge==1)
        from using                        316  (_merge==2)

    Matched                            14,559  (_merge==3)
    -----------------------------------------
(316 observations deleted)
  variable day_of_week was float now byte
  (43,950 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2022.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2022.dta saved

. 
. * Merge datasets from 2014-2021 into one dataset containing all years
. use "$MyProject/processed/intermediate/crime_boston_2015.dta", clear

. forvalues y = 2016/2022 {
  2.         append using "$MyProject/processed/intermediate/crime_boston_`y'.dta"
  3. }
(variable district was str3, now str8 to accommodate using data's values)

. 
. * Drop rows with unknown offense_code
. drop if missing(crimes_against_property)
(11,841 observations deleted)

. 
. * Drop rows with missing location data
. drop if (missing(district) | district == "External") & (missing(latitude) | missing(longitude))
(318 observations deleted)

. 
. * Replace missing latitude/longitude data with median of district
. replace latitude = . if latitude <= 40
(71,714 real changes made, 71,714 to missing)

. bysort district: egen median_latitude = median(latitude)

. replace latitude = median_latitude if missing(latitude)
(93,926 real changes made)

. drop median_latitude

. 
. replace longitude = . if longitude >= -50
(71,714 real changes made, 71,714 to missing)

. bysort district: egen median_longitude = median(longitude)

. replace longitude = median_longitude if missing(longitude)
(93,926 real changes made)

. drop median_longitude

. 
. drop district

. 
. * Save dataset containing all years
. compress
  (0 bytes saved)

. save "$MyProject/processed/crime_boston.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/crime_boston.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/crime_boston.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2h_clean_us_crime_data.do"

. ************
. * SCRIPT: 2h_clean_us_crime_data.do
. * PURPOSE: processes the fbi table 8 dataset in preparation for analysis
. ************
. 
. forvalues y = 2008/2019 {
  2.         use "$MyProject/processed/intermediate/crime_us_`y'_uncleaned.dta", clear
  3.         
.         * Drop first 3 rows
.         drop if _n==1 | _n==2 | _n==3
  4.         
.         * Drop any additional empty columns
.         keep A B C D E F G H I J K L M
  5.         
.         * Drop end rows with notes about dataset
.         if `y' == 2008 {
  6.                 drop if _n >= 8774
  7.         }
  8.         else if `y' == 2009 {
  9.                 drop if _n >= 9148
 10.         }
 11.         else if `y' == 2010 {
 12.                 drop if _n >= 9312
 13.         }
 14.         else if `y' == 2011 {
 15.                 drop if _n >= 9316
 16.         }
 17.         else if `y' == 2012 {
 18.                 drop if _n >= 9493
 19.         }
 20.         else if `y' == 2013 {
 21.                 drop if _n >= 9294
 22.         }
 23.         else if `y' == 2014 {
 24.                 drop if _n >= 9349
 25.         }
 26.         else if `y' == 2015 {
 27.                 drop if _n >= 9397
 28.         }
 29.         else if `y' == 2016 {
 30.                 split A, parse(" - ") gen(state)
 31.                 drop A state2
 32.                 rename state1 A
 33.                 order A
 34.                 drop if _n == 1
 35.                 drop if _n >= 2614
 36.         }
 37.         else if `y' == 2017 {
 38.                 drop if _n >= 9581
 39.         }
 40.         else if `y' == 2018 {
 41.                 drop if _n >= 9254
 42.         }
 43.         else if `y' == 2019 {
 44.                 drop if _n >= 8107
 45.         }
 46.         
.         * Rename variables
.         rename A state
 47.         rename B city
 48.         rename C population
 49.         rename D violent_crime
 50.         rename E murder
 51.         rename F rape
 52.         rename G robbery
 53.         rename H assault
 54.         rename I property_crime
 55.         rename J burglary
 56.         rename K larceny
 57.         rename L mv_theft
 58.         rename M arson
 59.         drop if _n == 1
 60.         
.         * Convert string variables to numeric
.         destring population, replace
 61.         destring violent_crime, replace
 62.         destring murder, replace
 63.         destring rape, replace
 64.         destring robbery, replace
 65.         destring assault, replace
 66.         destring property_crime, replace
 67.         destring burglary, replace
 68.         destring larceny, replace
 69.         destring mv_theft, replace
 70.         destring arson, replace
 71.         
.         * Fill in missing data with 0
.         replace murder = 0 if missing(murder)
 72.         replace rape = 0 if missing(rape)
 73.         replace robbery = 0 if missing(robbery)
 74.         replace assault = 0 if missing(assault)
 75.         replace burglary = 0 if missing(burglary)
 76.         replace larceny = 0 if missing(larceny)
 77.         replace mv_theft = 0 if missing(mv_theft)
 78.         replace arson = 0 if missing(arson)
 79.         
.         replace violent_crime = murder + rape + robbery + assault
 80.         replace property_crime = burglary + larceny + mv_theft + arson
 81.         
.         * Rename variables to have year `y' appended
.         rename population population_`y'
 82.         rename violent_crime violent_crime_`y'
 83.         rename murder murder`y'
 84.         rename rape rape_`y'
 85.         rename robbery robbery_`y'
 86.         rename assault assault_`y'
 87.         rename property_crime property_crime_`y'
 88.         rename burglary burglary_`y'
 89.         rename larceny larceny_`y'
 90.         rename mv_theft mv_theft_`y'
 91.         rename arson arson_`y'
 92.         
.         * Fill in states column
.         replace state = state[_n-1] if missing(state)
 93.         replace state = proper(state)
 94.         replace state = "District of Columbia" if state == "District Of Columbia"
 95.         
.         * Remove footnote marking from state/city names
.         qui forval j = 0/9 {
 96.                 replace state = subinstr(state, "`j'", "", .)
 97.                 replace city = subinstr(city, "`j'", "", .)
 98.         }
 99.         
.         * Create variable for city, state
.         merge m:1 state using "$MyProject/processed/us_states_legality.dta"
100.         drop medical recreational year_legalized_med year_legalized_rec _merge
101.         gen city_state = city + ", " + abbreviation
102.         order state abbreviation city city_state
103.         
.         * Save dataset for year `y'
.         compress
104.         save "$MyProject/processed/intermediate/crime_us_`y'.dta", replace
105. }
(3 observations deleted)
(8 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
violent_crime: all characters numeric; replaced as long
(229 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(214 missing values generated)
robbery: all characters numeric; replaced as int
assault: all characters numeric; replaced as int
(15 missing values generated)
property_crime: all characters numeric; replaced as long
(14 missing values generated)
burglary: all characters numeric; replaced as int
(10 missing values generated)
larceny: all characters numeric; replaced as long
(2 missing values generated)
mv_theft: all characters numeric; replaced as int
(2 missing values generated)
arson: all characters numeric; replaced as int
(548 missing values generated)
(0 real changes made)
(214 real changes made)
(0 real changes made)
(15 real changes made)
(10 real changes made)
(2 real changes made)
(2 real changes made)
(548 real changes made)
(229 real changes made)
(4,060 real changes made)
(8,721 real changes made)
(8,772 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             8,772  (_merge==3)
    -----------------------------------------
  variable state was str394 now str20
  (3,280,728 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2008.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2008.dta saved
(3 observations deleted)
(9 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(2 missing values generated)
violent_crime: all characters numeric; replaced as long
(336 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(315 missing values generated)
robbery: all characters numeric; replaced as int
assault: all characters numeric; replaced as int
(22 missing values generated)
property_crime: all characters numeric; replaced as long
(29 missing values generated)
burglary: all characters numeric; replaced as int
(13 missing values generated)
larceny: all characters numeric; replaced as long
(16 missing values generated)
mv_theft: all characters numeric; replaced as int
(4 missing values generated)
arson: all characters numeric; replaced as int
(322 missing values generated)
(0 real changes made)
(315 real changes made)
(0 real changes made)
(22 real changes made)
(13 real changes made)
(16 real changes made)
(4 real changes made)
(322 real changes made)
(336 real changes made)
(4,105 real changes made)
(9,095 real changes made)
(9,146 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             9,146  (_merge==3)
    -----------------------------------------
  variable state was str395 now str20
  (3,429,750 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2009.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2009.dta saved
(3 observations deleted)
(7 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(4 missing values generated)
violent_crime: all characters numeric; replaced as long
(229 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(205 missing values generated)
robbery: all characters numeric; replaced as int
(2 missing values generated)
assault: all characters numeric; replaced as int
(22 missing values generated)
property_crime: all characters numeric; replaced as long
(30 missing values generated)
burglary: all characters numeric; replaced as int
(16 missing values generated)
larceny: all characters numeric; replaced as long
(14 missing values generated)
mv_theft: all characters numeric; replaced as int
(3 missing values generated)
arson: all characters numeric; replaced as int
(378 missing values generated)
(0 real changes made)
(205 real changes made)
(2 real changes made)
(22 real changes made)
(16 real changes made)
(14 real changes made)
(3 real changes made)
(378 real changes made)
(229 real changes made)
(4,178 real changes made)
(9,259 real changes made)
(9,310 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             9,310  (_merge==3)
    -----------------------------------------
  variable state was str374 now str20
  (3,295,740 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2010.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2010.dta saved
(3 observations deleted)
(7 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(3 missing values generated)
violent_crime: all characters numeric; replaced as long
(209 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(207 missing values generated)
robbery: all characters numeric; replaced as int
assault: all characters numeric; replaced as int
(2 missing values generated)
property_crime: all characters numeric; replaced as long
(5 missing values generated)
burglary: all characters numeric; replaced as int
(1 missing value generated)
larceny: all characters numeric; replaced as long
(5 missing values generated)
mv_theft: all characters numeric; replaced as int
(1 missing value generated)
arson: all characters numeric; replaced as int
(86 missing values generated)
(0 real changes made)
(207 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(5 real changes made)
(1 real change made)
(86 real changes made)
(209 real changes made)
(4,102 real changes made)
(9,264 real changes made)
(9,314 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            45
        from master                        43  (_merge==1)
        from using                          2  (_merge==2)

    Matched                             9,271  (_merge==3)
    -----------------------------------------
  variable state was str374 now str20
  (3,297,864 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2011.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2011.dta saved
(3 observations deleted)
(7 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(1 missing value generated)
violent_crime: all characters numeric; replaced as long
(222 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(211 missing values generated)
robbery: all characters numeric; replaced as int
assault: all characters numeric; replaced as int
(11 missing values generated)
property_crime: all characters numeric; replaced as long
(17 missing values generated)
burglary: all characters numeric; replaced as int
(12 missing values generated)
larceny: all characters numeric; replaced as long
(6 missing values generated)
mv_theft: all characters numeric; replaced as int
arson: all characters numeric; replaced as int
(411 missing values generated)
(0 real changes made)
(211 real changes made)
(0 real changes made)
(11 real changes made)
(12 real changes made)
(6 real changes made)
(0 real changes made)
(411 real changes made)
(222 real changes made)
(3,987 real changes made)
(9,441 real changes made)
(9,491 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             1
        from master                         0  (_merge==1)
        from using                          1  (_merge==2)

    Matched                             9,491  (_merge==3)
    -----------------------------------------
  variable state was str374 now str20
  (3,360,168 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2012.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2012.dta saved
(3 observations deleted)
(10 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(3 missing values generated)
violent_crime: all characters numeric; replaced as long
(4 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(3861 missing values generated)
robbery: all characters numeric; replaced as int
(5433 missing values generated)
assault: all characters numeric; replaced as int
property_crime: all characters numeric; replaced as int
(3 missing values generated)
burglary: all characters numeric; replaced as long
(4 missing values generated)
larceny: all characters numeric; replaced as int
(2 missing values generated)
mv_theft: all characters numeric; replaced as long
(2 missing values generated)
arson: all characters numeric; replaced as int
(0 real changes made)
(3,861 real changes made)
(5,433 real changes made)
(0 real changes made)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(7,862 real changes made)
variable property_crime was int now long
(9,113 real changes made)
(9,242 real changes made)
(9,292 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             1
        from master                         0  (_merge==1)
        from using                          1  (_merge==2)

    Matched                             9,292  (_merge==3)
    -----------------------------------------
  variable violent_crime_2013 was long now int
  variable state was str339 now str20
  (2,983,053 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2013.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2013.dta saved
(3 observations deleted)
(17 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(2 missing values generated)
violent_crime: all characters numeric; replaced as long
(4 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(2207 missing values generated)
robbery: all characters numeric; replaced as int
(7140 missing values generated)
assault: all characters numeric; replaced as int
property_crime: all characters numeric; replaced as int
(4 missing values generated)
burglary: all characters numeric; replaced as long
(19 missing values generated)
larceny: all characters numeric; replaced as int
(4 missing values generated)
mv_theft: all characters numeric; replaced as long
(12 missing values generated)
arson: all characters numeric; replaced as int
(3 missing values generated)
(0 real changes made)
(2,207 real changes made)
(7,140 real changes made)
(0 real changes made)
(19 real changes made)
(4 real changes made)
(12 real changes made)
(3 real changes made)
(7,891 real changes made)
variable property_crime was int now long
(9,137 real changes made)
(9,297 real changes made)
(9,347 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             1
        from master                         0  (_merge==1)
        from using                          1  (_merge==2)

    Matched                             9,347  (_merge==3)
    -----------------------------------------
  variable violent_crime_2014 was long now int
  variable state was str339 now str20
  (3,000,708 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2014.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2014.dta saved
(3 observations deleted)
(10 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
violent_crime: all characters numeric; replaced as long
(2 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(1159 missing values generated)
robbery: all characters numeric; replaced as int
(8236 missing values generated)
assault: all characters numeric; replaced as int
property_crime: all characters numeric; replaced as int
(2 missing values generated)
burglary: all characters numeric; replaced as long
(11 missing values generated)
larceny: all characters numeric; replaced as int
(8 missing values generated)
mv_theft: all characters numeric; replaced as long
(3 missing values generated)
arson: all characters numeric; replaced as int
(1 missing value generated)
(0 real changes made)
(1,159 real changes made)
(8,236 real changes made)
(0 real changes made)
(11 real changes made)
(8 real changes made)
(3 real changes made)
(1 real change made)
(7,928 real changes made)
variable property_crime was int now long
(9,164 real changes made)
(9,344 real changes made)
(9,395 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             9,395  (_merge==3)
    -----------------------------------------
  variable violent_crime_2015 was long now int
  variable state was str341 now str20
  (3,034,585 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2015.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2015.dta saved
(3 observations deleted)
variables created as string: 
state1  state2
(1 observation deleted)
(9 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as int
(2 missing values generated)
violent_crime: all characters numeric; replaced as byte
murder: all characters numeric; replaced as int
(336 missing values generated)
rape: all characters numeric; replaced as int
(2277 missing values generated)
robbery: all characters numeric; replaced as int
assault: all characters numeric; replaced as int
(1 missing value generated)
property_crime: all characters numeric; replaced as long
(14 missing values generated)
burglary: all characters numeric; replaced as int
(10 missing values generated)
larceny: all characters numeric; replaced as int
(3 missing values generated)
mv_theft: all characters numeric; replaced as int
(2 missing values generated)
arson: all characters numeric; replaced as int
(115 missing values generated)
(336 real changes made)
(2,277 real changes made)
(0 real changes made)
(1 real change made)
(10 real changes made)
(3 real changes made)
(2 real changes made)
(115 real changes made)
variable violent_crime was byte now int
(2,432 real changes made)
(1,292 real changes made)
(2,522 real changes made)
(2,612 real changes made)
(0 real changes made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             5
        from master                         0  (_merge==1)
        from using                          5  (_merge==2)

    Matched                             2,612  (_merge==3)
    -----------------------------------------
  variable state was str341 now str20
  (840,057 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2016.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2016.dta saved
(3 observations deleted)
(10 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(2 missing values generated)
violent_crime: all characters numeric; replaced as long
(257 missing values generated)
murder: all characters numeric; replaced as int
rape: all characters numeric; replaced as int
(252 missing values generated)
robbery: all characters numeric; replaced as int
assault: all characters numeric; replaced as int
(5 missing values generated)
property_crime: all characters numeric; replaced as long
(20 missing values generated)
burglary: all characters numeric; replaced as int
(16 missing values generated)
larceny: all characters numeric; replaced as long
(6 missing values generated)
mv_theft: all characters numeric; replaced as int
(1 missing value generated)
arson: all characters numeric; replaced as int
(304 missing values generated)
(0 real changes made)
(252 real changes made)
(0 real changes made)
(5 real changes made)
(16 real changes made)
(6 real changes made)
(1 real change made)
(304 real changes made)
(257 real changes made)
(3,513 real changes made)
(9,528 real changes made)
(9,579 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             9,579  (_merge==3)
    -----------------------------------------
  variable state was str247 now str20
  (2,174,433 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2017.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2017.dta saved
(3 observations deleted)
(10 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(4 missing values generated)
violent_crime: all characters numeric; replaced as long
(190 missing values generated)
murder: all characters numeric; replaced as int
(2 missing values generated)
rape: all characters numeric; replaced as int
(181 missing values generated)
robbery: all characters numeric; replaced as int
(3 missing values generated)
assault: all characters numeric; replaced as int
(7 missing values generated)
property_crime: all characters numeric; replaced as long
(40 missing values generated)
burglary: all characters numeric; replaced as int
(24 missing values generated)
larceny: all characters numeric; replaced as long
(16 missing values generated)
mv_theft: all characters numeric; replaced as int
(4 missing values generated)
arson: all characters numeric; replaced as int
(327 missing values generated)
(2 real changes made)
(181 real changes made)
(3 real changes made)
(7 real changes made)
(24 real changes made)
(16 real changes made)
(4 real changes made)
(327 real changes made)
(190 real changes made)
(3,183 real changes made)
(9,201 real changes made)
(9,252 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             9,252  (_merge==3)
    -----------------------------------------
  variable state was str247 now str20
  (2,100,204 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2018.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2018.dta saved
(3 observations deleted)
(8 observations deleted)
(1 observation deleted)
population: all characters numeric; replaced as long
(2 missing values generated)
violent_crime: all characters numeric; replaced as long
(21 missing values generated)
murder: all characters numeric; replaced as int
(3 missing values generated)
rape: all characters numeric; replaced as int
(15 missing values generated)
robbery: all characters numeric; replaced as int
(1 missing value generated)
assault: all characters numeric; replaced as int
(2 missing values generated)
property_crime: all characters numeric; replaced as long
(23 missing values generated)
burglary: all characters numeric; replaced as int
(13 missing values generated)
larceny: all characters numeric; replaced as long
(7 missing values generated)
mv_theft: all characters numeric; replaced as int
(3 missing values generated)
arson: all characters numeric; replaced as int
(126 missing values generated)
(3 real changes made)
(15 real changes made)
(1 real change made)
(2 real changes made)
(13 real changes made)
(7 real changes made)
(3 real changes made)
(126 real changes made)
(21 real changes made)
(2,981 real changes made)
(8,054 real changes made)
(8,105 real changes made)
(1 real change made)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             8,105  (_merge==3)
    -----------------------------------------
  variable state was str241 now str20
  (1,791,205 bytes saved)
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2019.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2019.dta saved

. 
. * Merge datasets from 2008-2019 into one dataset containing all years
. use "$MyProject/processed/intermediate/crime_us_2008.dta", clear

. forvalues y = 2009/2019 {
  2.         merge 1:1 city_state using "$MyProject/processed/intermediate/crime_us_`y'.dta"
  3.         drop _merge
  4. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,474
        from master                       550  (_merge==1)
        from using                        924  (_merge==2)

    Matched                             8,222  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,612
        from master                       999  (_merge==1)
        from using                        613  (_merge==2)

    Matched                             8,697  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,673
        from master                     1,333  (_merge==1)
        from using                        340  (_merge==2)

    Matched                             8,976  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,665
        from master                     1,411  (_merge==1)
        from using                        254  (_merge==2)

    Matched                             9,238  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,984
        from master                     1,797  (_merge==1)
        from using                        187  (_merge==2)

    Matched                             9,106  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,944
        from master                     1,843  (_merge==1)
        from using                        101  (_merge==2)

    Matched                             9,247  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,160
        from master                     1,978  (_merge==1)
        from using                        182  (_merge==2)

    Matched                             9,213  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                        13,032
        from master                    10,894  (_merge==1)
        from using                      2,138  (_merge==2)

    Matched                               479  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         4,424
        from master                     4,178  (_merge==1)
        from using                        246  (_merge==2)

    Matched                             9,333  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         4,749
        from master                     4,627  (_merge==1)
        from using                        122  (_merge==2)

    Matched                             9,130  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                         5,906
        from master                     5,840  (_merge==1)
        from using                         66  (_merge==2)

    Matched                             8,039  (_merge==3)
    -----------------------------------------

. 
. * Add legalization data
. merge m:1 state using "$MyProject/processed/us_states_legality.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                            43
        from master                        43  (_merge==1)
        from using                          0  (_merge==2)

    Matched                            13,902  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. 
. * Save dataset containing all years
. compress
  (0 bytes saved)

. save "$MyProject/processed/crime_us.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/crime_us.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/crime_us.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2i_clean_zip_codes_data.do"

. ************
. * SCRIPT: 2i_clean_zip_codes_data.do
. * PURPOSE: processes the zip code centroids dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/zip_code_centroids_uncleaned.dta", clear

. 
. * Keep only zip codes in Massachusetts
. keep if usps_zip_pref_state_1221=="MA"
(34,776 observations deleted)

. 
. * Select only desired columns
. keep std_zip5 usps_zip_pref_city_1221 usps_zip_pref_state_1221 latitude longitude

. 
. * Rename columns
. rename std_zip5 zipcode

. rename usps_zip_pref_city_1221 city

. rename usps_zip_pref_state_1221 state

. 
. * Make zipcode type string
. tostring zipcode, replace
zipcode was long now str4

. replace zipcode = "0" + zipcode
variable zipcode was str4 now str5
(576 real changes made)

. 
. * Save dataset
. compress
  variable city was str26 now str18
  (4,608 bytes saved)

. save "$MyProject/processed/zip_code_centroids.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved

. 
. * Get distance to dispensaries
. forvalues i = 1/11 {
  2.         use "$MyProject/processed/dispensaries_boston.dta", clear
  3.         sort id
  4.         local disp_lat = latitude[`i']
  5.         local disp_lon = longitude[`i']
  6.         
.         use "$MyProject/processed/zip_code_centroids.dta", clear
  7.         geodist `disp_lat' `disp_lon' latitude longitude, gen(dist_`i') mile
  8.         save "$MyProject/processed/zip_code_centroids.dta", replace
  9. }
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved

. 
. * Get minimum distance to a dispensary
. forvalues y = 2019/2022 {
  2.         gen min_dist_`y' = .
  3.         if `y' == 2019 {
  4.                 replace min_dist_`y' = dist_8
  5.         }
  6.         else if `y' == 2020 {
  7.                 replace min_dist_`y' = min(dist_8, dist_10, dist_11, dist_7)
  8.         }
  9.         else if `y' == 2021 {
 10.                 replace min_dist_`y' = min(dist_8, dist_10, dist_11, dist_7, dist_4, dist_2, dist_9, dist_5, dist_3, dist_1)
 11.         }
 12.         else if `y' == 2022 {
 13.                 replace min_dist_`y' = min(dist_8, dist_10, dist_11, dist_7, dist_4, dist_2, dist_9, dist_5, dist_3, dist_1, dist_6)
 14.         }
 15. }
(576 missing values generated)
(576 real changes made)
(576 missing values generated)
(576 real changes made)
(576 missing values generated)
(576 real changes made)
(576 missing values generated)
(576 real changes made)

. 
. compress
  (0 bytes saved)

. save "$MyProject/processed/zip_code_centroids.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved

. 
. ** EOF
. 
end of do-file

. 
. do "$MyProject/scripts/3a_regression_dispensaries_on_property_assessments.do"

. ************
. * SCRIPT: 3a_regression_dispensaries_on_property_assessments.do
. * PURPOSE: runs a regression of dispensaries on property assessments
. ************
. 
. * Format property dataset for regression
. use "$MyProject/processed/property_assessments_ma.dta", clear

. 
. sort zipcode

. merge m:1 zipcode using "$MyProject/processed/zip_code_centroids.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           543
        from master                         0  (_merge==1)
        from using                        543  (_merge==2)

    Matched                           562,559  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(543 observations deleted)

. drop _merge

. 
. forvalues j = 0/2 {
  2.         gen treat_`j' = .
  3.         replace treat_`j' = min_dist_2019 if year_assessed - `j' == 2019
  4.         replace treat_`j' = min_dist_2020 if year_assessed - `j' == 2020
  5.         replace treat_`j' = min_dist_2021 if year_assessed - `j' == 2021
  6.         replace treat_`j' = min_dist_2022 if year_assessed - `j' == 2022
  7. }
(562,559 missing values generated)
(62,200 real changes made)
(61,329 real changes made)
(126,258 real changes made)
(0 real changes made)
(562,559 missing values generated)
(61,329 real changes made)
(126,258 real changes made)
(0 real changes made)
(0 real changes made)
(562,559 missing values generated)
(126,258 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. forvalues j = 0/2 {
  2.         forvalues d = 1/3 {
  3.                 gen treat_`j'_`d' = 0
  4.                 replace treat_`j'_`d' = 1 if `d' - 1 < treat_`j' & treat_`j' < `d'
  5.         }
  6. }
(64,332 real changes made)
(75,982 real changes made)
(27,197 real changes made)
(16,122 real changes made)
(64,595 real changes made)
(37,189 real changes made)
(16 real changes made)
(21,848 real changes made)
(25,187 real changes made)

. drop dist_1 dist_2 dist_3 dist_4 dist_5 dist_6 dist_7 dist_8 dist_9 dist_10 dist_11 min_dist_2019 min_dist_2020 min_dist_2021 min_dist_2022 treat_0 treat_1 treat_2

. 
. save "$MyProject/processed/dispensaries_on_property_assessments.dta", replace
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries_on_property_assessments.dta not found)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries_on_property_assessments.dta saved

. 
. * Run regression
. destring zipcode, replace
zipcode: all characters numeric; replaced as int

. format zipcode %05.0f

. 
. local treatment treat_0_1 treat_0_2 treat_0_3 treat_1_1 treat_1_2 treat_1_3 treat_2_1 treat_2_2 treat_2_3

. 
. local heat_type heat_electric heat_forced_hot_air heat_pump heat_space heat_steam

. local covariates living_area num_floors r_bdrms r_full_bth r_half_bth r_kitch yrs_since_built yrs_since_remodel `heat_type'

. 
. reg av_bldg `treatment'

      Source |       SS           df       MS      Number of obs   =   562,559
-------------+----------------------------------   F(9, 562549)    =  10115.56
       Model |  1.8555e+16         9  2.0617e+15   Prob > F        =    0.0000
    Residual |  1.1465e+17   562,549  2.0381e+11   R-squared       =    0.1393
-------------+----------------------------------   Adj R-squared   =    0.1393
       Total |  1.3321e+17   562,558  2.3679e+11   Root MSE        =    4.5e+05

------------------------------------------------------------------------------
     av_bldg | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   treat_0_1 |   452549.7   3560.685   127.10   0.000     445570.9    459528.6
   treat_0_2 |   109728.1   2678.096    40.97   0.000     104479.1      114977
   treat_0_3 |   161922.8   2914.749    55.55   0.000       156210    167635.6
   treat_1_1 |  -349751.3   5029.892   -69.53   0.000    -359609.8   -339892.9
   treat_1_2 |   4962.463    3305.82     1.50   0.133    -1516.839    11441.77
   treat_1_3 |   278336.5   3476.747    80.06   0.000     271522.2    285150.8
   treat_2_1 |     297931   112935.3     2.64   0.008      76581.5    519280.5
   treat_2_2 |  -32862.91   3967.662    -8.28   0.000     -40639.4   -25086.42
   treat_2_3 |   186598.7   3364.083    55.47   0.000     180005.2    193192.2
       _cons |   354176.8    718.275   493.09   0.000       352769    355584.6
------------------------------------------------------------------------------

. estadd local YFE "No"

added macro:
                e(YFE) : "No"

. estadd local ZFE "No"

added macro:
                e(ZFE) : "No"

. estadd local CV "No"

added macro:
                 e(CV) : "No"

. estimates store m1

. 
. reg av_bldg `treatment' i.year_assessed

      Source |       SS           df       MS      Number of obs   =   562,559
-------------+----------------------------------   F(16, 562542)   =   6320.35
       Model |  2.0298e+16        16  1.2686e+15   Prob > F        =    0.0000
    Residual |  1.1291e+17   562,542  2.0072e+11   R-squared       =    0.1524
-------------+----------------------------------   Adj R-squared   =    0.1523
       Total |  1.3321e+17   562,558  2.3679e+11   Root MSE        =    4.5e+05

-------------------------------------------------------------------------------
      av_bldg | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    treat_0_1 |   474395.4   3954.156   119.97   0.000     466645.4    482145.4
    treat_0_2 |   124216.2   3153.141    39.39   0.000     118036.1    130396.2
    treat_0_3 |   161668.2   3267.704    49.47   0.000     155263.6    168072.8
    treat_1_1 |  -352549.1   5461.087   -64.56   0.000    -363252.7   -341845.6
    treat_1_2 |   9409.576   3835.073     2.45   0.014     1892.955     16926.2
    treat_1_3 |   288775.7   3847.851    75.05   0.000     281234.1    296317.4
    treat_2_1 |     290841     112075     2.60   0.009     71177.66    510504.4
    treat_2_2 |  -44969.75   3971.932   -11.32   0.000    -52754.61   -37184.88
    treat_2_3 |     175134   3404.961    51.43   0.000     168460.4    181807.7
              |
year_assessed |
        2015  |   44023.73   2530.364    17.40   0.000     39064.29    48983.16
        2016  |    88883.9   2532.464    35.10   0.000     83920.35    93847.45
        2017  |   136005.3   2533.518    53.68   0.000     131039.7    140970.9
        2018  |   165273.8   2534.728    65.20   0.000     160305.8    170241.8
        2019  |   175867.5    2622.21    67.07   0.000       170728    181006.9
        2020  |   34078.36   3010.035    11.32   0.000     28178.79    39977.94
        2021  |   82517.74   3240.961    25.46   0.000     76165.56    88869.92
              |
        _cons |   259701.2   1790.357   145.06   0.000     256192.2    263210.2
-------------------------------------------------------------------------------

. estadd local YFE "Yes"

added macro:
                e(YFE) : "Yes"

. estadd local ZFE "No"

added macro:
                e(ZFE) : "No"

. estadd local CV "No"

added macro:
                 e(CV) : "No"

. estimates store m2

. 
. reg av_bldg `treatment' i.year_assessed i.zipcode

      Source |       SS           df       MS      Number of obs   =   562,559
-------------+----------------------------------   F(48, 562510)   =   8615.83
       Model |  5.6441e+16        48  1.1759e+15   Prob > F        =    0.0000
    Residual |  7.6769e+16   562,510  1.3648e+11   R-squared       =    0.4237
-------------+----------------------------------   Adj R-squared   =    0.4236
       Total |  1.3321e+17   562,558  2.3679e+11   Root MSE        =    3.7e+05

-------------------------------------------------------------------------------
      av_bldg | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    treat_0_1 |  -93025.44   3879.283   -23.98   0.000    -100628.7   -85422.17
    treat_0_2 |   33888.82   2835.245    11.95   0.000     28331.83    39445.81
    treat_0_3 |   71036.34    2946.55    24.11   0.000     65261.19    76811.48
    treat_1_1 |     239201    4902.48    48.79   0.000     229592.3    248809.7
    treat_1_2 |   104464.8   3313.019    31.53   0.000     97971.37    110958.2
    treat_1_3 |  -4352.526   3500.794    -1.24   0.214    -11213.97    2508.918
    treat_2_1 |  -82433.99   100501.4    -0.82   0.412    -279413.5    114545.6
    treat_2_2 |  -27425.13   4141.237    -6.62   0.000    -35541.82   -19308.44
    treat_2_3 |  -231096.4   3606.855   -64.07   0.000    -238165.8   -224027.1
              |
year_assessed |
        2015  |   44273.91     2086.5    21.22   0.000     40184.44    48363.39
        2016  |   89188.34   2088.233    42.71   0.000     85095.47    93281.21
        2017  |     136426   2089.104    65.30   0.000     132331.5    140520.6
        2018  |   165997.8   2090.105    79.42   0.000     161901.2    170094.3
        2019  |   199538.5   2174.733    91.75   0.000     195276.1    203800.9
        2020  |   195721.6    2602.26    75.21   0.000     190621.3      200822
        2021  |   165781.4   2936.161    56.46   0.000     160026.6    171536.1
              |
      zipcode |
        2108  |    2045826   102701.1    19.92   0.000      1844535     2247116
        2109  |   627511.3   102948.2     6.10   0.000     425736.1    829286.5
        2110  |    1233897   102927.9    11.99   0.000      1032162     1435633
        2111  |     784316   102875.2     7.62   0.000     582683.7    985948.2
        2113  |   279625.6   102797.1     2.72   0.007     78146.55    481104.7
        2114  |   781243.5   102637.5     7.61   0.000     580077.2    982409.7
        2115  |   898645.5   102668.5     8.75   0.000     697418.5     1099872
        2116  |    1595563   102596.2    15.55   0.000      1394477     1796648
        2118  |    1016184   102598.5     9.90   0.000     815093.9     1217274
        2119  |  -26669.26   102519.1    -0.26   0.795    -227603.4    174264.9
        2120  |   351902.4     102598     3.43   0.001     150813.6    552991.1
        2121  |    1268.87   102520.9     0.01   0.990    -199668.9    202206.6
        2122  |    3802.98   102502.7     0.04   0.970      -197099      204705
        2124  |  -22984.95   102489.2    -0.22   0.823    -223860.6    177890.7
        2125  |   32401.83   102500.3     0.32   0.752    -168495.6    233299.2
        2126  |  -73109.11   102503.2    -0.71   0.476    -274012.2    127793.9
        2127  |   255387.6   102499.9     2.49   0.013     54491.12    456284.1
        2128  |    15269.2   102498.6     0.15   0.882    -185624.9    216163.3
        2129  |   310680.9   102522.4     3.03   0.002     109740.3    511621.6
        2130  |   211883.8   102505.6     2.07   0.039      10976.1    412791.5
        2131  |   4937.492   102487.3     0.05   0.962    -195934.4    205809.4
        2132  |   25546.49   102480.1     0.25   0.803    -175311.2    226404.1
        2134  |   187425.8   102543.8     1.83   0.068    -13556.88    388408.5
        2135  |   213438.6     102506     2.08   0.037      12530.1    414347.2
        2136  |  -62921.61   102481.8    -0.61   0.539    -263782.8    137939.5
        2186  |  -120628.5   182336.4    -0.66   0.508      -478002    236745.1
        2199  |    2735037   115292.7    23.72   0.000      2509068     2961007
        2210  |    1455810   103262.7    14.10   0.000      1253418     1658201
        2215  |   466249.6   102830.7     4.53   0.000     264704.7    667794.4
        2445  |   526358.4     116208     4.53   0.000     298594.4    754122.5
        2446  |   243271.7   114701.4     2.12   0.034     18460.56    468082.8
        2467  |   213668.8   102885.8     2.08   0.038      12015.9    415321.6
              |
        _cons |   175954.1     102488     1.72   0.086    -24919.06    376827.3
-------------------------------------------------------------------------------

. estadd local YFE "Yes"

added macro:
                e(YFE) : "Yes"

. estadd local ZFE "Yes"

added macro:
                e(ZFE) : "Yes"

. estadd local CV "No"

added macro:
                 e(CV) : "No"

. estimates store m3

. 
. reg av_bldg `treatment' i.year_assessed i.zipcode `covariates'

      Source |       SS           df       MS      Number of obs   =   562,559
-------------+----------------------------------   F(61, 562497)   =  15517.14
       Model |  8.3556e+16        61  1.3698e+15   Prob > F        =    0.0000
    Residual |  4.9654e+16   562,497  8.8274e+10   R-squared       =    0.6272
-------------+----------------------------------   Adj R-squared   =    0.6272
       Total |  1.3321e+17   562,558  2.3679e+11   Root MSE        =    3.0e+05

-------------------------------------------------------------------------------------
            av_bldg | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          treat_0_1 |   28542.97   3148.946     9.06   0.000     22371.14    34714.81
          treat_0_2 |   50542.13   2282.345    22.14   0.000      46068.8    55015.45
          treat_0_3 |   48311.51   2371.124    20.37   0.000     43664.18    52958.84
          treat_1_1 |   103757.7   3963.213    26.18   0.000      95989.9    111525.4
          treat_1_2 |   83234.15   2667.298    31.21   0.000     78006.33    88461.97
          treat_1_3 |   43420.17   2826.305    15.36   0.000      37880.7    48959.64
          treat_2_1 |  -96389.92   80828.88    -1.19   0.233      -254812    62032.13
          treat_2_2 |   34892.73   3338.464    10.45   0.000     28349.45    41436.01
          treat_2_3 |  -43906.83   2929.023   -14.99   0.000    -49647.62   -38166.04
                    |
      year_assessed |
              2015  |   42672.58   1678.149    25.43   0.000     39383.46     45961.7
              2016  |   86356.03   1679.788    51.41   0.000     83063.69    89648.36
              2017  |   131013.5   1680.988    77.94   0.000     127718.8    134308.2
              2018  |   158445.1   1682.475    94.17   0.000     155147.5    161742.7
              2019  |   190448.5   1751.141   108.76   0.000     187016.4    193880.7
              2020  |   139859.8   2102.763    66.51   0.000     135738.4    143981.1
              2021  |   200630.6   2369.684    84.67   0.000       195986    205275.1
                    |
            zipcode |
              2108  |    1438032   82616.52    17.41   0.000      1276106     1599958
              2109  |   584329.4   82808.83     7.06   0.000     422026.7    746632.1
              2110  |    1066465   82781.88    12.88   0.000     904214.9     1228715
              2111  |   597493.1   82740.02     7.22   0.000     435325.3    759660.9
              2113  |   298471.4   82682.24     3.61   0.000     136416.9      460526
              2114  |   631344.1   82552.43     7.65   0.000     469543.9    793144.2
              2115  |   720890.6   82575.39     8.73   0.000     559045.5    882735.8
              2116  |    1148077   82526.16    13.91   0.000     986328.3     1309826
              2118  |   723207.9    82523.4     8.76   0.000     561464.7    884951.1
              2119  |  -159503.2   82454.35    -1.93   0.053    -321111.1    2104.741
              2120  |   173879.4   82519.27     2.11   0.035     12144.23    335614.5
              2121  |    -255852   82457.74    -3.10   0.002    -417466.5   -94237.42
              2122  |  -73739.38   82440.85    -0.89   0.371    -235320.8    87842.07
              2124  |  -132946.3   82429.47    -1.61   0.107    -294505.4    28612.84
              2125  |  -95669.87   82439.81    -1.16   0.246    -257249.3    65909.54
              2126  |  -110041.2   82439.48    -1.33   0.182    -271619.9    51537.59
              2127  |     225627   82439.38     2.74   0.006     64048.46    387205.6
              2128  |  -4839.646   82439.14    -0.06   0.953    -166417.7    156738.5
              2129  |     213801   82459.66     2.59   0.010      52182.7    375419.3
              2130  |   48388.04   82442.29     0.59   0.557    -113196.2    209972.3
              2131  |   7519.485   82426.18     0.09   0.927    -154033.2    169072.2
              2132  |   16335.73    82419.7     0.20   0.843    -145204.3    177875.7
              2134  |   96639.89   82473.66     1.17   0.241    -65005.87    258285.7
              2135  |   105746.7   82442.18     1.28   0.200    -55837.31    267330.8
              2136  |  -48192.56   82421.55    -0.58   0.559    -209736.2      113351
              2186  |  -548392.6   146659.5    -3.74   0.000    -835840.5   -260944.6
              2199  |    2141557   92734.52    23.09   0.000      1959801     2323314
              2210  |    1204950      83061    14.51   0.000      1042153     1367747
              2215  |     396665   82705.03     4.80   0.000     234565.8    558764.2
              2445  |   -72691.7   93470.57    -0.78   0.437      -255891    110507.7
              2446  |   157209.6   92251.22     1.70   0.088    -23599.84    338019.1
              2467  |   64018.86   82746.51     0.77   0.439    -98161.67    226199.4
                    |
        living_area |   248.3891    .741738   334.87   0.000     246.9353    249.8429
         num_floors |   608.5198   880.0632     0.69   0.489    -1116.376    2333.416
            r_bdrms |  -33478.29   361.1059   -92.71   0.000    -34186.04   -32770.53
         r_full_bth |   113914.8   777.8947   146.44   0.000     112390.2    115439.5
         r_half_bth |   76586.94   820.2806    93.37   0.000     74979.22    78194.66
            r_kitch |  -151716.7   936.4182  -162.02   0.000    -153552.1   -149881.4
    yrs_since_built |  -539.4922    14.0203   -38.48   0.000    -566.9715   -512.0128
  yrs_since_remodel |  -337.0464   9.918633   -33.98   0.000    -356.4867   -317.6062
      heat_electric |  -15288.18   9240.444    -1.65   0.098    -33399.16    2822.796
heat_forced_hot_air |   65747.29   8916.939     7.37   0.000     48270.37    83224.21
          heat_pump |   93210.27   9898.917     9.42   0.000      73808.7    112611.8
         heat_space |   33492.49    9670.93     3.46   0.001     14537.77     52447.2
         heat_steam |   27542.09   8893.667     3.10   0.002     10110.78    44973.39
              _cons |  -143506.7   82915.61    -1.73   0.083    -306018.6    19005.28
-------------------------------------------------------------------------------------

. estadd local YFE "Yes"

added macro:
                e(YFE) : "Yes"

. estadd local ZFE "Yes"

added macro:
                e(ZFE) : "Yes"

. estadd local CV "Yes"

added macro:
                 e(CV) : "Yes"

. estimates store m4

. 
. esttab m1 m2 m3 m4 using "$MyProject/results/tables/reg-property-values.tex", se replace ///
>         keep(`treatment') ///
>         coeflabel(treat_0_1 "0-1 mi." treat_0_2 "1-2 mi." treat_0_3 "0-3 mi." treat_1_1 "0-1 mi., 1 yr. prior" treat_1_2 "1-2 mi., 1 yr. prior" treat_1_3 "0-3 mi., 1 yr. prior" 
> treat_2_1 "0-1 mi., 2 yrs. prior" treat_2_2 "1-2 mi., 2 yrs. prior" treat_2_3 "0-3 mi., 2 yrs. prior") ///
>         scalars("YFE Year FE" "ZFE Zipcode FE" "CV Covariates") ///
>         booktabs
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/results/tables/reg-property-values.tex not found)
(output written to /Users/anniebryan/Documents/College/2021-22/14.33/Project/results/tables/reg-property-values.tex)

. 
. * EOF
. 
end of do-file

. do "$MyProject/scripts/3b_test_demographic_balance_property_assessments.do"

. ************
. * SCRIPT: 3b_test_demographic_balance_property_assessments.do
. * PURPOSE: runs a 2-sample t-test to check that the properties in treatment/control groups are similar
. ************
. 
. use "$MyProject/processed/dispensaries_on_property_assessments.dta", clear

. 
. global controls av_bldg living_area num_floors r_bdrms

. 
. est clear

. estpost ttest $controls , by(treat_0_1)

             |      e(b)   e(count)      e(se)       e(t)    e(df_t)     e(p_l)       e(p)     e(p_u)     e(N_1)    e(mu_1)     e(N_2)    e(mu_2) 
-------------+------------------------------------------------------------------------------------------------------------------------------------
     av_bldg | -390844.1     562559   1970.921  -198.3053     562557          0          0          1     498227   399914.9      64332     790759 
 living_area |  497.0372     562559   4.485835   110.8015     562557          1          0          0     498227   2314.774      64332   1817.736 
  num_floors |  .3418658     562559   .0029136   117.3339     562557          1          0          0     498227   2.118011      64332   1.776146 
     r_bdrms |  1.167509     562559   .0085534   136.4962     562557          1          0          0     498227   4.466536      64332   3.299027 

. esttab using "$MyProject/results/tables/ttest-properties.tex", replace ///
>         cells("mu_1 mu_2  b se count") ///
>         collabels("Treated" "Untreated" "Diff." "S.E." "Obs." ) ///
>         coeflabel(av_bldg "Building value" living_area "Living area" num_floors "Number of floors" r_bdrms "Number of bedrooms") ///
>         label booktabs nonum compress
(file /Users/anniebryan/Documents/College/2021-22/14.33/Project/results/tables/ttest-properties.tex not found)
(output written to /Users/anniebryan/Documents/College/2021-22/14.33/Project/results/tables/ttest-properties.tex)

. 
. * EOF
. 
end of do-file

. 
. * End log
. di "End date and time: $S_DATE $S_TIME"
End date and time:  4 Apr 2022 20:14:49

. log close
      name:  <unnamed>
       log:  /Users/anniebryan/Documents/College/2021-22/14.33/Project/scripts/logs/2022.04.04-20.10.12.log.txt
  log type:  text
 closed on:   4 Apr 2022, 20:14:49
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
