-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/anniebryan/Documents/College/2021-22/14.33/Project/scripts/logs/2022.05.01-22.48.39.log.txt
  log type:  text
 opened on:   1 May 2022, 22:48:39

. 
. ssc install estout, replace
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install geodist
checking geodist consistency and verifying not already installed...
all files already exist and are up to date.

. 
. * Stata version control
. version 17

. 
. * Create directories for output files
. cap mkdir "$MyProject/processed"

. cap mkdir "$MyProject/processed/intermediate"

. cap mkdir "$MyProject/results"

. cap mkdir "$MyProject/results/figures"

. cap mkdir "$MyProject/results/intermediate"

. cap mkdir "$MyProject/results/tables"

. 
. * Run project analysis
. do "$MyProject/scripts/1_process_data.do"

. ************
. * SCRIPT: 1_process_data.do
. * PURPOSE: imports the raw datasets and converts them into a stata-readable format
. ************
. 
. // MA zoning data
. insheet using "$MyProject/data/ma-zoning-laws/ma-zoning-laws.csv", comma clear
(3 vars, 352 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/ma_zoning_laws_uncleaned.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/ma_zoning_laws_uncleaned.dta saved

. 
. // US states legality data
. insheet using "$MyProject/data/us-states-legality.csv", comma clear
(6 vars, 51 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/us_states_legality.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/us_states_legality.dta saved

. 
. // MA dispensaries data
. insheet using "$MyProject/data/dispensaries.csv", comma clear
(66 vars, 887 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/dispensaries_uncleaned.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/dispensaries_uncleaned.dta saved

. 
. // MA property assessments data
. forvalues y = 2014/2021 {
  2.         insheet using "$MyProject/data/property_assessment/property-assessment-fy`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/property_assessments_ma_`y'_uncleaned.dta", replace
  5. }
(56 vars, 164,091 obs)
  variable st_name was str25 now str24
  variable u_heat_typ was str2 now str1
  (328,182 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2014_uncleaned.dta saved
(56 vars, 168,115 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  variable full_address was str55 now str48
  variable u_heat_typ was str2 now str1
  (1,681,150 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2015_uncleaned.dta saved
(77 vars, 169,199 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (338,398 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2016_uncleaned.dta saved
(75 vars, 170,910 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (341,820 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2017_uncleaned.dta saved
(75 vars, 172,841 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2018_uncleaned.dta saved
(75 vars, 174,668 obs)
  variable st_name was str25 now str24
  variable st_name_suf was str4 now str3
  (349,336 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2019_uncleaned.dta saved
(75 vars, 175,052 obs)
  variable st_name_suf was str5 now str4
  (175,052 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2020_uncleaned.dta saved
(63 vars, 177,091 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2021_uncleaned.dta saved

. 
. // Zillow home value data
. insheet using "$MyProject/data/zhvi_sa_35_65.csv", comma clear
(274 vars, 30,468 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/zillow_home_values_uncleaned.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/zillow_home_values_uncleaned.dta saved

. 
. // Boston crash data
. forvalues y = 2008/2021 {
  2.         insheet using "$MyProject/data/boston-crashes/`y'_Crashes.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crashes_boston_`y'_uncleaned.dta", replace
  5. }
(117 vars, 136,384 obs)
  variable rdwy was str105 now str104
  variable non_mtrst_type_cl was str78 now str77
  variable non_mtrst_loc_cl was str150 now str149
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str52 now str51
  (681,920 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2008_uncleaned.dta saved
(115 vars, 117,776 obs)
  variable rdwy was str119 now str118
  variable near_int_rdwy was str50 now str49
  variable exit_rte was str5 now str4
  variable non_mtrst_type_cl was str118 now str117
  variable non_mtrst_actn_cl was str136 now str135
  variable non_mtrst_loc_cl was str146 now str145
  variable rmv_doc_ids was str66 now str65
  variable crash_rpt_ids was str70 now str69
  variable tostreetname was str56 now str55
  (1,059,984 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2009_uncleaned.dta saved
(115 vars, 115,643 obs)
  variable rdwy was str124 now str123
  variable non_mtrst_type_cl was str83 now str82
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str50 now str49
  (693,858 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2010_uncleaned.dta saved
(115 vars, 120,632 obs)
  variable vehc_seq_events_cl was str727 now str726
  variable rdwy was str126 now str125
  variable near_int_rdwy was str50 now str49
  variable mm_rte was str6 now str5
  variable non_mtrst_type_cl was str91 now str90
  variable non_mtrst_actn_cl was str136 now str135
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str63 now str62
  variable tostreetname was str56 now str55
  (1,206,320 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2011_uncleaned.dta saved
(115 vars, 122,646 obs)
  variable rdwy was str125 now str124
  variable near_int_rdwy was str50 now str49
  variable non_mtrst_type_cl was str83 now str82
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str62 now str61
  (735,876 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2012_uncleaned.dta saved
(115 vars, 125,285 obs)
  variable vehc_seq_events_cl was str1128 now str1127
  variable drvr_cntrb_circ_cl was str512 now str511
  variable rdwy was str128 now str127
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str88 now str87
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str100 now str99
  variable crash_rpt_ids was str94 now str93
  variable drvr_distracted_cl was str145 now str144
  variable fromstreetname was str43 now str42
  (1,378,135 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2013_uncleaned.dta saved
(115 vars, 130,233 obs)
  variable rdwy was str143 now str142
  variable non_mtrst_type_cl was str83 now str82
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str63 now str62
  variable drvr_distracted_cl was str182 now str181
  variable tostreetname was str56 now str55
  (1,041,864 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2014_uncleaned.dta saved
(115 vars, 139,050 obs)
  variable rdwy was str143 now str142
  variable near_int_rdwy was str50 now str49
  variable non_mtrst_type_cl was str100 now str99
  variable non_mtrst_loc_cl was str134 now str133
  variable rmv_doc_ids was str66 now str65
  variable crash_rpt_ids was str62 now str61
  (834,300 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2015_uncleaned.dta saved
(115 vars, 143,474 obs)
  variable rdwy was str138 now str137
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str82 now str81
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str151 now str150
  variable crash_rpt_ids was str160 now str159
  variable drvr_distracted_cl was str194 now str193
  (1,147,792 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2016_uncleaned.dta saved
(115 vars, 145,068 obs)
  variable drvr_cntrb_circ_cl was str512 now str511
  variable rdwy was str149 now str148
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str170 now str169
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str210 now str209
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str73 now str72
  variable drvr_distracted_cl was str228 now str227
  (1,305,612 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2017_uncleaned.dta saved
(117 vars, 142,272 obs)
  variable rdwy was str114 now str113
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str83 now str82
  variable non_mtrst_actn_cl was str182 now str181
  variable non_mtrst_loc_cl was str154 now str153
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str73 now str72
  (995,904 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2018_uncleaned.dta saved
(117 vars, 140,939 obs)
  variable rdwy was str129 now str128
  variable near_int_rdwy was str53 now str52
  variable non_mtrst_type_cl was str70 now str69
  variable non_mtrst_actn_cl was str136 now str135
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str63 now str62
  (986,573 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2019_uncleaned.dta saved
(116 vars, 100,724 obs)
  variable vehc_seq_events_cl was str815 now str814
  variable rdwy was str125 now str124
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str66 now str65
  variable non_mtrst_actn_cl was str136 now str135
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str100 now str99
  variable crash_rpt_ids was str88 now str87
  (805,792 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2020_uncleaned.dta saved
(115 vars, 123,064 obs)
  variable rdwy was str118 now str117
  variable near_int_rdwy was str52 now str51
  variable non_mtrst_type_cl was str66 now str65
  variable non_mtrst_loc_cl was str115 now str114
  variable rmv_doc_ids was str83 now str82
  variable crash_rpt_ids was str98 now str97
  variable lclty_name was str15 now str13
  (984,512 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_boston_2021_uncleaned.dta saved

. 
. // US crash data
. insheet using "$MyProject/data/fars_nhtsa_fatality_rates_by_state.csv", comma clear
(56 vars, 53 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/crashes_us_uncleaned.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crashes_us_uncleaned.dta saved

. 
. // Boston crime data
. forvalues y = 2015/2022 {
  2.         insheet using "$MyProject/data/crime-incident-reports/crime-incident-reports-`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crime_boston_`y'_uncleaned.dta", replace
  5. }
(17 vars, 53,597 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2015_uncleaned.dta saved
(17 vars, 99,430 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2016_uncleaned.dta saved
(17 vars, 101,338 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2017_uncleaned.dta saved
(17 vars, 98,888 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2018_uncleaned.dta saved
(17 vars, 87,184 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2019_uncleaned.dta saved
(17 vars, 70,894 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2020_uncleaned.dta saved
(17 vars, 71,721 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2021_uncleaned.dta saved
(17 vars, 14,650 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_boston_2022_uncleaned.dta saved

. 
. // Offense codes for Boston crime data
. import excel "$MyProject/data/rmsoffensecodes.xlsx", clear
(2 vars, 577 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/offense_codes.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/offense_codes.dta saved

. 
. // US crime data
. forvalues y = 2008/2019 {
  2.         import excel "$MyProject/data/fbi_offenses_known_to_law_enforcement/fbi_offenses_known_to_law_enforcement_`y'.xls", clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/crime_us_`y'_uncleaned.dta", replace
  5. }
(17 vars, 8,784 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2008_uncleaned.dta saved
(13 vars, 9,159 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2009_uncleaned.dta saved
(13 vars, 9,321 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2010_uncleaned.dta saved
(18 vars, 9,325 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2011_uncleaned.dta saved
(15 vars, 9,502 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2012_uncleaned.dta saved
(17 vars, 9,306 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2013_uncleaned.dta saved
(14 vars, 9,368 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2014_uncleaned.dta saved
(14 vars, 9,409 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2015_uncleaned.dta saved
(13 vars, 2,626 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2016_uncleaned.dta saved
(19 vars, 9,593 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2017_uncleaned.dta saved
(13 vars, 9,266 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2018_uncleaned.dta saved
(13 vars, 8,117 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/crime_us_2019_uncleaned.dta saved

. 
. // Zip code centroids data
. insheet using "$MyProject/data/ZIP_Code_Population_Weighted_Centroids.csv", comma clear
(10 vars, 35,352 obs)

. compress
  (0 bytes saved)

. save "$MyProject/processed/intermediate/zip_code_centroids_uncleaned.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/zip_code_centroids_uncleaned.dta saved

. 
. // Census income data
. forvalues y = 2011/2020 {
  2.         insheet using "$MyProject/data/census-income/ACSST5Y`y'.csv", comma clear
  3.         compress
  4.         save "$MyProject/processed/intermediate/census_income_`y'_uncleaned.dta", replace
  5. }
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2011_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2012_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2013_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2014_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2015_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2016_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2017_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2018_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2019_uncleaned.dta saved
(130 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2020_uncleaned.dta saved

. 
. // Census age/sex data
. forvalues y = 2011/2020 {
  2.         foreach race in "white" "black" "asian" "amind" "pacif" {
  3.                 insheet using "$MyProject/data/census-age-by-sex/ACSDT5Y`y'-`race'.csv", comma clear
  4.                 compress
  5.                 save "$MyProject/processed/intermediate/census_age_sex_`race'_`y'_uncleaned.dta", replace
  6.         }
  7. }
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2011_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2011_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2011_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2011_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2011_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2012_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2012_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2012_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2012_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2012_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2013_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2013_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2013_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2013_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2013_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2014_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2014_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2014_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2014_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2014_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2015_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2015_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2015_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2015_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2015_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2016_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2016_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2016_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2016_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2016_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2017_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2017_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2017_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2017_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2017_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2018_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2018_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2018_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2018_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2018_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2019_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2019_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2019_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2019_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2019_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2020_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2020_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2020_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2020_uncleaned.dta saved
(64 vars, 540 obs)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2020_uncleaned.dta saved

. 
. ** EOF
. 
end of do-file

. 
. do "$MyProject/scripts/2a_clean_zip_codes_data.do"

. ************
. * SCRIPT: 2a_clean_zip_codes_data.do
. * PURPOSE: processes the zip code centroids dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/zip_code_centroids_uncleaned.dta", clear

. 
. * Keep only zip codes in Massachusetts
. keep if usps_zip_pref_state_1221=="MA"
(34,776 observations deleted)

. 
. * Select only desired columns
. keep std_zip5 usps_zip_pref_city_1221 usps_zip_pref_state_1221 latitude longitude

. 
. * Rename columns
. rename std_zip5 zipcode

. rename usps_zip_pref_city_1221 city

. rename usps_zip_pref_state_1221 state

. 
. * Make city name proper
. replace city = proper(city)
(576 real changes made)

. 
. * Make zipcode type string
. tostring zipcode, replace
zipcode was long now str4

. replace zipcode = "0" + zipcode
variable zipcode was str4 now str5
(576 real changes made)

. 
. * Save dataset
. compress
  variable city was str26 now str18
  (4,608 bytes saved)

. save "$MyProject/processed/zip_code_centroids.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved

. 
. * Get distance to dispensaries
. forvalues i = 1/11 {
  2.         use "$MyProject/processed/dispensaries_boston.dta", clear
  3.         sort id
  4.         local disp_lat = latitude[`i']
  5.         local disp_lon = longitude[`i']
  6.         
.         use "$MyProject/processed/zip_code_centroids.dta", clear
  7.         geodist `disp_lat' `disp_lon' latitude longitude, gen(dist_`i') mile
  8.         save "$MyProject/processed/zip_code_centroids.dta", replace
  9. }
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved

. 
. * Get minimum distance to a dispensary
. egen min_dist_disp = rowmin(dist_1 dist_2 dist_3 dist_4 dist_5 dist_6 dist_7 dist_8 dist_9 dist_10 dist_11)

. 
. * Get minimum distance to a dispensary
. gen min_dist_2019 = dist_8

. gen min_dist_2020 = min(dist_7, dist_8, dist_10, dist_11)

. gen min_dist_2021 = min(dist_1, dist_2, dist_3, dist_4, dist_5, dist_7, dist_8, dist_9, dist_10, dist_11)

. gen min_dist_2022 = min(dist_1, dist_2, dist_3, dist_4, dist_5, dist_6, dist_7, dist_8, dist_9, dist_10, dist_11)

. 
. drop dist_1 dist_2 dist_3 dist_4 dist_5 dist_6 dist_7 dist_8 dist_9 dist_10 dist_11

. 
. compress
  (0 bytes saved)

. save "$MyProject/processed/zip_code_centroids.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zip_code_centroids.dta saved

. 
. * Create file containing only Boston zipcodes
. destring zipcode, replace
zipcode: all characters numeric; replaced as int

. format zipcode %05.0f

. 
. local boston_zipcodes 02108 02109 02110 02111 02113 02114 02115 02116 02118 02119 02120 02121 02122 02124 02125 02126 02127 02128 02129 02130 02131 02132 02133 02134 02135 02136
>  02163 02199 02203 02210 02215 02222

. gen boston = 0

. foreach z in `boston_zipcodes' {
  2.         replace boston = 1 if zipcode==`z'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)

. drop if boston == 0
(546 observations deleted)

. drop boston

. 
. save "$MyProject/processed/boston_zip_code_centroids.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/boston_zip_code_centroids.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2b_clean_census_income_data.do"

. ************
. * SCRIPT: 2b_clean_census_income_data.do
. * PURPOSE: processes the census income datasets in preparation for analysis
. ************
. 
. * Clean dataset for each year, one at a time
. forvalues y = 2011/2020 {
  2.         use "$MyProject/processed/intermediate/census_income_`y'_uncleaned.dta", clear
  3.         
.         * Keep only desired columns
.         keep v2 v3 v25 v27
  4.         
.         * Rename variable names
.         rename v2 zipcode
  5.         rename v3 num_hh_`y'
  6.         rename v25 est_hh_med_inc_`y'
  7.         rename v27 est_hh_mean_inc_`y'
  8.         
.         * Keep only desired rows
.         drop if _n<=2
  9.         drop if missing(est_hh_med_inc_`y') | real(est_hh_med_inc_`y')==.
 10.         drop if missing(est_hh_mean_inc_`y') | real(est_hh_mean_inc_`y')==.
 11.         
.         * Split zip code column
.         split zipcode, parse(" ")
 12.         drop zipcode zipcode1
 13.         rename zipcode2 zipcode
 14.         order zipcode
 15.         
.         * Turn numeric values to ints
.         destring num_hh_`y', replace
 16.         destring est_hh_med_inc_`y', replace
 17.         destring est_hh_mean_inc_`y', replace
 18.         
.         * Create variable for total income (mean income per household * # households)
.         gen total_inc_`y' = num_hh_`y' * est_hh_mean_inc_`y'
 19.         
.         * Save dataset for year y
.         compress
 20.         save "$MyProject/processed/intermediate/census_income_`y'.dta", replace
 21. }
(2 observations deleted)
(15 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2011: all characters numeric; replaced as int
est_hh_med_inc_2011: all characters numeric; replaced as long
est_hh_mean_inc_2011: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2011.dta saved
(2 observations deleted)
(11 observations deleted)
(3 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2012: all characters numeric; replaced as int
est_hh_med_inc_2012: all characters numeric; replaced as long
est_hh_mean_inc_2012: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2012.dta saved
(2 observations deleted)
(16 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2013: all characters numeric; replaced as int
est_hh_med_inc_2013: all characters numeric; replaced as long
est_hh_mean_inc_2013: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2013.dta saved
(2 observations deleted)
(16 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2014: all characters numeric; replaced as int
est_hh_med_inc_2014: all characters numeric; replaced as long
est_hh_mean_inc_2014: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2014.dta saved
(2 observations deleted)
(21 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2015: all characters numeric; replaced as int
est_hh_med_inc_2015: all characters numeric; replaced as long
est_hh_mean_inc_2015: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2015.dta saved
(2 observations deleted)
(20 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2016: all characters numeric; replaced as int
est_hh_med_inc_2016: all characters numeric; replaced as long
est_hh_mean_inc_2016: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2016.dta saved
(2 observations deleted)
(23 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2017: all characters numeric; replaced as int
est_hh_med_inc_2017: all characters numeric; replaced as long
est_hh_mean_inc_2017: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2017.dta saved
(2 observations deleted)
(19 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2018: all characters numeric; replaced as int
est_hh_med_inc_2018: all characters numeric; replaced as long
est_hh_mean_inc_2018: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2018.dta saved
(2 observations deleted)
(23 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2019: all characters numeric; replaced as int
est_hh_med_inc_2019: all characters numeric; replaced as long
est_hh_mean_inc_2019: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2019.dta saved
(2 observations deleted)
(28 observations deleted)
(0 observations deleted)
variables created as string: 
zipcode1  zipcode2
num_hh_2020: all characters numeric; replaced as int
est_hh_med_inc_2020: all characters numeric; replaced as long
est_hh_mean_inc_2020: all characters numeric; replaced as long
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_income_2020.dta saved

. 
. * Merge datasets from 2011-2020 into one dataset containing all years
. use "$MyProject/processed/intermediate/census_income_2011.dta", clear

. forvalues y = 2012/2020 {
  2.         merge 1:1 zipcode using "$MyProject/processed/intermediate/census_income_`y'.dta"
  3.         drop _merge
  4. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                             1
        from master                         0  (_merge==1)
        from using                          1  (_merge==2)

    Matched                               523  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             4
        from master                         3  (_merge==1)
        from using                          1  (_merge==2)

    Matched                               521  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             3
        from master                         3  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               522  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             8
        from master                         8  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               517  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             7
        from master                         7  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               518  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                            10
        from master                        10  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               515  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             6
        from master                         6  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               519  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                            10
        from master                        10  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               515  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                            15
        from master                        15  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               510  (_merge==3)
    -----------------------------------------

. 
. * Add city name
. merge 1:1 zipcode using "$MyProject/processed/zip_code_centroids.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           103
        from master                        26  (_merge==1)
        from using                         77  (_merge==2)

    Matched                               499  (_merge==3)
    -----------------------------------------

. drop if _merge!=3
(103 observations deleted)

. drop _merge latitude longitude min_dist_* state

. 
. * Add MA zoning laws
. merge m:1 city using "$MyProject/processed/ma_zoning_laws.dta"
(variable city was str18, now str21 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           171
        from master                       139  (_merge==1)
        from using                         32  (_merge==2)

    Matched                               360  (_merge==3)
    -----------------------------------------

. drop if _merge!=3
(171 observations deleted)

. drop _merge

. order zipcode city retail_legal adult_use_legal delivery_legal

. 
. * Save dataset containing all years
. compress
  variable city was str21 now str16
  (1,800 bytes saved)

. save "$MyProject/processed/census_income.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/census_income.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2c_clean_census_race_sex_data.do"

. ************
. * SCRIPT: 2c_clean_census_race_sex_data.do
. * PURPOSE: processes the census race by sex datasets in preparation for analysis
. ************
. 
. * Clean dataset for each year and each race, one at a time
. forvalues y = 2011/2020 {
  2.         foreach race in "white" "black" "asian" "amind" "pacif" {
  3.                 use "$MyProject/processed/intermediate/census_age_sex_`race'_`y'_uncleaned.dta", clear
  4.                 
.                 * Keep only desired columns
.                 keep v3 v5 v7 v9 v11 v13 v15 v17 v19 v21 v23 v25 v27 v29 v31 v33 v35 v37 v39 v41 v43 v45 v47 v49 v51 v53 v55 v57 v59 v61 v64
  5.                 order v64
  6.                 
.                 * Rename variable names
.                 rename v64 zipcode
  7.                 
.                 rename v3 tot_`race'_male_`y'
  8.                 rename v5 num_under_5_`race'_male_`y'
  9.                 rename v7 num_5_to_9_`race'_male_`y'
 10.                 rename v9 num_10_to_14_`race'_male_`y'
 11.                 rename v11 num_15_to_17_`race'_male_`y'
 12.                 rename v13 num_18_to_19_`race'_male_`y'
 13.                 rename v15 num_20_to_24_`race'_male_`y'
 14.                 rename v17 num_25_to_29_`race'_male_`y'
 15.                 rename v19 num_30_to_34_`race'_male_`y'
 16.                 rename v21 num_35_to_44_`race'_male_`y'
 17.                 rename v23 num_45_to_54_`race'_male_`y'
 18.                 rename v25 num_55_to_64_`race'_male_`y'
 19.                 rename v27 num_65_to_74_`race'_male_`y'
 20.                 rename v29 num_75_to_84_`race'_male_`y'
 21.                 rename v31 num_over_85_`race'_male_`y'
 22.                 
.                 rename v33 tot_`race'_female_`y'
 23.                 rename v35 num_under_5_`race'_female_`y'
 24.                 rename v37 num_5_to_9_`race'_female_`y'
 25.                 rename v39 num_10_to_14_`race'_female_`y'
 26.                 rename v41 num_15_to_17_`race'_female_`y'
 27.                 rename v43 num_18_to_19_`race'_female_`y'
 28.                 rename v45 num_20_to_24_`race'_female_`y'
 29.                 rename v47 num_25_to_29_`race'_female_`y'
 30.                 rename v49 num_30_to_34_`race'_female_`y'
 31.                 rename v51 num_35_to_44_`race'_female_`y'
 32.                 rename v53 num_45_to_54_`race'_female_`y'
 33.                 rename v55 num_55_to_64_`race'_female_`y'
 34.                 rename v57 num_65_to_74_`race'_female_`y'
 35.                 rename v59 num_75_to_84_`race'_female_`y'
 36.                 rename v61 num_over_85_`race'_female_`y'
 37.                 
.                 * Keep only desired rows
.                 keep if _n>2
 38.                 
.                 * Split zip code column
.                 split zipcode, parse(" ")
 39.                 drop zipcode zipcode1
 40.                 rename zipcode2 zipcode
 41.                 order zipcode
 42.                 
.                 * Turn numeric values to ints
.                 foreach sex in "male" "female" {
 43.                         destring tot_`race'_`sex'_`y', replace
 44.                         foreach age in "under_5" "5_to_9" "10_to_14" "15_to_17" "18_to_19" "20_to_24" "25_to_29" "30_to_34" "35_to_44" "45_to_54" "55_to_64" "65_to_74" "75_to
> _84" "over_85" {
 45.                                 destring num_`age'_`race'_`sex'_`y', replace
 46.                         }
 47.                 }
 48. 
.                 compress
 49.                 save "$MyProject/processed/intermediate/census_age_sex_`race'_`y'.dta", replace
 50.         }
 51.         
.         * Merge datasets from each race into one dataset containing all races
.         use "$MyProject/processed/intermediate/census_age_sex_white_`y'.dta", clear
 52.         foreach race in "black" "asian" "amind" "pacif" {
 53.                 merge 1:1 zipcode using "$MyProject/processed/intermediate/census_age_sex_`race'_`y'.dta"
 54.                 drop _merge
 55.         }
 56.         
.         * Add columns for aggregate values across races
.         foreach sex in "male" "female" {
 57.                 gen total_`sex'_`y' = 0
 58.         }
 59.         
.         foreach age in "under_5" "5_to_9" "10_to_14" "15_to_17" "18_to_19" "20_to_24" "25_to_29" "30_to_34" "35_to_44" "45_to_54" "55_to_64" "65_to_74" "75_to_84" "over_85" {
 60.                 gen total_`age'_`y' = 0
 61.         }
 62.         
.         foreach race in "white" "black" "asian" "amind" "pacif" {
 63.                 gen total_`race'_`y' = 0
 64.                 foreach sex in "male" "female" {
 65.                         replace total_`sex'_`y' = total_`sex'_`y' + tot_`race'_`sex'_`y'
 66.                         replace total_`race'_`y' = total_`race'_`y' + tot_`race'_`sex'_`y'
 67.                         foreach age in "under_5" "5_to_9" "10_to_14" "15_to_17" "18_to_19" "20_to_24" "25_to_29" "30_to_34" "35_to_44" "45_to_54" "55_to_64" "65_to_74" "75_to
> _84" "over_85" {
 68.                                 replace total_`age'_`y' = total_`age'_`y' + num_`age'_`race'_`sex'_`y'
 69.                         }
 70.                 }
 71.         }
 72.         
.         gen total_`y' = total_male_`y' + total_female_`y'
 73.         
.         foreach sex in "male" "female" {
 74.                 gen prop_`sex'_`y' = total_`sex'_`y' / total_`y'
 75.         }
 76.         
.         foreach race in "white" "black" "asian" "amind" "pacif" {
 77.                 gen prop_`race'_`y' = total_`race'_`y' / total_`y'
 78.         }
 79.         
.         gen total_under_9_`y' = total_under_5_`y' + total_5_to_9_`y'
 80.         gen total_under_14_`y' = total_under_9_`y' + total_10_to_14_`y'
 81.         gen total_under_18_`y' = total_under_14_`y' + total_15_to_17_`y'
 82.         gen total_under_20_`y' = total_under_18_`y' + total_18_to_19_`y'
 83.         gen total_under_25_`y' = total_under_20_`y' + total_20_to_24_`y'
 84.         gen total_under_30_`y' = total_under_25_`y' + total_25_to_29_`y'
 85.         gen total_under_35_`y' = total_under_30_`y' + total_30_to_34_`y'
 86.         gen total_under_45_`y' = total_under_35_`y' + total_35_to_44_`y'
 87.         gen total_under_55_`y' = total_under_45_`y' + total_45_to_54_`y'
 88.         gen total_under_65_`y' = total_under_55_`y' + total_55_to_64_`y'
 89.         gen total_under_75_`y' = total_under_65_`y' + total_65_to_74_`y'
 90.         gen total_under_85_`y' = total_under_75_`y' + total_75_to_84_`y'
 91.         
.         gen half_total = total_`y'/2
 92.         gen median_age_`y' = cond(half_total < total_under_9_`y', 5+(9-5)*(half_total-total_under_5_`y')/(total_under_9_`y'-total_under_5_`y'), ///
>                 cond(half_total < total_under_14_`y', 9+(14-9)*(half_total-total_under_9_`y')/(total_under_14_`y'-total_under_9_`y'), ///
>                 cond(half_total < total_under_18_`y', 14+(18-14)*(half_total-total_under_14_`y')/(total_under_18_`y'-total_under_14_`y'), ///
>                 cond(half_total < total_under_20_`y', 18+(20-18)*(half_total-total_under_18_`y')/(total_under_20_`y'-total_under_18_`y'), ///
>                 cond(half_total < total_under_25_`y', 20+(25-20)*(half_total-total_under_20_`y')/(total_under_25_`y'-total_under_20_`y'), ///
>                 cond(half_total < total_under_30_`y', 25+(30-25)*(half_total-total_under_25_`y')/(total_under_30_`y'-total_under_25_`y'), ///
>                 cond(half_total < total_under_35_`y', 30+(35-30)*(half_total-total_under_30_`y')/(total_under_35_`y'-total_under_30_`y'), ///
>                 cond(half_total < total_under_45_`y', 35+(45-35)*(half_total-total_under_35_`y')/(total_under_45_`y'-total_under_35_`y'), ///
>                 cond(half_total < total_under_55_`y', 45+(55-45)*(half_total-total_under_45_`y')/(total_under_55_`y'-total_under_45_`y'), ///
>                 cond(half_total < total_under_65_`y', 55+(65-55)*(half_total-total_under_55_`y')/(total_under_65_`y'-total_under_55_`y'), ///
>                 cond(half_total < total_under_75_`y', 65+(75-65)*(half_total-total_under_65_`y')/(total_under_75_`y'-total_under_65_`y'), ///
>                 cond(half_total < total_under_85_`y', 75+(85-75)*(half_total-total_under_75_`y')/(total_under_85_`y'-total_under_75_`y'), 85))))))))))))
 93.                 
.         gen prop_under_18_`y' = total_under_18_`y' / total_`y'
 94.         gen prop_under_35_`y' = total_under_35_`y' / total_`y'
 95.         gen prop_under_65_`y' = total_under_65_`y' / total_`y'
 96.         
.         keep zipcode total_`y' prop_male_`y' prop_white_`y' prop_black_`y' prop_asian_`y' prop_amind_`y' prop_under_18_`y' prop_under_35_`y' prop_under_65_`y' median_age
 97.         order zipcode total_`y'
 98.         
.         * Save dataset containing all races
.         compress
 99.         save "$MyProject/processed/intermediate/census_age_sex_`y'.dta", replace
100. }
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2011: all characters numeric; replaced as int
num_under_5_white_male_2011: all characters numeric; replaced as int
num_5_to_9_white_male_2011: all characters numeric; replaced as int
num_10_to_14_white_male_2011: all characters numeric; replaced as int
num_15_to_17_white_male_2011: all characters numeric; replaced as int
num_18_to_19_white_male_2011: all characters numeric; replaced as int
num_20_to_24_white_male_2011: all characters numeric; replaced as int
num_25_to_29_white_male_2011: all characters numeric; replaced as int
num_30_to_34_white_male_2011: all characters numeric; replaced as int
num_35_to_44_white_male_2011: all characters numeric; replaced as int
num_45_to_54_white_male_2011: all characters numeric; replaced as int
num_55_to_64_white_male_2011: all characters numeric; replaced as int
num_65_to_74_white_male_2011: all characters numeric; replaced as int
num_75_to_84_white_male_2011: all characters numeric; replaced as int
num_over_85_white_male_2011: all characters numeric; replaced as int
tot_white_female_2011: all characters numeric; replaced as int
num_under_5_white_female_2011: all characters numeric; replaced as int
num_5_to_9_white_female_2011: all characters numeric; replaced as int
num_10_to_14_white_female_2011: all characters numeric; replaced as int
num_15_to_17_white_female_2011: all characters numeric; replaced as int
num_18_to_19_white_female_2011: all characters numeric; replaced as int
num_20_to_24_white_female_2011: all characters numeric; replaced as int
num_25_to_29_white_female_2011: all characters numeric; replaced as int
num_30_to_34_white_female_2011: all characters numeric; replaced as int
num_35_to_44_white_female_2011: all characters numeric; replaced as int
num_45_to_54_white_female_2011: all characters numeric; replaced as int
num_55_to_64_white_female_2011: all characters numeric; replaced as int
num_65_to_74_white_female_2011: all characters numeric; replaced as int
num_75_to_84_white_female_2011: all characters numeric; replaced as int
num_over_85_white_female_2011: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2011.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2011: all characters numeric; replaced as int
num_under_5_black_male_2011: all characters numeric; replaced as int
num_5_to_9_black_male_2011: all characters numeric; replaced as int
num_10_to_14_black_male_2011: all characters numeric; replaced as int
num_15_to_17_black_male_2011: all characters numeric; replaced as int
num_18_to_19_black_male_2011: all characters numeric; replaced as int
num_20_to_24_black_male_2011: all characters numeric; replaced as int
num_25_to_29_black_male_2011: all characters numeric; replaced as int
num_30_to_34_black_male_2011: all characters numeric; replaced as int
num_35_to_44_black_male_2011: all characters numeric; replaced as int
num_45_to_54_black_male_2011: all characters numeric; replaced as int
num_55_to_64_black_male_2011: all characters numeric; replaced as int
num_65_to_74_black_male_2011: all characters numeric; replaced as int
num_75_to_84_black_male_2011: all characters numeric; replaced as int
num_over_85_black_male_2011: all characters numeric; replaced as int
tot_black_female_2011: all characters numeric; replaced as int
num_under_5_black_female_2011: all characters numeric; replaced as int
num_5_to_9_black_female_2011: all characters numeric; replaced as int
num_10_to_14_black_female_2011: all characters numeric; replaced as int
num_15_to_17_black_female_2011: all characters numeric; replaced as int
num_18_to_19_black_female_2011: all characters numeric; replaced as int
num_20_to_24_black_female_2011: all characters numeric; replaced as int
num_25_to_29_black_female_2011: all characters numeric; replaced as int
num_30_to_34_black_female_2011: all characters numeric; replaced as int
num_35_to_44_black_female_2011: all characters numeric; replaced as int
num_45_to_54_black_female_2011: all characters numeric; replaced as int
num_55_to_64_black_female_2011: all characters numeric; replaced as int
num_65_to_74_black_female_2011: all characters numeric; replaced as int
num_75_to_84_black_female_2011: all characters numeric; replaced as int
num_over_85_black_female_2011: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2011.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2011: all characters numeric; replaced as int
num_under_5_asian_male_2011: all characters numeric; replaced as int
num_5_to_9_asian_male_2011: all characters numeric; replaced as int
num_10_to_14_asian_male_2011: all characters numeric; replaced as int
num_15_to_17_asian_male_2011: all characters numeric; replaced as int
num_18_to_19_asian_male_2011: all characters numeric; replaced as int
num_20_to_24_asian_male_2011: all characters numeric; replaced as int
num_25_to_29_asian_male_2011: all characters numeric; replaced as int
num_30_to_34_asian_male_2011: all characters numeric; replaced as int
num_35_to_44_asian_male_2011: all characters numeric; replaced as int
num_45_to_54_asian_male_2011: all characters numeric; replaced as int
num_55_to_64_asian_male_2011: all characters numeric; replaced as int
num_65_to_74_asian_male_2011: all characters numeric; replaced as int
num_75_to_84_asian_male_2011: all characters numeric; replaced as int
num_over_85_asian_male_2011: all characters numeric; replaced as int
tot_asian_female_2011: all characters numeric; replaced as int
num_under_5_asian_female_2011: all characters numeric; replaced as int
num_5_to_9_asian_female_2011: all characters numeric; replaced as int
num_10_to_14_asian_female_2011: all characters numeric; replaced as int
num_15_to_17_asian_female_2011: all characters numeric; replaced as int
num_18_to_19_asian_female_2011: all characters numeric; replaced as int
num_20_to_24_asian_female_2011: all characters numeric; replaced as int
num_25_to_29_asian_female_2011: all characters numeric; replaced as int
num_30_to_34_asian_female_2011: all characters numeric; replaced as int
num_35_to_44_asian_female_2011: all characters numeric; replaced as int
num_45_to_54_asian_female_2011: all characters numeric; replaced as int
num_55_to_64_asian_female_2011: all characters numeric; replaced as int
num_65_to_74_asian_female_2011: all characters numeric; replaced as int
num_75_to_84_asian_female_2011: all characters numeric; replaced as int
num_over_85_asian_female_2011: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2011.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2011: all characters numeric; replaced as int
num_under_5_amind_male_2011: all characters numeric; replaced as byte
num_5_to_9_amind_male_2011: all characters numeric; replaced as byte
num_10_to_14_amind_male_2011: all characters numeric; replaced as byte
num_15_to_17_amind_male_2011: all characters numeric; replaced as byte
num_18_to_19_amind_male_2011: all characters numeric; replaced as byte
num_20_to_24_amind_male_2011: all characters numeric; replaced as byte
num_25_to_29_amind_male_2011: all characters numeric; replaced as byte
num_30_to_34_amind_male_2011: all characters numeric; replaced as byte
num_35_to_44_amind_male_2011: all characters numeric; replaced as byte
num_45_to_54_amind_male_2011: all characters numeric; replaced as byte
num_55_to_64_amind_male_2011: all characters numeric; replaced as byte
num_65_to_74_amind_male_2011: all characters numeric; replaced as byte
num_75_to_84_amind_male_2011: all characters numeric; replaced as byte
num_over_85_amind_male_2011: all characters numeric; replaced as byte
tot_amind_female_2011: all characters numeric; replaced as int
num_under_5_amind_female_2011: all characters numeric; replaced as byte
num_5_to_9_amind_female_2011: all characters numeric; replaced as byte
num_10_to_14_amind_female_2011: all characters numeric; replaced as byte
num_15_to_17_amind_female_2011: all characters numeric; replaced as byte
num_18_to_19_amind_female_2011: all characters numeric; replaced as byte
num_20_to_24_amind_female_2011: all characters numeric; replaced as byte
num_25_to_29_amind_female_2011: all characters numeric; replaced as byte
num_30_to_34_amind_female_2011: all characters numeric; replaced as byte
num_35_to_44_amind_female_2011: all characters numeric; replaced as byte
num_45_to_54_amind_female_2011: all characters numeric; replaced as byte
num_55_to_64_amind_female_2011: all characters numeric; replaced as byte
num_65_to_74_amind_female_2011: all characters numeric; replaced as byte
num_75_to_84_amind_female_2011: all characters numeric; replaced as byte
num_over_85_amind_female_2011: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2011.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2011: all characters numeric; replaced as byte
num_under_5_pacif_male_2011: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2011: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2011: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2011: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2011: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2011: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2011: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2011: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2011: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2011: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2011: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2011: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2011: all characters numeric; replaced as byte
num_over_85_pacif_male_2011: all characters numeric; replaced as byte
tot_pacif_female_2011: all characters numeric; replaced as int
num_under_5_pacif_female_2011: all characters numeric; replaced as int
num_5_to_9_pacif_female_2011: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2011: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2011: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2011: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2011: all characters numeric; replaced as byte
num_25_to_29_pacif_female_2011: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2011: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2011: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2011: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2011: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2011: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2011: all characters numeric; replaced as byte
num_over_85_pacif_female_2011: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2011.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(532 real changes made)
(532 real changes made)
(488 real changes made)
(485 real changes made)
(491 real changes made)
(485 real changes made)
(474 real changes made)
(502 real changes made)
(493 real changes made)
(490 real changes made)
(511 real changes made)
(514 real changes made)
(518 real changes made)
(504 real changes made)
(503 real changes made)
(457 real changes made)
(531 real changes made)
(531 real changes made)
(482 real changes made)
(479 real changes made)
(488 real changes made)
(488 real changes made)
(466 real changes made)
(491 real changes made)
(490 real changes made)
(493 real changes made)
(511 real changes made)
(518 real changes made)
(516 real changes made)
(507 real changes made)
(505 real changes made)
(480 real changes made)
(414 real changes made)
(414 real changes made)
(166 real changes made)
(169 real changes made)
(174 real changes made)
(178 real changes made)
(178 real changes made)
(207 real changes made)
(184 real changes made)
(189 real changes made)
(268 real changes made)
(261 real changes made)
(234 real changes made)
(162 real changes made)
(110 real changes made)
(48 real changes made)
(395 real changes made)
(395 real changes made)
(170 real changes made)
(172 real changes made)
(185 real changes made)
(160 real changes made)
(171 real changes made)
(201 real changes made)
(167 real changes made)
(164 real changes made)
(237 real changes made)
(233 real changes made)
(206 real changes made)
(160 real changes made)
(128 real changes made)
(96 real changes made)
(395 real changes made)
(395 real changes made)
(211 real changes made)
(204 real changes made)
(202 real changes made)
(167 real changes made)
(140 real changes made)
(180 real changes made)
(180 real changes made)
(197 real changes made)
(288 real changes made)
(266 real changes made)
(220 real changes made)
(182 real changes made)
(100 real changes made)
(37 real changes made)
(427 real changes made)
(427 real changes made)
(209 real changes made)
(225 real changes made)
(220 real changes made)
(169 real changes made)
(129 real changes made)
(194 real changes made)
(201 real changes made)
(231 real changes made)
(305 real changes made)
(286 real changes made)
(238 real changes made)
(170 real changes made)
(123 real changes made)
(55 real changes made)
(203 real changes made)
(203 real changes made)
(18 real changes made)
(19 real changes made)
(25 real changes made)
(14 real changes made)
(22 real changes made)
(37 real changes made)
(23 real changes made)
(27 real changes made)
(57 real changes made)
(75 real changes made)
(48 real changes made)
(26 real changes made)
(16 real changes made)
(4 real changes made)
(189 real changes made)
(189 real changes made)
(19 real changes made)
(22 real changes made)
(29 real changes made)
(25 real changes made)
(16 real changes made)
(33 real changes made)
(18 real changes made)
(32 real changes made)
(51 real changes made)
(61 real changes made)
(43 real changes made)
(27 real changes made)
(22 real changes made)
(13 real changes made)
(31 real changes made)
(31 real changes made)
(2 real changes made)
(4 real changes made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(4 real changes made)
(1 real change made)
(4 real changes made)
(8 real changes made)
(4 real changes made)
(2 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(47 real changes made)
(47 real changes made)
(1 real change made)
(3 real changes made)
(4 real changes made)
(4 real changes made)
(7 real changes made)
(8 real changes made)
(8 real changes made)
(5 real changes made)
(10 real changes made)
(6 real changes made)
(4 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)
(5 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2011.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2012: all characters numeric; replaced as int
num_under_5_white_male_2012: all characters numeric; replaced as int
num_5_to_9_white_male_2012: all characters numeric; replaced as int
num_10_to_14_white_male_2012: all characters numeric; replaced as int
num_15_to_17_white_male_2012: all characters numeric; replaced as int
num_18_to_19_white_male_2012: all characters numeric; replaced as int
num_20_to_24_white_male_2012: all characters numeric; replaced as int
num_25_to_29_white_male_2012: all characters numeric; replaced as int
num_30_to_34_white_male_2012: all characters numeric; replaced as int
num_35_to_44_white_male_2012: all characters numeric; replaced as int
num_45_to_54_white_male_2012: all characters numeric; replaced as int
num_55_to_64_white_male_2012: all characters numeric; replaced as int
num_65_to_74_white_male_2012: all characters numeric; replaced as int
num_75_to_84_white_male_2012: all characters numeric; replaced as int
num_over_85_white_male_2012: all characters numeric; replaced as int
tot_white_female_2012: all characters numeric; replaced as int
num_under_5_white_female_2012: all characters numeric; replaced as int
num_5_to_9_white_female_2012: all characters numeric; replaced as int
num_10_to_14_white_female_2012: all characters numeric; replaced as int
num_15_to_17_white_female_2012: all characters numeric; replaced as int
num_18_to_19_white_female_2012: all characters numeric; replaced as int
num_20_to_24_white_female_2012: all characters numeric; replaced as int
num_25_to_29_white_female_2012: all characters numeric; replaced as int
num_30_to_34_white_female_2012: all characters numeric; replaced as int
num_35_to_44_white_female_2012: all characters numeric; replaced as int
num_45_to_54_white_female_2012: all characters numeric; replaced as int
num_55_to_64_white_female_2012: all characters numeric; replaced as int
num_65_to_74_white_female_2012: all characters numeric; replaced as int
num_75_to_84_white_female_2012: all characters numeric; replaced as int
num_over_85_white_female_2012: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2012.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2012: all characters numeric; replaced as int
num_under_5_black_male_2012: all characters numeric; replaced as int
num_5_to_9_black_male_2012: all characters numeric; replaced as int
num_10_to_14_black_male_2012: all characters numeric; replaced as int
num_15_to_17_black_male_2012: all characters numeric; replaced as int
num_18_to_19_black_male_2012: all characters numeric; replaced as int
num_20_to_24_black_male_2012: all characters numeric; replaced as int
num_25_to_29_black_male_2012: all characters numeric; replaced as int
num_30_to_34_black_male_2012: all characters numeric; replaced as int
num_35_to_44_black_male_2012: all characters numeric; replaced as int
num_45_to_54_black_male_2012: all characters numeric; replaced as int
num_55_to_64_black_male_2012: all characters numeric; replaced as int
num_65_to_74_black_male_2012: all characters numeric; replaced as int
num_75_to_84_black_male_2012: all characters numeric; replaced as int
num_over_85_black_male_2012: all characters numeric; replaced as int
tot_black_female_2012: all characters numeric; replaced as int
num_under_5_black_female_2012: all characters numeric; replaced as int
num_5_to_9_black_female_2012: all characters numeric; replaced as int
num_10_to_14_black_female_2012: all characters numeric; replaced as int
num_15_to_17_black_female_2012: all characters numeric; replaced as int
num_18_to_19_black_female_2012: all characters numeric; replaced as int
num_20_to_24_black_female_2012: all characters numeric; replaced as int
num_25_to_29_black_female_2012: all characters numeric; replaced as int
num_30_to_34_black_female_2012: all characters numeric; replaced as int
num_35_to_44_black_female_2012: all characters numeric; replaced as int
num_45_to_54_black_female_2012: all characters numeric; replaced as int
num_55_to_64_black_female_2012: all characters numeric; replaced as int
num_65_to_74_black_female_2012: all characters numeric; replaced as int
num_75_to_84_black_female_2012: all characters numeric; replaced as int
num_over_85_black_female_2012: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2012.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2012: all characters numeric; replaced as int
num_under_5_asian_male_2012: all characters numeric; replaced as int
num_5_to_9_asian_male_2012: all characters numeric; replaced as int
num_10_to_14_asian_male_2012: all characters numeric; replaced as int
num_15_to_17_asian_male_2012: all characters numeric; replaced as int
num_18_to_19_asian_male_2012: all characters numeric; replaced as int
num_20_to_24_asian_male_2012: all characters numeric; replaced as int
num_25_to_29_asian_male_2012: all characters numeric; replaced as int
num_30_to_34_asian_male_2012: all characters numeric; replaced as int
num_35_to_44_asian_male_2012: all characters numeric; replaced as int
num_45_to_54_asian_male_2012: all characters numeric; replaced as int
num_55_to_64_asian_male_2012: all characters numeric; replaced as int
num_65_to_74_asian_male_2012: all characters numeric; replaced as int
num_75_to_84_asian_male_2012: all characters numeric; replaced as int
num_over_85_asian_male_2012: all characters numeric; replaced as byte
tot_asian_female_2012: all characters numeric; replaced as int
num_under_5_asian_female_2012: all characters numeric; replaced as int
num_5_to_9_asian_female_2012: all characters numeric; replaced as int
num_10_to_14_asian_female_2012: all characters numeric; replaced as int
num_15_to_17_asian_female_2012: all characters numeric; replaced as int
num_18_to_19_asian_female_2012: all characters numeric; replaced as int
num_20_to_24_asian_female_2012: all characters numeric; replaced as int
num_25_to_29_asian_female_2012: all characters numeric; replaced as int
num_30_to_34_asian_female_2012: all characters numeric; replaced as int
num_35_to_44_asian_female_2012: all characters numeric; replaced as int
num_45_to_54_asian_female_2012: all characters numeric; replaced as int
num_55_to_64_asian_female_2012: all characters numeric; replaced as int
num_65_to_74_asian_female_2012: all characters numeric; replaced as int
num_75_to_84_asian_female_2012: all characters numeric; replaced as int
num_over_85_asian_female_2012: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2012.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2012: all characters numeric; replaced as int
num_under_5_amind_male_2012: all characters numeric; replaced as byte
num_5_to_9_amind_male_2012: all characters numeric; replaced as byte
num_10_to_14_amind_male_2012: all characters numeric; replaced as byte
num_15_to_17_amind_male_2012: all characters numeric; replaced as byte
num_18_to_19_amind_male_2012: all characters numeric; replaced as byte
num_20_to_24_amind_male_2012: all characters numeric; replaced as byte
num_25_to_29_amind_male_2012: all characters numeric; replaced as byte
num_30_to_34_amind_male_2012: all characters numeric; replaced as byte
num_35_to_44_amind_male_2012: all characters numeric; replaced as byte
num_45_to_54_amind_male_2012: all characters numeric; replaced as byte
num_55_to_64_amind_male_2012: all characters numeric; replaced as byte
num_65_to_74_amind_male_2012: all characters numeric; replaced as byte
num_75_to_84_amind_male_2012: all characters numeric; replaced as byte
num_over_85_amind_male_2012: all characters numeric; replaced as byte
tot_amind_female_2012: all characters numeric; replaced as int
num_under_5_amind_female_2012: all characters numeric; replaced as byte
num_5_to_9_amind_female_2012: all characters numeric; replaced as byte
num_10_to_14_amind_female_2012: all characters numeric; replaced as byte
num_15_to_17_amind_female_2012: all characters numeric; replaced as byte
num_18_to_19_amind_female_2012: all characters numeric; replaced as byte
num_20_to_24_amind_female_2012: all characters numeric; replaced as byte
num_25_to_29_amind_female_2012: all characters numeric; replaced as byte
num_30_to_34_amind_female_2012: all characters numeric; replaced as byte
num_35_to_44_amind_female_2012: all characters numeric; replaced as int
num_45_to_54_amind_female_2012: all characters numeric; replaced as byte
num_55_to_64_amind_female_2012: all characters numeric; replaced as byte
num_65_to_74_amind_female_2012: all characters numeric; replaced as byte
num_75_to_84_amind_female_2012: all characters numeric; replaced as byte
num_over_85_amind_female_2012: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2012.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2012: all characters numeric; replaced as byte
num_under_5_pacif_male_2012: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2012: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2012: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2012: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2012: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2012: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2012: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2012: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2012: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2012: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2012: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2012: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2012: all characters numeric; replaced as byte
num_over_85_pacif_male_2012: all characters numeric; replaced as byte
tot_pacif_female_2012: all characters numeric; replaced as int
num_under_5_pacif_female_2012: all characters numeric; replaced as int
num_5_to_9_pacif_female_2012: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2012: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2012: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2012: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2012: all characters numeric; replaced as byte
num_25_to_29_pacif_female_2012: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2012: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2012: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2012: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2012: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2012: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2012: all characters numeric; replaced as byte
num_over_85_pacif_female_2012: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2012.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(533 real changes made)
(533 real changes made)
(487 real changes made)
(485 real changes made)
(491 real changes made)
(486 real changes made)
(476 real changes made)
(503 real changes made)
(493 real changes made)
(498 real changes made)
(511 real changes made)
(515 real changes made)
(521 real changes made)
(505 real changes made)
(498 real changes made)
(453 real changes made)
(533 real changes made)
(533 real changes made)
(484 real changes made)
(481 real changes made)
(488 real changes made)
(485 real changes made)
(468 real changes made)
(494 real changes made)
(491 real changes made)
(495 real changes made)
(515 real changes made)
(519 real changes made)
(515 real changes made)
(509 real changes made)
(506 real changes made)
(483 real changes made)
(423 real changes made)
(423 real changes made)
(165 real changes made)
(179 real changes made)
(175 real changes made)
(191 real changes made)
(179 real changes made)
(219 real changes made)
(190 real changes made)
(191 real changes made)
(264 real changes made)
(273 real changes made)
(241 real changes made)
(170 real changes made)
(109 real changes made)
(49 real changes made)
(403 real changes made)
(403 real changes made)
(170 real changes made)
(174 real changes made)
(196 real changes made)
(164 real changes made)
(179 real changes made)
(215 real changes made)
(176 real changes made)
(169 real changes made)
(229 real changes made)
(242 real changes made)
(215 real changes made)
(164 real changes made)
(133 real changes made)
(94 real changes made)
(389 real changes made)
(389 real changes made)
(200 real changes made)
(209 real changes made)
(214 real changes made)
(164 real changes made)
(141 real changes made)
(192 real changes made)
(179 real changes made)
(209 real changes made)
(284 real changes made)
(271 real changes made)
(226 real changes made)
(186 real changes made)
(108 real changes made)
(42 real changes made)
(429 real changes made)
(429 real changes made)
(196 real changes made)
(227 real changes made)
(224 real changes made)
(178 real changes made)
(128 real changes made)
(187 real changes made)
(200 real changes made)
(226 real changes made)
(304 real changes made)
(289 real changes made)
(246 real changes made)
(182 real changes made)
(122 real changes made)
(67 real changes made)
(199 real changes made)
(199 real changes made)
(19 real changes made)
(22 real changes made)
(29 real changes made)
(15 real changes made)
(22 real changes made)
(39 real changes made)
(28 real changes made)
(26 real changes made)
(52 real changes made)
(74 real changes made)
(46 real changes made)
(27 real changes made)
(17 real changes made)
(3 real changes made)
(195 real changes made)
(195 real changes made)
(19 real changes made)
(23 real changes made)
(34 real changes made)
(26 real changes made)
(22 real changes made)
(31 real changes made)
(19 real changes made)
(33 real changes made)
(50 real changes made)
(65 real changes made)
(46 real changes made)
(27 real changes made)
(19 real changes made)
(13 real changes made)
(31 real changes made)
(31 real changes made)
(1 real change made)
(2 real changes made)
(0 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(4 real changes made)
(5 real changes made)
(5 real changes made)
(1 real change made)
(8 real changes made)
(1 real change made)
(0 real changes made)
(47 real changes made)
(47 real changes made)
(1 real change made)
(3 real changes made)
(3 real changes made)
(4 real changes made)
(6 real changes made)
(8 real changes made)
(9 real changes made)
(4 real changes made)
(8 real changes made)
(6 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2012.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2013: all characters numeric; replaced as int
num_under_5_white_male_2013: all characters numeric; replaced as int
num_5_to_9_white_male_2013: all characters numeric; replaced as int
num_10_to_14_white_male_2013: all characters numeric; replaced as int
num_15_to_17_white_male_2013: all characters numeric; replaced as int
num_18_to_19_white_male_2013: all characters numeric; replaced as int
num_20_to_24_white_male_2013: all characters numeric; replaced as int
num_25_to_29_white_male_2013: all characters numeric; replaced as int
num_30_to_34_white_male_2013: all characters numeric; replaced as int
num_35_to_44_white_male_2013: all characters numeric; replaced as int
num_45_to_54_white_male_2013: all characters numeric; replaced as int
num_55_to_64_white_male_2013: all characters numeric; replaced as int
num_65_to_74_white_male_2013: all characters numeric; replaced as int
num_75_to_84_white_male_2013: all characters numeric; replaced as int
num_over_85_white_male_2013: all characters numeric; replaced as int
tot_white_female_2013: all characters numeric; replaced as int
num_under_5_white_female_2013: all characters numeric; replaced as int
num_5_to_9_white_female_2013: all characters numeric; replaced as int
num_10_to_14_white_female_2013: all characters numeric; replaced as int
num_15_to_17_white_female_2013: all characters numeric; replaced as int
num_18_to_19_white_female_2013: all characters numeric; replaced as int
num_20_to_24_white_female_2013: all characters numeric; replaced as int
num_25_to_29_white_female_2013: all characters numeric; replaced as int
num_30_to_34_white_female_2013: all characters numeric; replaced as int
num_35_to_44_white_female_2013: all characters numeric; replaced as int
num_45_to_54_white_female_2013: all characters numeric; replaced as int
num_55_to_64_white_female_2013: all characters numeric; replaced as int
num_65_to_74_white_female_2013: all characters numeric; replaced as int
num_75_to_84_white_female_2013: all characters numeric; replaced as int
num_over_85_white_female_2013: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2013.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2013: all characters numeric; replaced as int
num_under_5_black_male_2013: all characters numeric; replaced as int
num_5_to_9_black_male_2013: all characters numeric; replaced as int
num_10_to_14_black_male_2013: all characters numeric; replaced as int
num_15_to_17_black_male_2013: all characters numeric; replaced as int
num_18_to_19_black_male_2013: all characters numeric; replaced as int
num_20_to_24_black_male_2013: all characters numeric; replaced as int
num_25_to_29_black_male_2013: all characters numeric; replaced as int
num_30_to_34_black_male_2013: all characters numeric; replaced as int
num_35_to_44_black_male_2013: all characters numeric; replaced as int
num_45_to_54_black_male_2013: all characters numeric; replaced as int
num_55_to_64_black_male_2013: all characters numeric; replaced as int
num_65_to_74_black_male_2013: all characters numeric; replaced as int
num_75_to_84_black_male_2013: all characters numeric; replaced as int
num_over_85_black_male_2013: all characters numeric; replaced as int
tot_black_female_2013: all characters numeric; replaced as int
num_under_5_black_female_2013: all characters numeric; replaced as int
num_5_to_9_black_female_2013: all characters numeric; replaced as int
num_10_to_14_black_female_2013: all characters numeric; replaced as int
num_15_to_17_black_female_2013: all characters numeric; replaced as int
num_18_to_19_black_female_2013: all characters numeric; replaced as int
num_20_to_24_black_female_2013: all characters numeric; replaced as int
num_25_to_29_black_female_2013: all characters numeric; replaced as int
num_30_to_34_black_female_2013: all characters numeric; replaced as int
num_35_to_44_black_female_2013: all characters numeric; replaced as int
num_45_to_54_black_female_2013: all characters numeric; replaced as int
num_55_to_64_black_female_2013: all characters numeric; replaced as int
num_65_to_74_black_female_2013: all characters numeric; replaced as int
num_75_to_84_black_female_2013: all characters numeric; replaced as int
num_over_85_black_female_2013: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2013.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2013: all characters numeric; replaced as int
num_under_5_asian_male_2013: all characters numeric; replaced as int
num_5_to_9_asian_male_2013: all characters numeric; replaced as int
num_10_to_14_asian_male_2013: all characters numeric; replaced as int
num_15_to_17_asian_male_2013: all characters numeric; replaced as int
num_18_to_19_asian_male_2013: all characters numeric; replaced as int
num_20_to_24_asian_male_2013: all characters numeric; replaced as int
num_25_to_29_asian_male_2013: all characters numeric; replaced as int
num_30_to_34_asian_male_2013: all characters numeric; replaced as int
num_35_to_44_asian_male_2013: all characters numeric; replaced as int
num_45_to_54_asian_male_2013: all characters numeric; replaced as int
num_55_to_64_asian_male_2013: all characters numeric; replaced as int
num_65_to_74_asian_male_2013: all characters numeric; replaced as int
num_75_to_84_asian_male_2013: all characters numeric; replaced as int
num_over_85_asian_male_2013: all characters numeric; replaced as int
tot_asian_female_2013: all characters numeric; replaced as int
num_under_5_asian_female_2013: all characters numeric; replaced as int
num_5_to_9_asian_female_2013: all characters numeric; replaced as int
num_10_to_14_asian_female_2013: all characters numeric; replaced as int
num_15_to_17_asian_female_2013: all characters numeric; replaced as int
num_18_to_19_asian_female_2013: all characters numeric; replaced as int
num_20_to_24_asian_female_2013: all characters numeric; replaced as int
num_25_to_29_asian_female_2013: all characters numeric; replaced as int
num_30_to_34_asian_female_2013: all characters numeric; replaced as int
num_35_to_44_asian_female_2013: all characters numeric; replaced as int
num_45_to_54_asian_female_2013: all characters numeric; replaced as int
num_55_to_64_asian_female_2013: all characters numeric; replaced as int
num_65_to_74_asian_female_2013: all characters numeric; replaced as int
num_75_to_84_asian_female_2013: all characters numeric; replaced as int
num_over_85_asian_female_2013: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2013.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2013: all characters numeric; replaced as int
num_under_5_amind_male_2013: all characters numeric; replaced as byte
num_5_to_9_amind_male_2013: all characters numeric; replaced as byte
num_10_to_14_amind_male_2013: all characters numeric; replaced as byte
num_15_to_17_amind_male_2013: all characters numeric; replaced as byte
num_18_to_19_amind_male_2013: all characters numeric; replaced as byte
num_20_to_24_amind_male_2013: all characters numeric; replaced as byte
num_25_to_29_amind_male_2013: all characters numeric; replaced as byte
num_30_to_34_amind_male_2013: all characters numeric; replaced as byte
num_35_to_44_amind_male_2013: all characters numeric; replaced as byte
num_45_to_54_amind_male_2013: all characters numeric; replaced as byte
num_55_to_64_amind_male_2013: all characters numeric; replaced as byte
num_65_to_74_amind_male_2013: all characters numeric; replaced as byte
num_75_to_84_amind_male_2013: all characters numeric; replaced as byte
num_over_85_amind_male_2013: all characters numeric; replaced as byte
tot_amind_female_2013: all characters numeric; replaced as int
num_under_5_amind_female_2013: all characters numeric; replaced as byte
num_5_to_9_amind_female_2013: all characters numeric; replaced as byte
num_10_to_14_amind_female_2013: all characters numeric; replaced as byte
num_15_to_17_amind_female_2013: all characters numeric; replaced as byte
num_18_to_19_amind_female_2013: all characters numeric; replaced as byte
num_20_to_24_amind_female_2013: all characters numeric; replaced as byte
num_25_to_29_amind_female_2013: all characters numeric; replaced as byte
num_30_to_34_amind_female_2013: all characters numeric; replaced as byte
num_35_to_44_amind_female_2013: all characters numeric; replaced as byte
num_45_to_54_amind_female_2013: all characters numeric; replaced as byte
num_55_to_64_amind_female_2013: all characters numeric; replaced as byte
num_65_to_74_amind_female_2013: all characters numeric; replaced as byte
num_75_to_84_amind_female_2013: all characters numeric; replaced as byte
num_over_85_amind_female_2013: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2013.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2013: all characters numeric; replaced as byte
num_under_5_pacif_male_2013: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2013: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2013: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2013: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2013: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2013: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2013: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2013: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2013: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2013: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2013: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2013: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2013: all characters numeric; replaced as byte
num_over_85_pacif_male_2013: all characters numeric; replaced as byte
tot_pacif_female_2013: all characters numeric; replaced as int
num_under_5_pacif_female_2013: all characters numeric; replaced as int
num_5_to_9_pacif_female_2013: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2013: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2013: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2013: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2013: all characters numeric; replaced as byte
num_25_to_29_pacif_female_2013: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2013: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2013: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2013: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2013: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2013: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2013: all characters numeric; replaced as byte
num_over_85_pacif_female_2013: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2013.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(533 real changes made)
(533 real changes made)
(481 real changes made)
(480 real changes made)
(484 real changes made)
(487 real changes made)
(474 real changes made)
(501 real changes made)
(493 real changes made)
(495 real changes made)
(511 real changes made)
(514 real changes made)
(522 real changes made)
(505 real changes made)
(502 real changes made)
(458 real changes made)
(533 real changes made)
(533 real changes made)
(483 real changes made)
(483 real changes made)
(484 real changes made)
(480 real changes made)
(471 real changes made)
(496 real changes made)
(485 real changes made)
(499 real changes made)
(514 real changes made)
(517 real changes made)
(513 real changes made)
(511 real changes made)
(507 real changes made)
(483 real changes made)
(425 real changes made)
(425 real changes made)
(164 real changes made)
(189 real changes made)
(179 real changes made)
(191 real changes made)
(181 real changes made)
(227 real changes made)
(190 real changes made)
(188 real changes made)
(257 real changes made)
(283 real changes made)
(253 real changes made)
(182 real changes made)
(108 real changes made)
(49 real changes made)
(417 real changes made)
(417 real changes made)
(166 real changes made)
(177 real changes made)
(195 real changes made)
(165 real changes made)
(178 real changes made)
(228 real changes made)
(186 real changes made)
(160 real changes made)
(230 real changes made)
(254 real changes made)
(218 real changes made)
(174 real changes made)
(147 real changes made)
(93 real changes made)
(395 real changes made)
(395 real changes made)
(199 real changes made)
(213 real changes made)
(214 real changes made)
(173 real changes made)
(142 real changes made)
(195 real changes made)
(180 real changes made)
(217 real changes made)
(288 real changes made)
(277 real changes made)
(244 real changes made)
(187 real changes made)
(119 real changes made)
(47 real changes made)
(437 real changes made)
(437 real changes made)
(196 real changes made)
(224 real changes made)
(231 real changes made)
(192 real changes made)
(137 real changes made)
(187 real changes made)
(203 real changes made)
(234 real changes made)
(314 real changes made)
(285 real changes made)
(259 real changes made)
(192 real changes made)
(129 real changes made)
(66 real changes made)
(195 real changes made)
(195 real changes made)
(22 real changes made)
(24 real changes made)
(25 real changes made)
(16 real changes made)
(21 real changes made)
(42 real changes made)
(27 real changes made)
(30 real changes made)
(51 real changes made)
(74 real changes made)
(48 real changes made)
(32 real changes made)
(15 real changes made)
(5 real changes made)
(193 real changes made)
(193 real changes made)
(20 real changes made)
(24 real changes made)
(36 real changes made)
(25 real changes made)
(24 real changes made)
(30 real changes made)
(20 real changes made)
(30 real changes made)
(44 real changes made)
(63 real changes made)
(55 real changes made)
(30 real changes made)
(20 real changes made)
(9 real changes made)
(33 real changes made)
(33 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(4 real changes made)
(1 real change made)
(3 real changes made)
(1 real change made)
(5 real changes made)
(4 real changes made)
(9 real changes made)
(2 real changes made)
(7 real changes made)
(1 real change made)
(1 real change made)
(49 real changes made)
(49 real changes made)
(1 real change made)
(4 real changes made)
(4 real changes made)
(6 real changes made)
(7 real changes made)
(7 real changes made)
(8 real changes made)
(3 real changes made)
(10 real changes made)
(6 real changes made)
(3 real changes made)
(5 real changes made)
(1 real change made)
(0 real changes made)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
(4 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2013.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2014: all characters numeric; replaced as int
num_under_5_white_male_2014: all characters numeric; replaced as int
num_5_to_9_white_male_2014: all characters numeric; replaced as int
num_10_to_14_white_male_2014: all characters numeric; replaced as int
num_15_to_17_white_male_2014: all characters numeric; replaced as int
num_18_to_19_white_male_2014: all characters numeric; replaced as int
num_20_to_24_white_male_2014: all characters numeric; replaced as int
num_25_to_29_white_male_2014: all characters numeric; replaced as int
num_30_to_34_white_male_2014: all characters numeric; replaced as int
num_35_to_44_white_male_2014: all characters numeric; replaced as int
num_45_to_54_white_male_2014: all characters numeric; replaced as int
num_55_to_64_white_male_2014: all characters numeric; replaced as int
num_65_to_74_white_male_2014: all characters numeric; replaced as int
num_75_to_84_white_male_2014: all characters numeric; replaced as int
num_over_85_white_male_2014: all characters numeric; replaced as int
tot_white_female_2014: all characters numeric; replaced as int
num_under_5_white_female_2014: all characters numeric; replaced as int
num_5_to_9_white_female_2014: all characters numeric; replaced as int
num_10_to_14_white_female_2014: all characters numeric; replaced as int
num_15_to_17_white_female_2014: all characters numeric; replaced as int
num_18_to_19_white_female_2014: all characters numeric; replaced as int
num_20_to_24_white_female_2014: all characters numeric; replaced as int
num_25_to_29_white_female_2014: all characters numeric; replaced as int
num_30_to_34_white_female_2014: all characters numeric; replaced as int
num_35_to_44_white_female_2014: all characters numeric; replaced as int
num_45_to_54_white_female_2014: all characters numeric; replaced as int
num_55_to_64_white_female_2014: all characters numeric; replaced as int
num_65_to_74_white_female_2014: all characters numeric; replaced as int
num_75_to_84_white_female_2014: all characters numeric; replaced as int
num_over_85_white_female_2014: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2014.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2014: all characters numeric; replaced as int
num_under_5_black_male_2014: all characters numeric; replaced as int
num_5_to_9_black_male_2014: all characters numeric; replaced as int
num_10_to_14_black_male_2014: all characters numeric; replaced as int
num_15_to_17_black_male_2014: all characters numeric; replaced as int
num_18_to_19_black_male_2014: all characters numeric; replaced as int
num_20_to_24_black_male_2014: all characters numeric; replaced as int
num_25_to_29_black_male_2014: all characters numeric; replaced as int
num_30_to_34_black_male_2014: all characters numeric; replaced as int
num_35_to_44_black_male_2014: all characters numeric; replaced as int
num_45_to_54_black_male_2014: all characters numeric; replaced as int
num_55_to_64_black_male_2014: all characters numeric; replaced as int
num_65_to_74_black_male_2014: all characters numeric; replaced as int
num_75_to_84_black_male_2014: all characters numeric; replaced as int
num_over_85_black_male_2014: all characters numeric; replaced as int
tot_black_female_2014: all characters numeric; replaced as int
num_under_5_black_female_2014: all characters numeric; replaced as int
num_5_to_9_black_female_2014: all characters numeric; replaced as int
num_10_to_14_black_female_2014: all characters numeric; replaced as int
num_15_to_17_black_female_2014: all characters numeric; replaced as int
num_18_to_19_black_female_2014: all characters numeric; replaced as int
num_20_to_24_black_female_2014: all characters numeric; replaced as int
num_25_to_29_black_female_2014: all characters numeric; replaced as int
num_30_to_34_black_female_2014: all characters numeric; replaced as int
num_35_to_44_black_female_2014: all characters numeric; replaced as int
num_45_to_54_black_female_2014: all characters numeric; replaced as int
num_55_to_64_black_female_2014: all characters numeric; replaced as int
num_65_to_74_black_female_2014: all characters numeric; replaced as int
num_75_to_84_black_female_2014: all characters numeric; replaced as int
num_over_85_black_female_2014: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2014.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2014: all characters numeric; replaced as int
num_under_5_asian_male_2014: all characters numeric; replaced as int
num_5_to_9_asian_male_2014: all characters numeric; replaced as int
num_10_to_14_asian_male_2014: all characters numeric; replaced as int
num_15_to_17_asian_male_2014: all characters numeric; replaced as int
num_18_to_19_asian_male_2014: all characters numeric; replaced as int
num_20_to_24_asian_male_2014: all characters numeric; replaced as int
num_25_to_29_asian_male_2014: all characters numeric; replaced as int
num_30_to_34_asian_male_2014: all characters numeric; replaced as int
num_35_to_44_asian_male_2014: all characters numeric; replaced as int
num_45_to_54_asian_male_2014: all characters numeric; replaced as int
num_55_to_64_asian_male_2014: all characters numeric; replaced as int
num_65_to_74_asian_male_2014: all characters numeric; replaced as int
num_75_to_84_asian_male_2014: all characters numeric; replaced as int
num_over_85_asian_male_2014: all characters numeric; replaced as byte
tot_asian_female_2014: all characters numeric; replaced as int
num_under_5_asian_female_2014: all characters numeric; replaced as int
num_5_to_9_asian_female_2014: all characters numeric; replaced as int
num_10_to_14_asian_female_2014: all characters numeric; replaced as int
num_15_to_17_asian_female_2014: all characters numeric; replaced as int
num_18_to_19_asian_female_2014: all characters numeric; replaced as int
num_20_to_24_asian_female_2014: all characters numeric; replaced as int
num_25_to_29_asian_female_2014: all characters numeric; replaced as int
num_30_to_34_asian_female_2014: all characters numeric; replaced as int
num_35_to_44_asian_female_2014: all characters numeric; replaced as int
num_45_to_54_asian_female_2014: all characters numeric; replaced as int
num_55_to_64_asian_female_2014: all characters numeric; replaced as int
num_65_to_74_asian_female_2014: all characters numeric; replaced as int
num_75_to_84_asian_female_2014: all characters numeric; replaced as int
num_over_85_asian_female_2014: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2014.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2014: all characters numeric; replaced as int
num_under_5_amind_male_2014: all characters numeric; replaced as byte
num_5_to_9_amind_male_2014: all characters numeric; replaced as byte
num_10_to_14_amind_male_2014: all characters numeric; replaced as byte
num_15_to_17_amind_male_2014: all characters numeric; replaced as byte
num_18_to_19_amind_male_2014: all characters numeric; replaced as byte
num_20_to_24_amind_male_2014: all characters numeric; replaced as byte
num_25_to_29_amind_male_2014: all characters numeric; replaced as byte
num_30_to_34_amind_male_2014: all characters numeric; replaced as byte
num_35_to_44_amind_male_2014: all characters numeric; replaced as byte
num_45_to_54_amind_male_2014: all characters numeric; replaced as byte
num_55_to_64_amind_male_2014: all characters numeric; replaced as byte
num_65_to_74_amind_male_2014: all characters numeric; replaced as byte
num_75_to_84_amind_male_2014: all characters numeric; replaced as byte
num_over_85_amind_male_2014: all characters numeric; replaced as byte
tot_amind_female_2014: all characters numeric; replaced as int
num_under_5_amind_female_2014: all characters numeric; replaced as byte
num_5_to_9_amind_female_2014: all characters numeric; replaced as byte
num_10_to_14_amind_female_2014: all characters numeric; replaced as byte
num_15_to_17_amind_female_2014: all characters numeric; replaced as byte
num_18_to_19_amind_female_2014: all characters numeric; replaced as byte
num_20_to_24_amind_female_2014: all characters numeric; replaced as byte
num_25_to_29_amind_female_2014: all characters numeric; replaced as byte
num_30_to_34_amind_female_2014: all characters numeric; replaced as byte
num_35_to_44_amind_female_2014: all characters numeric; replaced as byte
num_45_to_54_amind_female_2014: all characters numeric; replaced as byte
num_55_to_64_amind_female_2014: all characters numeric; replaced as byte
num_65_to_74_amind_female_2014: all characters numeric; replaced as byte
num_75_to_84_amind_female_2014: all characters numeric; replaced as byte
num_over_85_amind_female_2014: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2014.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2014: all characters numeric; replaced as byte
num_under_5_pacif_male_2014: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2014: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2014: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2014: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2014: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2014: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2014: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2014: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2014: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2014: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2014: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2014: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2014: all characters numeric; replaced as byte
num_over_85_pacif_male_2014: all characters numeric; replaced as byte
tot_pacif_female_2014: all characters numeric; replaced as byte
num_under_5_pacif_female_2014: all characters numeric; replaced as byte
num_5_to_9_pacif_female_2014: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2014: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2014: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2014: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2014: all characters numeric; replaced as byte
num_25_to_29_pacif_female_2014: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2014: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2014: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2014: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2014: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2014: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2014: all characters numeric; replaced as byte
num_over_85_pacif_female_2014: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2014.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(534 real changes made)
(534 real changes made)
(484 real changes made)
(484 real changes made)
(482 real changes made)
(484 real changes made)
(472 real changes made)
(500 real changes made)
(496 real changes made)
(496 real changes made)
(510 real changes made)
(514 real changes made)
(523 real changes made)
(506 real changes made)
(509 real changes made)
(455 real changes made)
(534 real changes made)
(534 real changes made)
(483 real changes made)
(488 real changes made)
(481 real changes made)
(475 real changes made)
(461 real changes made)
(494 real changes made)
(486 real changes made)
(497 real changes made)
(511 real changes made)
(517 real changes made)
(513 real changes made)
(513 real changes made)
(509 real changes made)
(482 real changes made)
(433 real changes made)
(433 real changes made)
(168 real changes made)
(189 real changes made)
(186 real changes made)
(192 real changes made)
(174 real changes made)
(229 real changes made)
(196 real changes made)
(188 real changes made)
(267 real changes made)
(293 real changes made)
(257 real changes made)
(194 real changes made)
(111 real changes made)
(52 real changes made)
(417 real changes made)
(417 real changes made)
(173 real changes made)
(179 real changes made)
(197 real changes made)
(164 real changes made)
(169 real changes made)
(221 real changes made)
(193 real changes made)
(174 real changes made)
(233 real changes made)
(253 real changes made)
(228 real changes made)
(176 real changes made)
(146 real changes made)
(86 real changes made)
(391 real changes made)
(391 real changes made)
(201 real changes made)
(200 real changes made)
(216 real changes made)
(186 real changes made)
(150 real changes made)
(200 real changes made)
(188 real changes made)
(219 real changes made)
(280 real changes made)
(285 real changes made)
(246 real changes made)
(194 real changes made)
(131 real changes made)
(49 real changes made)
(437 real changes made)
(437 real changes made)
(194 real changes made)
(226 real changes made)
(246 real changes made)
(194 real changes made)
(143 real changes made)
(196 real changes made)
(215 real changes made)
(249 real changes made)
(315 real changes made)
(287 real changes made)
(261 real changes made)
(205 real changes made)
(148 real changes made)
(74 real changes made)
(195 real changes made)
(195 real changes made)
(21 real changes made)
(30 real changes made)
(26 real changes made)
(18 real changes made)
(22 real changes made)
(41 real changes made)
(28 real changes made)
(30 real changes made)
(53 real changes made)
(75 real changes made)
(51 real changes made)
(32 real changes made)
(17 real changes made)
(5 real changes made)
(203 real changes made)
(203 real changes made)
(21 real changes made)
(30 real changes made)
(37 real changes made)
(27 real changes made)
(23 real changes made)
(30 real changes made)
(24 real changes made)
(33 real changes made)
(47 real changes made)
(64 real changes made)
(62 real changes made)
(39 real changes made)
(20 real changes made)
(6 real changes made)
(36 real changes made)
(36 real changes made)
(1 real change made)
(4 real changes made)
(0 real changes made)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(0 real changes made)
(3 real changes made)
(7 real changes made)
(9 real changes made)
(2 real changes made)
(7 real changes made)
(1 real change made)
(1 real change made)
(48 real changes made)
(48 real changes made)
(1 real change made)
(4 real changes made)
(5 real changes made)
(2 real changes made)
(6 real changes made)
(5 real changes made)
(9 real changes made)
(3 real changes made)
(7 real changes made)
(4 real changes made)
(5 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2014.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2015: all characters numeric; replaced as int
num_under_5_white_male_2015: all characters numeric; replaced as int
num_5_to_9_white_male_2015: all characters numeric; replaced as int
num_10_to_14_white_male_2015: all characters numeric; replaced as int
num_15_to_17_white_male_2015: all characters numeric; replaced as int
num_18_to_19_white_male_2015: all characters numeric; replaced as int
num_20_to_24_white_male_2015: all characters numeric; replaced as int
num_25_to_29_white_male_2015: all characters numeric; replaced as int
num_30_to_34_white_male_2015: all characters numeric; replaced as int
num_35_to_44_white_male_2015: all characters numeric; replaced as int
num_45_to_54_white_male_2015: all characters numeric; replaced as int
num_55_to_64_white_male_2015: all characters numeric; replaced as int
num_65_to_74_white_male_2015: all characters numeric; replaced as int
num_75_to_84_white_male_2015: all characters numeric; replaced as int
num_over_85_white_male_2015: all characters numeric; replaced as int
tot_white_female_2015: all characters numeric; replaced as int
num_under_5_white_female_2015: all characters numeric; replaced as int
num_5_to_9_white_female_2015: all characters numeric; replaced as int
num_10_to_14_white_female_2015: all characters numeric; replaced as int
num_15_to_17_white_female_2015: all characters numeric; replaced as int
num_18_to_19_white_female_2015: all characters numeric; replaced as int
num_20_to_24_white_female_2015: all characters numeric; replaced as int
num_25_to_29_white_female_2015: all characters numeric; replaced as int
num_30_to_34_white_female_2015: all characters numeric; replaced as int
num_35_to_44_white_female_2015: all characters numeric; replaced as int
num_45_to_54_white_female_2015: all characters numeric; replaced as int
num_55_to_64_white_female_2015: all characters numeric; replaced as int
num_65_to_74_white_female_2015: all characters numeric; replaced as int
num_75_to_84_white_female_2015: all characters numeric; replaced as int
num_over_85_white_female_2015: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2015.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2015: all characters numeric; replaced as int
num_under_5_black_male_2015: all characters numeric; replaced as int
num_5_to_9_black_male_2015: all characters numeric; replaced as int
num_10_to_14_black_male_2015: all characters numeric; replaced as int
num_15_to_17_black_male_2015: all characters numeric; replaced as int
num_18_to_19_black_male_2015: all characters numeric; replaced as int
num_20_to_24_black_male_2015: all characters numeric; replaced as int
num_25_to_29_black_male_2015: all characters numeric; replaced as int
num_30_to_34_black_male_2015: all characters numeric; replaced as int
num_35_to_44_black_male_2015: all characters numeric; replaced as int
num_45_to_54_black_male_2015: all characters numeric; replaced as int
num_55_to_64_black_male_2015: all characters numeric; replaced as int
num_65_to_74_black_male_2015: all characters numeric; replaced as int
num_75_to_84_black_male_2015: all characters numeric; replaced as int
num_over_85_black_male_2015: all characters numeric; replaced as int
tot_black_female_2015: all characters numeric; replaced as int
num_under_5_black_female_2015: all characters numeric; replaced as int
num_5_to_9_black_female_2015: all characters numeric; replaced as int
num_10_to_14_black_female_2015: all characters numeric; replaced as int
num_15_to_17_black_female_2015: all characters numeric; replaced as int
num_18_to_19_black_female_2015: all characters numeric; replaced as int
num_20_to_24_black_female_2015: all characters numeric; replaced as int
num_25_to_29_black_female_2015: all characters numeric; replaced as int
num_30_to_34_black_female_2015: all characters numeric; replaced as int
num_35_to_44_black_female_2015: all characters numeric; replaced as int
num_45_to_54_black_female_2015: all characters numeric; replaced as int
num_55_to_64_black_female_2015: all characters numeric; replaced as int
num_65_to_74_black_female_2015: all characters numeric; replaced as int
num_75_to_84_black_female_2015: all characters numeric; replaced as int
num_over_85_black_female_2015: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2015.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2015: all characters numeric; replaced as int
num_under_5_asian_male_2015: all characters numeric; replaced as int
num_5_to_9_asian_male_2015: all characters numeric; replaced as int
num_10_to_14_asian_male_2015: all characters numeric; replaced as int
num_15_to_17_asian_male_2015: all characters numeric; replaced as int
num_18_to_19_asian_male_2015: all characters numeric; replaced as int
num_20_to_24_asian_male_2015: all characters numeric; replaced as int
num_25_to_29_asian_male_2015: all characters numeric; replaced as int
num_30_to_34_asian_male_2015: all characters numeric; replaced as int
num_35_to_44_asian_male_2015: all characters numeric; replaced as int
num_45_to_54_asian_male_2015: all characters numeric; replaced as int
num_55_to_64_asian_male_2015: all characters numeric; replaced as int
num_65_to_74_asian_male_2015: all characters numeric; replaced as int
num_75_to_84_asian_male_2015: all characters numeric; replaced as int
num_over_85_asian_male_2015: all characters numeric; replaced as int
tot_asian_female_2015: all characters numeric; replaced as int
num_under_5_asian_female_2015: all characters numeric; replaced as int
num_5_to_9_asian_female_2015: all characters numeric; replaced as int
num_10_to_14_asian_female_2015: all characters numeric; replaced as int
num_15_to_17_asian_female_2015: all characters numeric; replaced as int
num_18_to_19_asian_female_2015: all characters numeric; replaced as int
num_20_to_24_asian_female_2015: all characters numeric; replaced as int
num_25_to_29_asian_female_2015: all characters numeric; replaced as int
num_30_to_34_asian_female_2015: all characters numeric; replaced as int
num_35_to_44_asian_female_2015: all characters numeric; replaced as int
num_45_to_54_asian_female_2015: all characters numeric; replaced as int
num_55_to_64_asian_female_2015: all characters numeric; replaced as int
num_65_to_74_asian_female_2015: all characters numeric; replaced as int
num_75_to_84_asian_female_2015: all characters numeric; replaced as int
num_over_85_asian_female_2015: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2015.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2015: all characters numeric; replaced as int
num_under_5_amind_male_2015: all characters numeric; replaced as byte
num_5_to_9_amind_male_2015: all characters numeric; replaced as byte
num_10_to_14_amind_male_2015: all characters numeric; replaced as byte
num_15_to_17_amind_male_2015: all characters numeric; replaced as byte
num_18_to_19_amind_male_2015: all characters numeric; replaced as byte
num_20_to_24_amind_male_2015: all characters numeric; replaced as byte
num_25_to_29_amind_male_2015: all characters numeric; replaced as byte
num_30_to_34_amind_male_2015: all characters numeric; replaced as byte
num_35_to_44_amind_male_2015: all characters numeric; replaced as byte
num_45_to_54_amind_male_2015: all characters numeric; replaced as byte
num_55_to_64_amind_male_2015: all characters numeric; replaced as byte
num_65_to_74_amind_male_2015: all characters numeric; replaced as byte
num_75_to_84_amind_male_2015: all characters numeric; replaced as byte
num_over_85_amind_male_2015: all characters numeric; replaced as byte
tot_amind_female_2015: all characters numeric; replaced as int
num_under_5_amind_female_2015: all characters numeric; replaced as byte
num_5_to_9_amind_female_2015: all characters numeric; replaced as byte
num_10_to_14_amind_female_2015: all characters numeric; replaced as byte
num_15_to_17_amind_female_2015: all characters numeric; replaced as byte
num_18_to_19_amind_female_2015: all characters numeric; replaced as byte
num_20_to_24_amind_female_2015: all characters numeric; replaced as int
num_25_to_29_amind_female_2015: all characters numeric; replaced as byte
num_30_to_34_amind_female_2015: all characters numeric; replaced as byte
num_35_to_44_amind_female_2015: all characters numeric; replaced as byte
num_45_to_54_amind_female_2015: all characters numeric; replaced as byte
num_55_to_64_amind_female_2015: all characters numeric; replaced as byte
num_65_to_74_amind_female_2015: all characters numeric; replaced as byte
num_75_to_84_amind_female_2015: all characters numeric; replaced as byte
num_over_85_amind_female_2015: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2015.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2015: all characters numeric; replaced as byte
num_under_5_pacif_male_2015: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2015: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2015: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2015: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2015: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2015: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2015: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2015: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2015: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2015: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2015: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2015: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2015: all characters numeric; replaced as byte
num_over_85_pacif_male_2015: all characters numeric; replaced as byte
tot_pacif_female_2015: all characters numeric; replaced as int
num_under_5_pacif_female_2015: all characters numeric; replaced as byte
num_5_to_9_pacif_female_2015: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2015: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2015: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2015: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2015: all characters numeric; replaced as int
num_25_to_29_pacif_female_2015: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2015: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2015: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2015: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2015: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2015: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2015: all characters numeric; replaced as byte
num_over_85_pacif_female_2015: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2015.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(534 real changes made)
(534 real changes made)
(481 real changes made)
(481 real changes made)
(485 real changes made)
(484 real changes made)
(473 real changes made)
(496 real changes made)
(494 real changes made)
(497 real changes made)
(517 real changes made)
(514 real changes made)
(520 real changes made)
(510 real changes made)
(507 real changes made)
(454 real changes made)
(533 real changes made)
(533 real changes made)
(482 real changes made)
(488 real changes made)
(484 real changes made)
(484 real changes made)
(469 real changes made)
(499 real changes made)
(491 real changes made)
(498 real changes made)
(513 real changes made)
(519 real changes made)
(512 real changes made)
(514 real changes made)
(507 real changes made)
(480 real changes made)
(435 real changes made)
(435 real changes made)
(169 real changes made)
(196 real changes made)
(195 real changes made)
(200 real changes made)
(186 real changes made)
(245 real changes made)
(194 real changes made)
(200 real changes made)
(277 real changes made)
(296 real changes made)
(257 real changes made)
(192 real changes made)
(112 real changes made)
(54 real changes made)
(423 real changes made)
(423 real changes made)
(173 real changes made)
(182 real changes made)
(206 real changes made)
(168 real changes made)
(168 real changes made)
(236 real changes made)
(195 real changes made)
(188 real changes made)
(237 real changes made)
(247 real changes made)
(235 real changes made)
(186 real changes made)
(147 real changes made)
(85 real changes made)
(399 real changes made)
(399 real changes made)
(199 real changes made)
(199 real changes made)
(214 real changes made)
(182 real changes made)
(155 real changes made)
(208 real changes made)
(191 real changes made)
(221 real changes made)
(282 real changes made)
(290 real changes made)
(259 real changes made)
(206 real changes made)
(127 real changes made)
(58 real changes made)
(442 real changes made)
(442 real changes made)
(201 real changes made)
(220 real changes made)
(249 real changes made)
(201 real changes made)
(154 real changes made)
(198 real changes made)
(222 real changes made)
(257 real changes made)
(324 real changes made)
(297 real changes made)
(272 real changes made)
(226 real changes made)
(149 real changes made)
(76 real changes made)
(191 real changes made)
(191 real changes made)
(24 real changes made)
(30 real changes made)
(25 real changes made)
(19 real changes made)
(18 real changes made)
(38 real changes made)
(28 real changes made)
(29 real changes made)
(50 real changes made)
(76 real changes made)
(58 real changes made)
(31 real changes made)
(13 real changes made)
(4 real changes made)
(209 real changes made)
(209 real changes made)
(21 real changes made)
(32 real changes made)
(35 real changes made)
(24 real changes made)
(23 real changes made)
(30 real changes made)
(31 real changes made)
(36 real changes made)
(47 real changes made)
(73 real changes made)
(58 real changes made)
(41 real changes made)
(16 real changes made)
(4 real changes made)
(40 real changes made)
(40 real changes made)
(2 real changes made)
(5 real changes made)
(2 real changes made)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(3 real changes made)
(8 real changes made)
(10 real changes made)
(2 real changes made)
(7 real changes made)
(1 real change made)
(1 real change made)
(45 real changes made)
(45 real changes made)
(1 real change made)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(4 real changes made)
(7 real changes made)
(9 real changes made)
(4 real changes made)
(6 real changes made)
(3 real changes made)
(4 real changes made)
(5 real changes made)
(2 real changes made)
(1 real change made)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2015.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2016: all characters numeric; replaced as int
num_under_5_white_male_2016: all characters numeric; replaced as int
num_5_to_9_white_male_2016: all characters numeric; replaced as int
num_10_to_14_white_male_2016: all characters numeric; replaced as int
num_15_to_17_white_male_2016: all characters numeric; replaced as int
num_18_to_19_white_male_2016: all characters numeric; replaced as int
num_20_to_24_white_male_2016: all characters numeric; replaced as int
num_25_to_29_white_male_2016: all characters numeric; replaced as int
num_30_to_34_white_male_2016: all characters numeric; replaced as int
num_35_to_44_white_male_2016: all characters numeric; replaced as int
num_45_to_54_white_male_2016: all characters numeric; replaced as int
num_55_to_64_white_male_2016: all characters numeric; replaced as int
num_65_to_74_white_male_2016: all characters numeric; replaced as int
num_75_to_84_white_male_2016: all characters numeric; replaced as int
num_over_85_white_male_2016: all characters numeric; replaced as int
tot_white_female_2016: all characters numeric; replaced as int
num_under_5_white_female_2016: all characters numeric; replaced as int
num_5_to_9_white_female_2016: all characters numeric; replaced as int
num_10_to_14_white_female_2016: all characters numeric; replaced as int
num_15_to_17_white_female_2016: all characters numeric; replaced as int
num_18_to_19_white_female_2016: all characters numeric; replaced as int
num_20_to_24_white_female_2016: all characters numeric; replaced as int
num_25_to_29_white_female_2016: all characters numeric; replaced as int
num_30_to_34_white_female_2016: all characters numeric; replaced as int
num_35_to_44_white_female_2016: all characters numeric; replaced as int
num_45_to_54_white_female_2016: all characters numeric; replaced as int
num_55_to_64_white_female_2016: all characters numeric; replaced as int
num_65_to_74_white_female_2016: all characters numeric; replaced as int
num_75_to_84_white_female_2016: all characters numeric; replaced as int
num_over_85_white_female_2016: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2016.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2016: all characters numeric; replaced as int
num_under_5_black_male_2016: all characters numeric; replaced as int
num_5_to_9_black_male_2016: all characters numeric; replaced as int
num_10_to_14_black_male_2016: all characters numeric; replaced as int
num_15_to_17_black_male_2016: all characters numeric; replaced as int
num_18_to_19_black_male_2016: all characters numeric; replaced as int
num_20_to_24_black_male_2016: all characters numeric; replaced as int
num_25_to_29_black_male_2016: all characters numeric; replaced as int
num_30_to_34_black_male_2016: all characters numeric; replaced as int
num_35_to_44_black_male_2016: all characters numeric; replaced as int
num_45_to_54_black_male_2016: all characters numeric; replaced as int
num_55_to_64_black_male_2016: all characters numeric; replaced as int
num_65_to_74_black_male_2016: all characters numeric; replaced as int
num_75_to_84_black_male_2016: all characters numeric; replaced as int
num_over_85_black_male_2016: all characters numeric; replaced as int
tot_black_female_2016: all characters numeric; replaced as int
num_under_5_black_female_2016: all characters numeric; replaced as int
num_5_to_9_black_female_2016: all characters numeric; replaced as int
num_10_to_14_black_female_2016: all characters numeric; replaced as int
num_15_to_17_black_female_2016: all characters numeric; replaced as int
num_18_to_19_black_female_2016: all characters numeric; replaced as int
num_20_to_24_black_female_2016: all characters numeric; replaced as int
num_25_to_29_black_female_2016: all characters numeric; replaced as int
num_30_to_34_black_female_2016: all characters numeric; replaced as int
num_35_to_44_black_female_2016: all characters numeric; replaced as int
num_45_to_54_black_female_2016: all characters numeric; replaced as int
num_55_to_64_black_female_2016: all characters numeric; replaced as int
num_65_to_74_black_female_2016: all characters numeric; replaced as int
num_75_to_84_black_female_2016: all characters numeric; replaced as int
num_over_85_black_female_2016: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2016.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2016: all characters numeric; replaced as int
num_under_5_asian_male_2016: all characters numeric; replaced as int
num_5_to_9_asian_male_2016: all characters numeric; replaced as int
num_10_to_14_asian_male_2016: all characters numeric; replaced as int
num_15_to_17_asian_male_2016: all characters numeric; replaced as int
num_18_to_19_asian_male_2016: all characters numeric; replaced as int
num_20_to_24_asian_male_2016: all characters numeric; replaced as int
num_25_to_29_asian_male_2016: all characters numeric; replaced as int
num_30_to_34_asian_male_2016: all characters numeric; replaced as int
num_35_to_44_asian_male_2016: all characters numeric; replaced as int
num_45_to_54_asian_male_2016: all characters numeric; replaced as int
num_55_to_64_asian_male_2016: all characters numeric; replaced as int
num_65_to_74_asian_male_2016: all characters numeric; replaced as int
num_75_to_84_asian_male_2016: all characters numeric; replaced as int
num_over_85_asian_male_2016: all characters numeric; replaced as int
tot_asian_female_2016: all characters numeric; replaced as int
num_under_5_asian_female_2016: all characters numeric; replaced as int
num_5_to_9_asian_female_2016: all characters numeric; replaced as int
num_10_to_14_asian_female_2016: all characters numeric; replaced as int
num_15_to_17_asian_female_2016: all characters numeric; replaced as int
num_18_to_19_asian_female_2016: all characters numeric; replaced as int
num_20_to_24_asian_female_2016: all characters numeric; replaced as int
num_25_to_29_asian_female_2016: all characters numeric; replaced as int
num_30_to_34_asian_female_2016: all characters numeric; replaced as int
num_35_to_44_asian_female_2016: all characters numeric; replaced as int
num_45_to_54_asian_female_2016: all characters numeric; replaced as int
num_55_to_64_asian_female_2016: all characters numeric; replaced as int
num_65_to_74_asian_female_2016: all characters numeric; replaced as int
num_75_to_84_asian_female_2016: all characters numeric; replaced as int
num_over_85_asian_female_2016: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2016.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2016: all characters numeric; replaced as int
num_under_5_amind_male_2016: all characters numeric; replaced as byte
num_5_to_9_amind_male_2016: all characters numeric; replaced as byte
num_10_to_14_amind_male_2016: all characters numeric; replaced as byte
num_15_to_17_amind_male_2016: all characters numeric; replaced as byte
num_18_to_19_amind_male_2016: all characters numeric; replaced as byte
num_20_to_24_amind_male_2016: all characters numeric; replaced as byte
num_25_to_29_amind_male_2016: all characters numeric; replaced as byte
num_30_to_34_amind_male_2016: all characters numeric; replaced as byte
num_35_to_44_amind_male_2016: all characters numeric; replaced as byte
num_45_to_54_amind_male_2016: all characters numeric; replaced as byte
num_55_to_64_amind_male_2016: all characters numeric; replaced as byte
num_65_to_74_amind_male_2016: all characters numeric; replaced as byte
num_75_to_84_amind_male_2016: all characters numeric; replaced as byte
num_over_85_amind_male_2016: all characters numeric; replaced as byte
tot_amind_female_2016: all characters numeric; replaced as int
num_under_5_amind_female_2016: all characters numeric; replaced as byte
num_5_to_9_amind_female_2016: all characters numeric; replaced as byte
num_10_to_14_amind_female_2016: all characters numeric; replaced as byte
num_15_to_17_amind_female_2016: all characters numeric; replaced as byte
num_18_to_19_amind_female_2016: all characters numeric; replaced as byte
num_20_to_24_amind_female_2016: all characters numeric; replaced as int
num_25_to_29_amind_female_2016: all characters numeric; replaced as byte
num_30_to_34_amind_female_2016: all characters numeric; replaced as byte
num_35_to_44_amind_female_2016: all characters numeric; replaced as byte
num_45_to_54_amind_female_2016: all characters numeric; replaced as byte
num_55_to_64_amind_female_2016: all characters numeric; replaced as byte
num_65_to_74_amind_female_2016: all characters numeric; replaced as byte
num_75_to_84_amind_female_2016: all characters numeric; replaced as byte
num_over_85_amind_female_2016: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2016.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2016: all characters numeric; replaced as byte
num_under_5_pacif_male_2016: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2016: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2016: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2016: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2016: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2016: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2016: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2016: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2016: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2016: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2016: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2016: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2016: all characters numeric; replaced as byte
num_over_85_pacif_male_2016: all characters numeric; replaced as byte
tot_pacif_female_2016: all characters numeric; replaced as int
num_under_5_pacif_female_2016: all characters numeric; replaced as byte
num_5_to_9_pacif_female_2016: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2016: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2016: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2016: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2016: all characters numeric; replaced as int
num_25_to_29_pacif_female_2016: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2016: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2016: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2016: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2016: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2016: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2016: all characters numeric; replaced as byte
num_over_85_pacif_female_2016: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2016.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(534 real changes made)
(534 real changes made)
(481 real changes made)
(481 real changes made)
(482 real changes made)
(484 real changes made)
(475 real changes made)
(492 real changes made)
(492 real changes made)
(497 real changes made)
(518 real changes made)
(514 real changes made)
(521 real changes made)
(515 real changes made)
(508 real changes made)
(461 real changes made)
(534 real changes made)
(534 real changes made)
(479 real changes made)
(489 real changes made)
(485 real changes made)
(481 real changes made)
(463 real changes made)
(498 real changes made)
(491 real changes made)
(499 real changes made)
(513 real changes made)
(519 real changes made)
(511 real changes made)
(515 real changes made)
(504 real changes made)
(481 real changes made)
(436 real changes made)
(436 real changes made)
(175 real changes made)
(193 real changes made)
(202 real changes made)
(195 real changes made)
(181 real changes made)
(245 real changes made)
(199 real changes made)
(206 real changes made)
(288 real changes made)
(295 real changes made)
(262 real changes made)
(205 real changes made)
(120 real changes made)
(62 real changes made)
(427 real changes made)
(427 real changes made)
(175 real changes made)
(187 real changes made)
(210 real changes made)
(175 real changes made)
(157 real changes made)
(226 real changes made)
(198 real changes made)
(199 real changes made)
(245 real changes made)
(252 real changes made)
(234 real changes made)
(190 real changes made)
(149 real changes made)
(86 real changes made)
(400 real changes made)
(400 real changes made)
(205 real changes made)
(208 real changes made)
(203 real changes made)
(181 real changes made)
(152 real changes made)
(208 real changes made)
(199 real changes made)
(222 real changes made)
(284 real changes made)
(288 real changes made)
(258 real changes made)
(197 real changes made)
(132 real changes made)
(62 real changes made)
(440 real changes made)
(440 real changes made)
(205 real changes made)
(215 real changes made)
(247 real changes made)
(199 real changes made)
(157 real changes made)
(205 real changes made)
(222 real changes made)
(262 real changes made)
(327 real changes made)
(294 real changes made)
(279 real changes made)
(230 real changes made)
(153 real changes made)
(76 real changes made)
(187 real changes made)
(187 real changes made)
(22 real changes made)
(27 real changes made)
(27 real changes made)
(19 real changes made)
(17 real changes made)
(38 real changes made)
(33 real changes made)
(24 real changes made)
(52 real changes made)
(74 real changes made)
(54 real changes made)
(32 real changes made)
(11 real changes made)
(5 real changes made)
(196 real changes made)
(196 real changes made)
(20 real changes made)
(27 real changes made)
(32 real changes made)
(17 real changes made)
(22 real changes made)
(31 real changes made)
(29 real changes made)
(29 real changes made)
(47 real changes made)
(67 real changes made)
(61 real changes made)
(37 real changes made)
(13 real changes made)
(7 real changes made)
(52 real changes made)
(52 real changes made)
(3 real changes made)
(6 real changes made)
(3 real changes made)
(4 real changes made)
(5 real changes made)
(7 real changes made)
(2 real changes made)
(6 real changes made)
(10 real changes made)
(11 real changes made)
(3 real changes made)
(6 real changes made)
(2 real changes made)
(1 real change made)
(57 real changes made)
(57 real changes made)
(1 real change made)
(6 real changes made)
(4 real changes made)
(3 real changes made)
(4 real changes made)
(11 real changes made)
(10 real changes made)
(5 real changes made)
(5 real changes made)
(6 real changes made)
(7 real changes made)
(4 real changes made)
(4 real changes made)
(1 real change made)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2016.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2017: all characters numeric; replaced as int
num_under_5_white_male_2017: all characters numeric; replaced as int
num_5_to_9_white_male_2017: all characters numeric; replaced as int
num_10_to_14_white_male_2017: all characters numeric; replaced as int
num_15_to_17_white_male_2017: all characters numeric; replaced as int
num_18_to_19_white_male_2017: all characters numeric; replaced as int
num_20_to_24_white_male_2017: all characters numeric; replaced as int
num_25_to_29_white_male_2017: all characters numeric; replaced as int
num_30_to_34_white_male_2017: all characters numeric; replaced as int
num_35_to_44_white_male_2017: all characters numeric; replaced as int
num_45_to_54_white_male_2017: all characters numeric; replaced as int
num_55_to_64_white_male_2017: all characters numeric; replaced as int
num_65_to_74_white_male_2017: all characters numeric; replaced as int
num_75_to_84_white_male_2017: all characters numeric; replaced as int
num_over_85_white_male_2017: all characters numeric; replaced as int
tot_white_female_2017: all characters numeric; replaced as int
num_under_5_white_female_2017: all characters numeric; replaced as int
num_5_to_9_white_female_2017: all characters numeric; replaced as int
num_10_to_14_white_female_2017: all characters numeric; replaced as int
num_15_to_17_white_female_2017: all characters numeric; replaced as int
num_18_to_19_white_female_2017: all characters numeric; replaced as int
num_20_to_24_white_female_2017: all characters numeric; replaced as int
num_25_to_29_white_female_2017: all characters numeric; replaced as int
num_30_to_34_white_female_2017: all characters numeric; replaced as int
num_35_to_44_white_female_2017: all characters numeric; replaced as int
num_45_to_54_white_female_2017: all characters numeric; replaced as int
num_55_to_64_white_female_2017: all characters numeric; replaced as int
num_65_to_74_white_female_2017: all characters numeric; replaced as int
num_75_to_84_white_female_2017: all characters numeric; replaced as int
num_over_85_white_female_2017: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2017.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2017: all characters numeric; replaced as int
num_under_5_black_male_2017: all characters numeric; replaced as int
num_5_to_9_black_male_2017: all characters numeric; replaced as int
num_10_to_14_black_male_2017: all characters numeric; replaced as int
num_15_to_17_black_male_2017: all characters numeric; replaced as int
num_18_to_19_black_male_2017: all characters numeric; replaced as int
num_20_to_24_black_male_2017: all characters numeric; replaced as int
num_25_to_29_black_male_2017: all characters numeric; replaced as int
num_30_to_34_black_male_2017: all characters numeric; replaced as int
num_35_to_44_black_male_2017: all characters numeric; replaced as int
num_45_to_54_black_male_2017: all characters numeric; replaced as int
num_55_to_64_black_male_2017: all characters numeric; replaced as int
num_65_to_74_black_male_2017: all characters numeric; replaced as int
num_75_to_84_black_male_2017: all characters numeric; replaced as int
num_over_85_black_male_2017: all characters numeric; replaced as int
tot_black_female_2017: all characters numeric; replaced as int
num_under_5_black_female_2017: all characters numeric; replaced as int
num_5_to_9_black_female_2017: all characters numeric; replaced as int
num_10_to_14_black_female_2017: all characters numeric; replaced as int
num_15_to_17_black_female_2017: all characters numeric; replaced as int
num_18_to_19_black_female_2017: all characters numeric; replaced as int
num_20_to_24_black_female_2017: all characters numeric; replaced as int
num_25_to_29_black_female_2017: all characters numeric; replaced as int
num_30_to_34_black_female_2017: all characters numeric; replaced as int
num_35_to_44_black_female_2017: all characters numeric; replaced as int
num_45_to_54_black_female_2017: all characters numeric; replaced as int
num_55_to_64_black_female_2017: all characters numeric; replaced as int
num_65_to_74_black_female_2017: all characters numeric; replaced as int
num_75_to_84_black_female_2017: all characters numeric; replaced as int
num_over_85_black_female_2017: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2017.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2017: all characters numeric; replaced as int
num_under_5_asian_male_2017: all characters numeric; replaced as int
num_5_to_9_asian_male_2017: all characters numeric; replaced as int
num_10_to_14_asian_male_2017: all characters numeric; replaced as int
num_15_to_17_asian_male_2017: all characters numeric; replaced as int
num_18_to_19_asian_male_2017: all characters numeric; replaced as int
num_20_to_24_asian_male_2017: all characters numeric; replaced as int
num_25_to_29_asian_male_2017: all characters numeric; replaced as int
num_30_to_34_asian_male_2017: all characters numeric; replaced as int
num_35_to_44_asian_male_2017: all characters numeric; replaced as int
num_45_to_54_asian_male_2017: all characters numeric; replaced as int
num_55_to_64_asian_male_2017: all characters numeric; replaced as int
num_65_to_74_asian_male_2017: all characters numeric; replaced as int
num_75_to_84_asian_male_2017: all characters numeric; replaced as int
num_over_85_asian_male_2017: all characters numeric; replaced as int
tot_asian_female_2017: all characters numeric; replaced as int
num_under_5_asian_female_2017: all characters numeric; replaced as int
num_5_to_9_asian_female_2017: all characters numeric; replaced as int
num_10_to_14_asian_female_2017: all characters numeric; replaced as int
num_15_to_17_asian_female_2017: all characters numeric; replaced as int
num_18_to_19_asian_female_2017: all characters numeric; replaced as int
num_20_to_24_asian_female_2017: all characters numeric; replaced as int
num_25_to_29_asian_female_2017: all characters numeric; replaced as int
num_30_to_34_asian_female_2017: all characters numeric; replaced as int
num_35_to_44_asian_female_2017: all characters numeric; replaced as int
num_45_to_54_asian_female_2017: all characters numeric; replaced as int
num_55_to_64_asian_female_2017: all characters numeric; replaced as int
num_65_to_74_asian_female_2017: all characters numeric; replaced as int
num_75_to_84_asian_female_2017: all characters numeric; replaced as int
num_over_85_asian_female_2017: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2017.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2017: all characters numeric; replaced as int
num_under_5_amind_male_2017: all characters numeric; replaced as byte
num_5_to_9_amind_male_2017: all characters numeric; replaced as byte
num_10_to_14_amind_male_2017: all characters numeric; replaced as byte
num_15_to_17_amind_male_2017: all characters numeric; replaced as int
num_18_to_19_amind_male_2017: all characters numeric; replaced as byte
num_20_to_24_amind_male_2017: all characters numeric; replaced as byte
num_25_to_29_amind_male_2017: all characters numeric; replaced as byte
num_30_to_34_amind_male_2017: all characters numeric; replaced as byte
num_35_to_44_amind_male_2017: all characters numeric; replaced as byte
num_45_to_54_amind_male_2017: all characters numeric; replaced as byte
num_55_to_64_amind_male_2017: all characters numeric; replaced as byte
num_65_to_74_amind_male_2017: all characters numeric; replaced as byte
num_75_to_84_amind_male_2017: all characters numeric; replaced as byte
num_over_85_amind_male_2017: all characters numeric; replaced as byte
tot_amind_female_2017: all characters numeric; replaced as int
num_under_5_amind_female_2017: all characters numeric; replaced as byte
num_5_to_9_amind_female_2017: all characters numeric; replaced as byte
num_10_to_14_amind_female_2017: all characters numeric; replaced as byte
num_15_to_17_amind_female_2017: all characters numeric; replaced as byte
num_18_to_19_amind_female_2017: all characters numeric; replaced as byte
num_20_to_24_amind_female_2017: all characters numeric; replaced as int
num_25_to_29_amind_female_2017: all characters numeric; replaced as byte
num_30_to_34_amind_female_2017: all characters numeric; replaced as byte
num_35_to_44_amind_female_2017: all characters numeric; replaced as byte
num_45_to_54_amind_female_2017: all characters numeric; replaced as byte
num_55_to_64_amind_female_2017: all characters numeric; replaced as byte
num_65_to_74_amind_female_2017: all characters numeric; replaced as byte
num_75_to_84_amind_female_2017: all characters numeric; replaced as byte
num_over_85_amind_female_2017: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2017.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2017: all characters numeric; replaced as int
num_under_5_pacif_male_2017: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2017: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2017: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2017: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2017: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2017: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2017: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2017: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2017: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2017: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2017: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2017: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2017: all characters numeric; replaced as byte
num_over_85_pacif_male_2017: all characters numeric; replaced as byte
tot_pacif_female_2017: all characters numeric; replaced as int
num_under_5_pacif_female_2017: all characters numeric; replaced as byte
num_5_to_9_pacif_female_2017: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2017: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2017: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2017: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2017: all characters numeric; replaced as int
num_25_to_29_pacif_female_2017: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2017: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2017: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2017: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2017: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2017: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2017: all characters numeric; replaced as byte
num_over_85_pacif_female_2017: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2017.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(534 real changes made)
(534 real changes made)
(483 real changes made)
(487 real changes made)
(485 real changes made)
(481 real changes made)
(467 real changes made)
(492 real changes made)
(494 real changes made)
(493 real changes made)
(516 real changes made)
(514 real changes made)
(520 real changes made)
(517 real changes made)
(505 real changes made)
(459 real changes made)
(532 real changes made)
(532 real changes made)
(483 real changes made)
(484 real changes made)
(482 real changes made)
(476 real changes made)
(465 real changes made)
(497 real changes made)
(488 real changes made)
(497 real changes made)
(512 real changes made)
(516 real changes made)
(513 real changes made)
(511 real changes made)
(504 real changes made)
(486 real changes made)
(439 real changes made)
(439 real changes made)
(179 real changes made)
(185 real changes made)
(208 real changes made)
(183 real changes made)
(184 real changes made)
(240 real changes made)
(202 real changes made)
(210 real changes made)
(297 real changes made)
(286 real changes made)
(267 real changes made)
(204 real changes made)
(127 real changes made)
(65 real changes made)
(421 real changes made)
(421 real changes made)
(176 real changes made)
(187 real changes made)
(213 real changes made)
(170 real changes made)
(147 real changes made)
(221 real changes made)
(199 real changes made)
(205 real changes made)
(243 real changes made)
(252 real changes made)
(248 real changes made)
(195 real changes made)
(156 real changes made)
(81 real changes made)
(410 real changes made)
(410 real changes made)
(197 real changes made)
(212 real changes made)
(198 real changes made)
(185 real changes made)
(144 real changes made)
(205 real changes made)
(203 real changes made)
(215 real changes made)
(287 real changes made)
(291 real changes made)
(265 real changes made)
(203 real changes made)
(133 real changes made)
(66 real changes made)
(437 real changes made)
(437 real changes made)
(200 real changes made)
(211 real changes made)
(237 real changes made)
(210 real changes made)
(158 real changes made)
(209 real changes made)
(231 real changes made)
(258 real changes made)
(324 real changes made)
(304 real changes made)
(287 real changes made)
(231 real changes made)
(163 real changes made)
(71 real changes made)
(182 real changes made)
(182 real changes made)
(23 real changes made)
(31 real changes made)
(24 real changes made)
(19 real changes made)
(19 real changes made)
(33 real changes made)
(30 real changes made)
(24 real changes made)
(50 real changes made)
(70 real changes made)
(54 real changes made)
(31 real changes made)
(9 real changes made)
(4 real changes made)
(176 real changes made)
(176 real changes made)
(21 real changes made)
(28 real changes made)
(34 real changes made)
(15 real changes made)
(18 real changes made)
(31 real changes made)
(31 real changes made)
(29 real changes made)
(42 real changes made)
(59 real changes made)
(59 real changes made)
(39 real changes made)
(12 real changes made)
(5 real changes made)
(49 real changes made)
(49 real changes made)
(3 real changes made)
(6 real changes made)
(4 real changes made)
(4 real changes made)
(5 real changes made)
(8 real changes made)
(2 real changes made)
(6 real changes made)
(11 real changes made)
(10 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(61 real changes made)
(61 real changes made)
(2 real changes made)
(5 real changes made)
(4 real changes made)
(3 real changes made)
(9 real changes made)
(11 real changes made)
(9 real changes made)
(6 real changes made)
(5 real changes made)
(6 real changes made)
(7 real changes made)
(4 real changes made)
(3 real changes made)
(1 real change made)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2017.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2018: all characters numeric; replaced as int
num_under_5_white_male_2018: all characters numeric; replaced as int
num_5_to_9_white_male_2018: all characters numeric; replaced as int
num_10_to_14_white_male_2018: all characters numeric; replaced as int
num_15_to_17_white_male_2018: all characters numeric; replaced as int
num_18_to_19_white_male_2018: all characters numeric; replaced as int
num_20_to_24_white_male_2018: all characters numeric; replaced as int
num_25_to_29_white_male_2018: all characters numeric; replaced as int
num_30_to_34_white_male_2018: all characters numeric; replaced as int
num_35_to_44_white_male_2018: all characters numeric; replaced as int
num_45_to_54_white_male_2018: all characters numeric; replaced as int
num_55_to_64_white_male_2018: all characters numeric; replaced as int
num_65_to_74_white_male_2018: all characters numeric; replaced as int
num_75_to_84_white_male_2018: all characters numeric; replaced as int
num_over_85_white_male_2018: all characters numeric; replaced as int
tot_white_female_2018: all characters numeric; replaced as int
num_under_5_white_female_2018: all characters numeric; replaced as int
num_5_to_9_white_female_2018: all characters numeric; replaced as int
num_10_to_14_white_female_2018: all characters numeric; replaced as int
num_15_to_17_white_female_2018: all characters numeric; replaced as int
num_18_to_19_white_female_2018: all characters numeric; replaced as int
num_20_to_24_white_female_2018: all characters numeric; replaced as int
num_25_to_29_white_female_2018: all characters numeric; replaced as int
num_30_to_34_white_female_2018: all characters numeric; replaced as int
num_35_to_44_white_female_2018: all characters numeric; replaced as int
num_45_to_54_white_female_2018: all characters numeric; replaced as int
num_55_to_64_white_female_2018: all characters numeric; replaced as int
num_65_to_74_white_female_2018: all characters numeric; replaced as int
num_75_to_84_white_female_2018: all characters numeric; replaced as int
num_over_85_white_female_2018: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2018.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2018: all characters numeric; replaced as int
num_under_5_black_male_2018: all characters numeric; replaced as int
num_5_to_9_black_male_2018: all characters numeric; replaced as int
num_10_to_14_black_male_2018: all characters numeric; replaced as int
num_15_to_17_black_male_2018: all characters numeric; replaced as int
num_18_to_19_black_male_2018: all characters numeric; replaced as int
num_20_to_24_black_male_2018: all characters numeric; replaced as int
num_25_to_29_black_male_2018: all characters numeric; replaced as int
num_30_to_34_black_male_2018: all characters numeric; replaced as int
num_35_to_44_black_male_2018: all characters numeric; replaced as int
num_45_to_54_black_male_2018: all characters numeric; replaced as int
num_55_to_64_black_male_2018: all characters numeric; replaced as int
num_65_to_74_black_male_2018: all characters numeric; replaced as int
num_75_to_84_black_male_2018: all characters numeric; replaced as int
num_over_85_black_male_2018: all characters numeric; replaced as int
tot_black_female_2018: all characters numeric; replaced as int
num_under_5_black_female_2018: all characters numeric; replaced as int
num_5_to_9_black_female_2018: all characters numeric; replaced as int
num_10_to_14_black_female_2018: all characters numeric; replaced as int
num_15_to_17_black_female_2018: all characters numeric; replaced as int
num_18_to_19_black_female_2018: all characters numeric; replaced as int
num_20_to_24_black_female_2018: all characters numeric; replaced as int
num_25_to_29_black_female_2018: all characters numeric; replaced as int
num_30_to_34_black_female_2018: all characters numeric; replaced as int
num_35_to_44_black_female_2018: all characters numeric; replaced as int
num_45_to_54_black_female_2018: all characters numeric; replaced as int
num_55_to_64_black_female_2018: all characters numeric; replaced as int
num_65_to_74_black_female_2018: all characters numeric; replaced as int
num_75_to_84_black_female_2018: all characters numeric; replaced as int
num_over_85_black_female_2018: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2018.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2018: all characters numeric; replaced as int
num_under_5_asian_male_2018: all characters numeric; replaced as int
num_5_to_9_asian_male_2018: all characters numeric; replaced as int
num_10_to_14_asian_male_2018: all characters numeric; replaced as int
num_15_to_17_asian_male_2018: all characters numeric; replaced as int
num_18_to_19_asian_male_2018: all characters numeric; replaced as int
num_20_to_24_asian_male_2018: all characters numeric; replaced as int
num_25_to_29_asian_male_2018: all characters numeric; replaced as int
num_30_to_34_asian_male_2018: all characters numeric; replaced as int
num_35_to_44_asian_male_2018: all characters numeric; replaced as int
num_45_to_54_asian_male_2018: all characters numeric; replaced as int
num_55_to_64_asian_male_2018: all characters numeric; replaced as int
num_65_to_74_asian_male_2018: all characters numeric; replaced as int
num_75_to_84_asian_male_2018: all characters numeric; replaced as int
num_over_85_asian_male_2018: all characters numeric; replaced as int
tot_asian_female_2018: all characters numeric; replaced as int
num_under_5_asian_female_2018: all characters numeric; replaced as int
num_5_to_9_asian_female_2018: all characters numeric; replaced as int
num_10_to_14_asian_female_2018: all characters numeric; replaced as int
num_15_to_17_asian_female_2018: all characters numeric; replaced as int
num_18_to_19_asian_female_2018: all characters numeric; replaced as int
num_20_to_24_asian_female_2018: all characters numeric; replaced as int
num_25_to_29_asian_female_2018: all characters numeric; replaced as int
num_30_to_34_asian_female_2018: all characters numeric; replaced as int
num_35_to_44_asian_female_2018: all characters numeric; replaced as int
num_45_to_54_asian_female_2018: all characters numeric; replaced as int
num_55_to_64_asian_female_2018: all characters numeric; replaced as int
num_65_to_74_asian_female_2018: all characters numeric; replaced as int
num_75_to_84_asian_female_2018: all characters numeric; replaced as int
num_over_85_asian_female_2018: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2018.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2018: all characters numeric; replaced as int
num_under_5_amind_male_2018: all characters numeric; replaced as byte
num_5_to_9_amind_male_2018: all characters numeric; replaced as byte
num_10_to_14_amind_male_2018: all characters numeric; replaced as int
num_15_to_17_amind_male_2018: all characters numeric; replaced as int
num_18_to_19_amind_male_2018: all characters numeric; replaced as byte
num_20_to_24_amind_male_2018: all characters numeric; replaced as byte
num_25_to_29_amind_male_2018: all characters numeric; replaced as int
num_30_to_34_amind_male_2018: all characters numeric; replaced as byte
num_35_to_44_amind_male_2018: all characters numeric; replaced as byte
num_45_to_54_amind_male_2018: all characters numeric; replaced as byte
num_55_to_64_amind_male_2018: all characters numeric; replaced as byte
num_65_to_74_amind_male_2018: all characters numeric; replaced as byte
num_75_to_84_amind_male_2018: all characters numeric; replaced as byte
num_over_85_amind_male_2018: all characters numeric; replaced as byte
tot_amind_female_2018: all characters numeric; replaced as int
num_under_5_amind_female_2018: all characters numeric; replaced as int
num_5_to_9_amind_female_2018: all characters numeric; replaced as byte
num_10_to_14_amind_female_2018: all characters numeric; replaced as byte
num_15_to_17_amind_female_2018: all characters numeric; replaced as byte
num_18_to_19_amind_female_2018: all characters numeric; replaced as byte
num_20_to_24_amind_female_2018: all characters numeric; replaced as byte
num_25_to_29_amind_female_2018: all characters numeric; replaced as byte
num_30_to_34_amind_female_2018: all characters numeric; replaced as byte
num_35_to_44_amind_female_2018: all characters numeric; replaced as int
num_45_to_54_amind_female_2018: all characters numeric; replaced as byte
num_55_to_64_amind_female_2018: all characters numeric; replaced as byte
num_65_to_74_amind_female_2018: all characters numeric; replaced as byte
num_75_to_84_amind_female_2018: all characters numeric; replaced as byte
num_over_85_amind_female_2018: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2018.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2018: all characters numeric; replaced as int
num_under_5_pacif_male_2018: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2018: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2018: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2018: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2018: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2018: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2018: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2018: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2018: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2018: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2018: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2018: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2018: all characters numeric; replaced as byte
num_over_85_pacif_male_2018: all characters numeric; replaced as byte
tot_pacif_female_2018: all characters numeric; replaced as int
num_under_5_pacif_female_2018: all characters numeric; replaced as byte
num_5_to_9_pacif_female_2018: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2018: all characters numeric; replaced as int
num_15_to_17_pacif_female_2018: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2018: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2018: all characters numeric; replaced as byte
num_25_to_29_pacif_female_2018: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2018: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2018: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2018: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2018: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2018: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2018: all characters numeric; replaced as byte
num_over_85_pacif_female_2018: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2018.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(534 real changes made)
(534 real changes made)
(480 real changes made)
(482 real changes made)
(485 real changes made)
(481 real changes made)
(466 real changes made)
(491 real changes made)
(495 real changes made)
(495 real changes made)
(517 real changes made)
(514 real changes made)
(517 real changes made)
(517 real changes made)
(506 real changes made)
(457 real changes made)
(532 real changes made)
(532 real changes made)
(483 real changes made)
(487 real changes made)
(484 real changes made)
(474 real changes made)
(464 real changes made)
(494 real changes made)
(487 real changes made)
(500 real changes made)
(510 real changes made)
(515 real changes made)
(513 real changes made)
(511 real changes made)
(504 real changes made)
(484 real changes made)
(438 real changes made)
(438 real changes made)
(179 real changes made)
(183 real changes made)
(220 real changes made)
(185 real changes made)
(187 real changes made)
(245 real changes made)
(212 real changes made)
(219 real changes made)
(304 real changes made)
(285 real changes made)
(268 real changes made)
(209 real changes made)
(125 real changes made)
(58 real changes made)
(421 real changes made)
(421 real changes made)
(170 real changes made)
(187 real changes made)
(220 real changes made)
(175 real changes made)
(148 real changes made)
(211 real changes made)
(195 real changes made)
(213 real changes made)
(251 real changes made)
(265 real changes made)
(247 real changes made)
(198 real changes made)
(152 real changes made)
(87 real changes made)
(403 real changes made)
(403 real changes made)
(193 real changes made)
(203 real changes made)
(200 real changes made)
(186 real changes made)
(147 real changes made)
(200 real changes made)
(207 real changes made)
(212 real changes made)
(287 real changes made)
(286 real changes made)
(260 real changes made)
(209 real changes made)
(128 real changes made)
(66 real changes made)
(434 real changes made)
(434 real changes made)
(197 real changes made)
(207 real changes made)
(220 real changes made)
(200 real changes made)
(152 real changes made)
(206 real changes made)
(233 real changes made)
(251 real changes made)
(324 real changes made)
(308 real changes made)
(282 real changes made)
(229 real changes made)
(169 real changes made)
(80 real changes made)
(183 real changes made)
(183 real changes made)
(22 real changes made)
(32 real changes made)
(24 real changes made)
(17 real changes made)
(20 real changes made)
(34 real changes made)
(26 real changes made)
(20 real changes made)
(49 real changes made)
(69 real changes made)
(48 real changes made)
(32 real changes made)
(11 real changes made)
(4 real changes made)
(183 real changes made)
(183 real changes made)
(15 real changes made)
(22 real changes made)
(29 real changes made)
(15 real changes made)
(18 real changes made)
(27 real changes made)
(31 real changes made)
(30 real changes made)
(44 real changes made)
(56 real changes made)
(53 real changes made)
(39 real changes made)
(12 real changes made)
(12 real changes made)
(53 real changes made)
(53 real changes made)
(4 real changes made)
(6 real changes made)
(4 real changes made)
(2 real changes made)
(5 real changes made)
(7 real changes made)
(4 real changes made)
(5 real changes made)
(11 real changes made)
(10 real changes made)
(5 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(64 real changes made)
(64 real changes made)
(5 real changes made)
(4 real changes made)
(4 real changes made)
(1 real change made)
(9 real changes made)
(11 real changes made)
(11 real changes made)
(11 real changes made)
(4 real changes made)
(7 real changes made)
(8 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2018.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2019: all characters numeric; replaced as int
num_under_5_white_male_2019: all characters numeric; replaced as int
num_5_to_9_white_male_2019: all characters numeric; replaced as int
num_10_to_14_white_male_2019: all characters numeric; replaced as int
num_15_to_17_white_male_2019: all characters numeric; replaced as int
num_18_to_19_white_male_2019: all characters numeric; replaced as int
num_20_to_24_white_male_2019: all characters numeric; replaced as int
num_25_to_29_white_male_2019: all characters numeric; replaced as int
num_30_to_34_white_male_2019: all characters numeric; replaced as int
num_35_to_44_white_male_2019: all characters numeric; replaced as int
num_45_to_54_white_male_2019: all characters numeric; replaced as int
num_55_to_64_white_male_2019: all characters numeric; replaced as int
num_65_to_74_white_male_2019: all characters numeric; replaced as int
num_75_to_84_white_male_2019: all characters numeric; replaced as int
num_over_85_white_male_2019: all characters numeric; replaced as int
tot_white_female_2019: all characters numeric; replaced as int
num_under_5_white_female_2019: all characters numeric; replaced as int
num_5_to_9_white_female_2019: all characters numeric; replaced as int
num_10_to_14_white_female_2019: all characters numeric; replaced as int
num_15_to_17_white_female_2019: all characters numeric; replaced as int
num_18_to_19_white_female_2019: all characters numeric; replaced as int
num_20_to_24_white_female_2019: all characters numeric; replaced as int
num_25_to_29_white_female_2019: all characters numeric; replaced as int
num_30_to_34_white_female_2019: all characters numeric; replaced as int
num_35_to_44_white_female_2019: all characters numeric; replaced as int
num_45_to_54_white_female_2019: all characters numeric; replaced as int
num_55_to_64_white_female_2019: all characters numeric; replaced as int
num_65_to_74_white_female_2019: all characters numeric; replaced as int
num_75_to_84_white_female_2019: all characters numeric; replaced as int
num_over_85_white_female_2019: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2019.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2019: all characters numeric; replaced as int
num_under_5_black_male_2019: all characters numeric; replaced as int
num_5_to_9_black_male_2019: all characters numeric; replaced as int
num_10_to_14_black_male_2019: all characters numeric; replaced as int
num_15_to_17_black_male_2019: all characters numeric; replaced as int
num_18_to_19_black_male_2019: all characters numeric; replaced as int
num_20_to_24_black_male_2019: all characters numeric; replaced as int
num_25_to_29_black_male_2019: all characters numeric; replaced as int
num_30_to_34_black_male_2019: all characters numeric; replaced as int
num_35_to_44_black_male_2019: all characters numeric; replaced as int
num_45_to_54_black_male_2019: all characters numeric; replaced as int
num_55_to_64_black_male_2019: all characters numeric; replaced as int
num_65_to_74_black_male_2019: all characters numeric; replaced as int
num_75_to_84_black_male_2019: all characters numeric; replaced as int
num_over_85_black_male_2019: all characters numeric; replaced as int
tot_black_female_2019: all characters numeric; replaced as int
num_under_5_black_female_2019: all characters numeric; replaced as int
num_5_to_9_black_female_2019: all characters numeric; replaced as int
num_10_to_14_black_female_2019: all characters numeric; replaced as int
num_15_to_17_black_female_2019: all characters numeric; replaced as int
num_18_to_19_black_female_2019: all characters numeric; replaced as int
num_20_to_24_black_female_2019: all characters numeric; replaced as int
num_25_to_29_black_female_2019: all characters numeric; replaced as int
num_30_to_34_black_female_2019: all characters numeric; replaced as int
num_35_to_44_black_female_2019: all characters numeric; replaced as int
num_45_to_54_black_female_2019: all characters numeric; replaced as int
num_55_to_64_black_female_2019: all characters numeric; replaced as int
num_65_to_74_black_female_2019: all characters numeric; replaced as int
num_75_to_84_black_female_2019: all characters numeric; replaced as int
num_over_85_black_female_2019: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2019.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2019: all characters numeric; replaced as int
num_under_5_asian_male_2019: all characters numeric; replaced as int
num_5_to_9_asian_male_2019: all characters numeric; replaced as int
num_10_to_14_asian_male_2019: all characters numeric; replaced as int
num_15_to_17_asian_male_2019: all characters numeric; replaced as int
num_18_to_19_asian_male_2019: all characters numeric; replaced as int
num_20_to_24_asian_male_2019: all characters numeric; replaced as int
num_25_to_29_asian_male_2019: all characters numeric; replaced as int
num_30_to_34_asian_male_2019: all characters numeric; replaced as int
num_35_to_44_asian_male_2019: all characters numeric; replaced as int
num_45_to_54_asian_male_2019: all characters numeric; replaced as int
num_55_to_64_asian_male_2019: all characters numeric; replaced as int
num_65_to_74_asian_male_2019: all characters numeric; replaced as int
num_75_to_84_asian_male_2019: all characters numeric; replaced as int
num_over_85_asian_male_2019: all characters numeric; replaced as int
tot_asian_female_2019: all characters numeric; replaced as int
num_under_5_asian_female_2019: all characters numeric; replaced as int
num_5_to_9_asian_female_2019: all characters numeric; replaced as int
num_10_to_14_asian_female_2019: all characters numeric; replaced as int
num_15_to_17_asian_female_2019: all characters numeric; replaced as int
num_18_to_19_asian_female_2019: all characters numeric; replaced as int
num_20_to_24_asian_female_2019: all characters numeric; replaced as int
num_25_to_29_asian_female_2019: all characters numeric; replaced as int
num_30_to_34_asian_female_2019: all characters numeric; replaced as int
num_35_to_44_asian_female_2019: all characters numeric; replaced as int
num_45_to_54_asian_female_2019: all characters numeric; replaced as int
num_55_to_64_asian_female_2019: all characters numeric; replaced as int
num_65_to_74_asian_female_2019: all characters numeric; replaced as int
num_75_to_84_asian_female_2019: all characters numeric; replaced as int
num_over_85_asian_female_2019: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2019.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2019: all characters numeric; replaced as int
num_under_5_amind_male_2019: all characters numeric; replaced as byte
num_5_to_9_amind_male_2019: all characters numeric; replaced as byte
num_10_to_14_amind_male_2019: all characters numeric; replaced as byte
num_15_to_17_amind_male_2019: all characters numeric; replaced as int
num_18_to_19_amind_male_2019: all characters numeric; replaced as byte
num_20_to_24_amind_male_2019: all characters numeric; replaced as int
num_25_to_29_amind_male_2019: all characters numeric; replaced as int
num_30_to_34_amind_male_2019: all characters numeric; replaced as byte
num_35_to_44_amind_male_2019: all characters numeric; replaced as byte
num_45_to_54_amind_male_2019: all characters numeric; replaced as int
num_55_to_64_amind_male_2019: all characters numeric; replaced as byte
num_65_to_74_amind_male_2019: all characters numeric; replaced as byte
num_75_to_84_amind_male_2019: all characters numeric; replaced as byte
num_over_85_amind_male_2019: all characters numeric; replaced as byte
tot_amind_female_2019: all characters numeric; replaced as int
num_under_5_amind_female_2019: all characters numeric; replaced as int
num_5_to_9_amind_female_2019: all characters numeric; replaced as byte
num_10_to_14_amind_female_2019: all characters numeric; replaced as byte
num_15_to_17_amind_female_2019: all characters numeric; replaced as byte
num_18_to_19_amind_female_2019: all characters numeric; replaced as byte
num_20_to_24_amind_female_2019: all characters numeric; replaced as byte
num_25_to_29_amind_female_2019: all characters numeric; replaced as byte
num_30_to_34_amind_female_2019: all characters numeric; replaced as byte
num_35_to_44_amind_female_2019: all characters numeric; replaced as int
num_45_to_54_amind_female_2019: all characters numeric; replaced as byte
num_55_to_64_amind_female_2019: all characters numeric; replaced as int
num_65_to_74_amind_female_2019: all characters numeric; replaced as byte
num_75_to_84_amind_female_2019: all characters numeric; replaced as byte
num_over_85_amind_female_2019: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2019.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2019: all characters numeric; replaced as byte
num_under_5_pacif_male_2019: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2019: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2019: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2019: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2019: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2019: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2019: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2019: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2019: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2019: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2019: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2019: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2019: all characters numeric; replaced as byte
num_over_85_pacif_male_2019: all characters numeric; replaced as byte
tot_pacif_female_2019: all characters numeric; replaced as int
num_under_5_pacif_female_2019: all characters numeric; replaced as byte
num_5_to_9_pacif_female_2019: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2019: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2019: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2019: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2019: all characters numeric; replaced as int
num_25_to_29_pacif_female_2019: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2019: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2019: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2019: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2019: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2019: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2019: all characters numeric; replaced as byte
num_over_85_pacif_female_2019: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2019.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(534 real changes made)
(534 real changes made)
(477 real changes made)
(485 real changes made)
(484 real changes made)
(481 real changes made)
(464 real changes made)
(493 real changes made)
(497 real changes made)
(497 real changes made)
(511 real changes made)
(512 real changes made)
(520 real changes made)
(516 real changes made)
(504 real changes made)
(463 real changes made)
(533 real changes made)
(533 real changes made)
(477 real changes made)
(479 real changes made)
(484 real changes made)
(471 real changes made)
(456 real changes made)
(493 real changes made)
(487 real changes made)
(500 real changes made)
(513 real changes made)
(513 real changes made)
(516 real changes made)
(510 real changes made)
(500 real changes made)
(487 real changes made)
(432 real changes made)
(432 real changes made)
(168 real changes made)
(175 real changes made)
(210 real changes made)
(193 real changes made)
(190 real changes made)
(240 real changes made)
(212 real changes made)
(217 real changes made)
(294 real changes made)
(274 real changes made)
(265 real changes made)
(214 real changes made)
(130 real changes made)
(72 real changes made)
(420 real changes made)
(420 real changes made)
(164 real changes made)
(181 real changes made)
(210 real changes made)
(171 real changes made)
(148 real changes made)
(208 real changes made)
(191 real changes made)
(212 real changes made)
(257 real changes made)
(256 real changes made)
(244 real changes made)
(201 real changes made)
(148 real changes made)
(93 real changes made)
(409 real changes made)
(409 real changes made)
(198 real changes made)
(202 real changes made)
(206 real changes made)
(177 real changes made)
(140 real changes made)
(199 real changes made)
(201 real changes made)
(213 real changes made)
(292 real changes made)
(283 real changes made)
(257 real changes made)
(210 real changes made)
(134 real changes made)
(68 real changes made)
(428 real changes made)
(428 real changes made)
(194 real changes made)
(195 real changes made)
(214 real changes made)
(202 real changes made)
(163 real changes made)
(207 real changes made)
(228 real changes made)
(243 real changes made)
(323 real changes made)
(305 real changes made)
(286 real changes made)
(230 real changes made)
(157 real changes made)
(84 real changes made)
(191 real changes made)
(191 real changes made)
(18 real changes made)
(26 real changes made)
(23 real changes made)
(15 real changes made)
(19 real changes made)
(33 real changes made)
(27 real changes made)
(20 real changes made)
(47 real changes made)
(65 real changes made)
(41 real changes made)
(35 real changes made)
(15 real changes made)
(4 real changes made)
(188 real changes made)
(188 real changes made)
(16 real changes made)
(21 real changes made)
(27 real changes made)
(15 real changes made)
(17 real changes made)
(29 real changes made)
(27 real changes made)
(24 real changes made)
(42 real changes made)
(61 real changes made)
(55 real changes made)
(33 real changes made)
(13 real changes made)
(13 real changes made)
(56 real changes made)
(56 real changes made)
(5 real changes made)
(5 real changes made)
(5 real changes made)
(2 real changes made)
(4 real changes made)
(8 real changes made)
(6 real changes made)
(6 real changes made)
(9 real changes made)
(11 real changes made)
(8 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(69 real changes made)
(69 real changes made)
(6 real changes made)
(4 real changes made)
(3 real changes made)
(2 real changes made)
(9 real changes made)
(15 real changes made)
(10 real changes made)
(10 real changes made)
(4 real changes made)
(11 real changes made)
(8 real changes made)
(6 real changes made)
(3 real changes made)
(1 real change made)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2019.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_white_male_2020: all characters numeric; replaced as int
num_under_5_white_male_2020: all characters numeric; replaced as int
num_5_to_9_white_male_2020: all characters numeric; replaced as int
num_10_to_14_white_male_2020: all characters numeric; replaced as int
num_15_to_17_white_male_2020: all characters numeric; replaced as int
num_18_to_19_white_male_2020: all characters numeric; replaced as int
num_20_to_24_white_male_2020: all characters numeric; replaced as int
num_25_to_29_white_male_2020: all characters numeric; replaced as int
num_30_to_34_white_male_2020: all characters numeric; replaced as int
num_35_to_44_white_male_2020: all characters numeric; replaced as int
num_45_to_54_white_male_2020: all characters numeric; replaced as int
num_55_to_64_white_male_2020: all characters numeric; replaced as int
num_65_to_74_white_male_2020: all characters numeric; replaced as int
num_75_to_84_white_male_2020: all characters numeric; replaced as int
num_over_85_white_male_2020: all characters numeric; replaced as int
tot_white_female_2020: all characters numeric; replaced as int
num_under_5_white_female_2020: all characters numeric; replaced as int
num_5_to_9_white_female_2020: all characters numeric; replaced as int
num_10_to_14_white_female_2020: all characters numeric; replaced as int
num_15_to_17_white_female_2020: all characters numeric; replaced as int
num_18_to_19_white_female_2020: all characters numeric; replaced as int
num_20_to_24_white_female_2020: all characters numeric; replaced as int
num_25_to_29_white_female_2020: all characters numeric; replaced as int
num_30_to_34_white_female_2020: all characters numeric; replaced as int
num_35_to_44_white_female_2020: all characters numeric; replaced as int
num_45_to_54_white_female_2020: all characters numeric; replaced as int
num_55_to_64_white_female_2020: all characters numeric; replaced as int
num_65_to_74_white_female_2020: all characters numeric; replaced as int
num_75_to_84_white_female_2020: all characters numeric; replaced as int
num_over_85_white_female_2020: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_white_2020.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_black_male_2020: all characters numeric; replaced as int
num_under_5_black_male_2020: all characters numeric; replaced as int
num_5_to_9_black_male_2020: all characters numeric; replaced as int
num_10_to_14_black_male_2020: all characters numeric; replaced as int
num_15_to_17_black_male_2020: all characters numeric; replaced as int
num_18_to_19_black_male_2020: all characters numeric; replaced as int
num_20_to_24_black_male_2020: all characters numeric; replaced as int
num_25_to_29_black_male_2020: all characters numeric; replaced as int
num_30_to_34_black_male_2020: all characters numeric; replaced as int
num_35_to_44_black_male_2020: all characters numeric; replaced as int
num_45_to_54_black_male_2020: all characters numeric; replaced as int
num_55_to_64_black_male_2020: all characters numeric; replaced as int
num_65_to_74_black_male_2020: all characters numeric; replaced as int
num_75_to_84_black_male_2020: all characters numeric; replaced as int
num_over_85_black_male_2020: all characters numeric; replaced as int
tot_black_female_2020: all characters numeric; replaced as int
num_under_5_black_female_2020: all characters numeric; replaced as int
num_5_to_9_black_female_2020: all characters numeric; replaced as int
num_10_to_14_black_female_2020: all characters numeric; replaced as int
num_15_to_17_black_female_2020: all characters numeric; replaced as int
num_18_to_19_black_female_2020: all characters numeric; replaced as int
num_20_to_24_black_female_2020: all characters numeric; replaced as int
num_25_to_29_black_female_2020: all characters numeric; replaced as int
num_30_to_34_black_female_2020: all characters numeric; replaced as int
num_35_to_44_black_female_2020: all characters numeric; replaced as int
num_45_to_54_black_female_2020: all characters numeric; replaced as int
num_55_to_64_black_female_2020: all characters numeric; replaced as int
num_65_to_74_black_female_2020: all characters numeric; replaced as int
num_75_to_84_black_female_2020: all characters numeric; replaced as int
num_over_85_black_female_2020: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_black_2020.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_asian_male_2020: all characters numeric; replaced as int
num_under_5_asian_male_2020: all characters numeric; replaced as int
num_5_to_9_asian_male_2020: all characters numeric; replaced as int
num_10_to_14_asian_male_2020: all characters numeric; replaced as int
num_15_to_17_asian_male_2020: all characters numeric; replaced as int
num_18_to_19_asian_male_2020: all characters numeric; replaced as int
num_20_to_24_asian_male_2020: all characters numeric; replaced as int
num_25_to_29_asian_male_2020: all characters numeric; replaced as int
num_30_to_34_asian_male_2020: all characters numeric; replaced as int
num_35_to_44_asian_male_2020: all characters numeric; replaced as int
num_45_to_54_asian_male_2020: all characters numeric; replaced as int
num_55_to_64_asian_male_2020: all characters numeric; replaced as int
num_65_to_74_asian_male_2020: all characters numeric; replaced as int
num_75_to_84_asian_male_2020: all characters numeric; replaced as int
num_over_85_asian_male_2020: all characters numeric; replaced as int
tot_asian_female_2020: all characters numeric; replaced as int
num_under_5_asian_female_2020: all characters numeric; replaced as int
num_5_to_9_asian_female_2020: all characters numeric; replaced as int
num_10_to_14_asian_female_2020: all characters numeric; replaced as int
num_15_to_17_asian_female_2020: all characters numeric; replaced as int
num_18_to_19_asian_female_2020: all characters numeric; replaced as int
num_20_to_24_asian_female_2020: all characters numeric; replaced as int
num_25_to_29_asian_female_2020: all characters numeric; replaced as int
num_30_to_34_asian_female_2020: all characters numeric; replaced as int
num_35_to_44_asian_female_2020: all characters numeric; replaced as int
num_45_to_54_asian_female_2020: all characters numeric; replaced as int
num_55_to_64_asian_female_2020: all characters numeric; replaced as int
num_65_to_74_asian_female_2020: all characters numeric; replaced as int
num_75_to_84_asian_female_2020: all characters numeric; replaced as int
num_over_85_asian_female_2020: all characters numeric; replaced as int
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_asian_2020.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_amind_male_2020: all characters numeric; replaced as int
num_under_5_amind_male_2020: all characters numeric; replaced as byte
num_5_to_9_amind_male_2020: all characters numeric; replaced as byte
num_10_to_14_amind_male_2020: all characters numeric; replaced as byte
num_15_to_17_amind_male_2020: all characters numeric; replaced as int
num_18_to_19_amind_male_2020: all characters numeric; replaced as byte
num_20_to_24_amind_male_2020: all characters numeric; replaced as int
num_25_to_29_amind_male_2020: all characters numeric; replaced as int
num_30_to_34_amind_male_2020: all characters numeric; replaced as byte
num_35_to_44_amind_male_2020: all characters numeric; replaced as byte
num_45_to_54_amind_male_2020: all characters numeric; replaced as byte
num_55_to_64_amind_male_2020: all characters numeric; replaced as byte
num_65_to_74_amind_male_2020: all characters numeric; replaced as byte
num_75_to_84_amind_male_2020: all characters numeric; replaced as byte
num_over_85_amind_male_2020: all characters numeric; replaced as byte
tot_amind_female_2020: all characters numeric; replaced as int
num_under_5_amind_female_2020: all characters numeric; replaced as int
num_5_to_9_amind_female_2020: all characters numeric; replaced as byte
num_10_to_14_amind_female_2020: all characters numeric; replaced as int
num_15_to_17_amind_female_2020: all characters numeric; replaced as byte
num_18_to_19_amind_female_2020: all characters numeric; replaced as byte
num_20_to_24_amind_female_2020: all characters numeric; replaced as byte
num_25_to_29_amind_female_2020: all characters numeric; replaced as byte
num_30_to_34_amind_female_2020: all characters numeric; replaced as byte
num_35_to_44_amind_female_2020: all characters numeric; replaced as byte
num_45_to_54_amind_female_2020: all characters numeric; replaced as byte
num_55_to_64_amind_female_2020: all characters numeric; replaced as byte
num_65_to_74_amind_female_2020: all characters numeric; replaced as byte
num_75_to_84_amind_female_2020: all characters numeric; replaced as byte
num_over_85_amind_female_2020: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_amind_2020.dta saved
(2 observations deleted)
variables created as string: 
zipcode1  zipcode2
tot_pacif_male_2020: all characters numeric; replaced as int
num_under_5_pacif_male_2020: all characters numeric; replaced as byte
num_5_to_9_pacif_male_2020: all characters numeric; replaced as byte
num_10_to_14_pacif_male_2020: all characters numeric; replaced as byte
num_15_to_17_pacif_male_2020: all characters numeric; replaced as byte
num_18_to_19_pacif_male_2020: all characters numeric; replaced as byte
num_20_to_24_pacif_male_2020: all characters numeric; replaced as byte
num_25_to_29_pacif_male_2020: all characters numeric; replaced as byte
num_30_to_34_pacif_male_2020: all characters numeric; replaced as byte
num_35_to_44_pacif_male_2020: all characters numeric; replaced as byte
num_45_to_54_pacif_male_2020: all characters numeric; replaced as byte
num_55_to_64_pacif_male_2020: all characters numeric; replaced as byte
num_65_to_74_pacif_male_2020: all characters numeric; replaced as byte
num_75_to_84_pacif_male_2020: all characters numeric; replaced as byte
num_over_85_pacif_male_2020: all characters numeric; replaced as byte
tot_pacif_female_2020: all characters numeric; replaced as int
num_under_5_pacif_female_2020: all characters numeric; replaced as byte
num_5_to_9_pacif_female_2020: all characters numeric; replaced as byte
num_10_to_14_pacif_female_2020: all characters numeric; replaced as byte
num_15_to_17_pacif_female_2020: all characters numeric; replaced as byte
num_18_to_19_pacif_female_2020: all characters numeric; replaced as byte
num_20_to_24_pacif_female_2020: all characters numeric; replaced as byte
num_25_to_29_pacif_female_2020: all characters numeric; replaced as byte
num_30_to_34_pacif_female_2020: all characters numeric; replaced as byte
num_35_to_44_pacif_female_2020: all characters numeric; replaced as byte
num_45_to_54_pacif_female_2020: all characters numeric; replaced as byte
num_55_to_64_pacif_female_2020: all characters numeric; replaced as byte
num_65_to_74_pacif_female_2020: all characters numeric; replaced as byte
num_75_to_84_pacif_female_2020: all characters numeric; replaced as byte
num_over_85_pacif_female_2020: all characters numeric; replaced as byte
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_pacif_2020.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------
(533 real changes made)
(533 real changes made)
(477 real changes made)
(480 real changes made)
(479 real changes made)
(481 real changes made)
(463 real changes made)
(495 real changes made)
(493 real changes made)
(491 real changes made)
(509 real changes made)
(512 real changes made)
(519 real changes made)
(513 real changes made)
(502 real changes made)
(462 real changes made)
(533 real changes made)
(533 real changes made)
(473 real changes made)
(480 real changes made)
(482 real changes made)
(468 real changes made)
(445 real changes made)
(494 real changes made)
(489 real changes made)
(500 real changes made)
(513 real changes made)
(511 real changes made)
(517 real changes made)
(509 real changes made)
(501 real changes made)
(482 real changes made)
(425 real changes made)
(425 real changes made)
(161 real changes made)
(170 real changes made)
(191 real changes made)
(173 real changes made)
(181 real changes made)
(231 real changes made)
(209 real changes made)
(207 real changes made)
(266 real changes made)
(271 real changes made)
(259 real changes made)
(211 real changes made)
(130 real changes made)
(78 real changes made)
(411 real changes made)
(411 real changes made)
(156 real changes made)
(182 real changes made)
(193 real changes made)
(162 real changes made)
(146 real changes made)
(205 real changes made)
(189 real changes made)
(204 real changes made)
(258 real changes made)
(251 real changes made)
(236 real changes made)
(203 real changes made)
(143 real changes made)
(104 real changes made)
(408 real changes made)
(408 real changes made)
(190 real changes made)
(201 real changes made)
(204 real changes made)
(180 real changes made)
(143 real changes made)
(201 real changes made)
(199 real changes made)
(214 real changes made)
(289 real changes made)
(280 real changes made)
(257 real changes made)
(214 real changes made)
(136 real changes made)
(74 real changes made)
(424 real changes made)
(424 real changes made)
(186 real changes made)
(191 real changes made)
(202 real changes made)
(201 real changes made)
(158 real changes made)
(212 real changes made)
(216 real changes made)
(234 real changes made)
(313 real changes made)
(304 real changes made)
(283 real changes made)
(225 real changes made)
(158 real changes made)
(82 real changes made)
(186 real changes made)
(186 real changes made)
(17 real changes made)
(20 real changes made)
(25 real changes made)
(15 real changes made)
(17 real changes made)
(35 real changes made)
(25 real changes made)
(22 real changes made)
(41 real changes made)
(52 real changes made)
(40 real changes made)
(34 real changes made)
(15 real changes made)
(5 real changes made)
(174 real changes made)
(174 real changes made)
(13 real changes made)
(19 real changes made)
(23 real changes made)
(13 real changes made)
(15 real changes made)
(24 real changes made)
(24 real changes made)
(21 real changes made)
(44 real changes made)
(54 real changes made)
(53 real changes made)
(25 real changes made)
(15 real changes made)
(13 real changes made)
(54 real changes made)
(54 real changes made)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(5 real changes made)
(8 real changes made)
(6 real changes made)
(6 real changes made)
(8 real changes made)
(10 real changes made)
(8 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(67 real changes made)
(67 real changes made)
(6 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)
(11 real changes made)
(15 real changes made)
(9 real changes made)
(10 real changes made)
(4 real changes made)
(12 real changes made)
(8 real changes made)
(4 real changes made)
(2 real changes made)
(1 real change made)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
(3 missing values generated)
  (0 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/census_age_sex_2020.dta saved

. 
. * Merge datasets from 2011-2020 into one dataset containing all years
. use "$MyProject/processed/intermediate/census_age_sex_2011.dta", clear

. forvalues y = 2012/2020 {
  2.         merge 1:1 zipcode using "$MyProject/processed/intermediate/census_age_sex_`y'.dta"
  3.         drop _merge
  4. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               538  (_merge==3)
    -----------------------------------------

. 
. * Save dataset containing all years
. compress
  (0 bytes saved)

. save "$MyProject/processed/census_age_sex.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/census_age_sex.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2d_clean_dispensaries_data.do"

. ************
. * SCRIPT: 2d_clean_dispensaries_data.do
. * PURPOSE: processes the dispensaries dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/dispensaries_uncleaned.dta", clear

. 
. * Select only desired columns
. keep business_name dba_name license_type establishment_address_1 establishment_city establishment_zip_code establishment_county commence_operations_date latitude longitude

. 
. * Keep only entries that have certain license types
. keep if license_type=="Marijuana Retailer"
(520 observations deleted)

. drop license_type

. 
. * Keep only entries that have commenced operations
. keep if commence_operations_date!=""
(162 observations deleted)

. 
. * Create variables for commencement operations month, day, and year
. split commence_operations_date, parse("/")
variables created as string: 
commence_o~1  commence_o~2  commence_o~3

. destring commence_operations_date1, gen(commence_month)
commence_operations_date1: all characters numeric; commence_month generated as byte

. destring commence_operations_date2, gen(commence_day)
commence_operations_date2: all characters numeric; commence_day generated as byte

. destring commence_operations_date3, gen(commence_year)
commence_operations_date3: all characters numeric; commence_year generated as int

. drop commence_operations_date commence_operations_date1 commence_operations_date2 commence_operations_date3

. 
. * Change format of zip code to be 5 digits
. format establishment_zip_code %05.0f

. 
. * Rename address variable
. rename establishment_address_1 establishment_address

. 
. * Manually update lat/lon coordinates of HVV Massachusetts, Inc.
. replace lat = 42.387990 if establishment_address=="220 William McClellan Hwy"
(1 real change made)

. replace lon = -71.017820 if establishment_address=="220 William McClellan Hwy"
(1 real change made)

. 
. * Save dataset
. compress
  variable business_name was str60 now str58
  variable dba_name was str64 now str32
  variable establishment_address was str54 now str51
  variable establishment_city was str18 now str16
  (7,995 bytes saved)

. save "$MyProject/processed/dispensaries.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries.dta saved

. outsheet using "$MyProject/processed/dispensaries.csv", comma replace

. 
. * Create dataset with only dispensaries in the Boston area
. keep if establishment_city=="Boston" | establishment_city=="Brookline"
(194 observations deleted)

. gen id = _n

. order id

. compress
  variable id was float now byte
  variable business_name was str58 now str34
  variable dba_name was str32 now str14
  variable establishment_address was str51 now str25
  variable establishment_city was str16 now str9
  variable establishment_county was str10 now str7
  (891 bytes saved)

. save "$MyProject/processed/dispensaries_boston.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/dispensaries_boston.dta saved

. outsheet using "$MyProject/processed/dispensaries_boston.csv", comma replace

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2e_clean_ma_zoning_data.do"

. ************
. * SCRIPT: 2e_clean_ma_zoning_data.do
. * PURPOSE: processes the massachusetts zoning dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/ma_zoning_laws_uncleaned.dta", clear

. 
. * Rename variable names to be values from the first row
. foreach var of varlist * {
  2.         local x = strtoname(`var'[1])
  3.         rename `var' `x'
  4. }

. drop in 1
(1 observation deleted)

. 
. * Drop cities with no response
. drop if Adult_Use_Status == "No response" & Delivery_Status == "No response"
(22 observations deleted)

. 
. * Create dummy variables for legality of retail, adult use, and delivery
. gen retail_legal = Adult_Use_Status == "Zoning in place" | Adult_Use_Status == "No zoning in place" | Adult_Use_Status == "Zoning in place, retail license cap" | Adult_Use_Statu
> s == "Zoning in place; license cap" | Adult_Use_Status == "Zoning in place; license cap; delivery ban" | Adult_Use_Status == "Zoning in place; retail cap" | Adult_Use_Status == 
> "Zoning in place; retail license cap"

. gen adult_use_legal = retail_legal | Adult_Use_Status == "Retail ban" | Adult_Use_Status == "Zoning in place; retail ban"

. gen delivery_legal = Adult_Use_Status != "Ban in place" & (Delivery_Status == "Delivery permitted" | Delivery_Status == "Delivery permitted; Host Community Agreement signed with
>  business maintaining/pursuing delivery license" | Delivery_Status == "No zoning in place" | Adult_Use_Status == "No zoning in place")

. drop Adult_Use_Status

. drop Delivery_Status

. 
. * Rename address variable
. rename City_Town city

. drop if missing(city)
(1 observation deleted)

. 
. * Save dataset
. compress
  variable retail_legal was float now byte
  variable adult_use_legal was float now byte
  variable delivery_legal was float now byte
  (2,952 bytes saved)

. save "$MyProject/processed/ma_zoning_laws.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/ma_zoning_laws.dta saved

. outsheet using "$MyProject/processed/ma_zoning_laws.csv", comma replace

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2f_clean_prop_assessments_data.do"

. ************
. * SCRIPT: 2f_clean_prop_assessments_data.do
. * PURPOSE: processes the massachusetts property assessments datasets in preparation for analysis
. ************
. 
. * Clean dataset for each year, one at a time
. forvalues y = 2014/2021 {
  2.         use "$MyProject/processed/intermediate/property_assessments_ma_`y'_uncleaned.dta", clear
  3.         
.         * Rename 2021 variables to have the same name as other years
.         if `y' == 2021 {
  4.                 rename bldg_value av_bldg
  5.                 rename yr_remodel yr_remod
  6.                 rename res_floor num_floors
  7.                 rename bed_rms r_bdrms
  8.                 rename full_bth r_full_bth
  9.                 rename hlf_bth r_half_bth
 10.                 rename kitchen r_kitch
 11.                 rename heat_type r_heat_typ
 12.         }
 13.         
.         * Select only desired columns
.         keep zipcode lu av_bldg living_area yr_built yr_remod num_floors r_bdrms r_full_bth r_half_bth r_kitch r_heat_typ
 14.         
.         * Create variable for the year the building was assessed
.         gen year_assessed = `y'
 15.         
.         * Change zipcode column to be of uniform format across years
.         if `y' == 2018 | `y' == 2019 | `y' == 2020 | `y' == 2021 {
 16.                 tostring zipcode, replace
 17.                 replace zipcode = "0" + zipcode
 18.         }
 19.         else {
 20.                 replace zipcode = substr(zipcode, 1, 5)
 21.         }
 22.         
.         * Convert dollar amount av_bldg to int (2021 only)
.         if `y' == 2021 {
 23.                 split av_bldg, parse(".00") gen(dollars)
 24.                 destring dollars1, replace ignore("$,")
 25.                 drop av_bldg
 26.                 rename dollars1 av_bldg
 27.         }
 28. 
.         * Drop entries with missing, 0-valued, or unreasonable data
.         drop if av_bldg == 0 | missing(av_bldg)
 29.         drop if living_area < 250 | missing(living_area)
 30.         drop if yr_built == 0 | missing(yr_built)
 31.         drop if num_floors == 0 | missing(num_floors)
 32.         drop if r_bdrms == 0 | missing(r_bdrms)
 33.         
.         * Create variable for price per square foot
.         gen ppsqft = av_bldg / living_area
 34.         drop if ppsqft < 20
 35.         
.         * Create variable for years since built
.         gen yrs_since_built = `y' - yr_built
 36.         
.         * Create variable for years since remodel
.         replace yr_remod = 0 if missing(yr_remod)
 37.         replace yr_remod = yr_built if yr_remod==0
 38.         gen yrs_since_remodel = `y' - yr_remod
 39.         drop yr_built yr_remod
 40.         
.         * Replace missing values with 0
.         replace living_area = 0 if missing(living_area)
 41.         replace r_full_bth = 0 if missing(r_full_bth)
 42.         replace r_half_bth = 0 if missing(r_half_bth)
 43.         
.         * Replace string kitchen values with ints
.         if `y' == 2020 {
 44.                 replace r_kitch = "0" if missing(r_kitch)
 45.                 replace r_kitch = substr(r_kitch, 1, 1)
 46.                 replace r_kitch = "0" if real(r_kitch)==. & r_kitch=="N"
 47.                 replace r_kitch = "1" if real(r_kitch)==. & r_kitch!="N"
 48.                 destring r_kitch, replace
 49.         }
 50.         else {
 51.                 replace r_kitch = 0 if missing(r_kitch)
 52.         }
 53.         
.         * Create dummy variables for heat type
.         gen heat_electric = r_heat_typ==`"E"' | r_heat_typ==`"E - Electric"'
 54.         gen heat_forced_hot_air = r_heat_typ==`"F"' | r_heat_typ==`"F - Forced Hot Air"'
 55.         gen heat_pump = r_heat_typ==`"P"' | r_heat_typ==`"P - Heat Pump"'
 56.         gen heat_space = r_heat_typ==`"S"' | r_heat_typ==`"S - Space Heat"'
 57.         gen heat_steam = r_heat_typ==`"W"' | r_heat_typ==`"W - Ht Water/Steam"'
 58.         gen heat_other = r_heat_typ==`"O"' | r_heat_typ==`"O - Other"'
 59.         drop r_heat_typ
 60.         
.         * Save dataset for year `y'
.         compress
 61.         save "$MyProject/processed/intermediate/property_assessments_ma_`y'.dta", replace
 62. }
(164,091 real changes made)
(21,893 observations deleted)
(6,913 observations deleted)
(42 observations deleted)
(205 observations deleted)
(72,419 observations deleted)
(128 observations deleted)
(0 real changes made)
(43,034 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  variable zipcode was str6 now str5
  variable lu was str21 now str2
  (2,874,586 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2014.dta saved
(168,104 real changes made)
(22,311 observations deleted)
(8,173 observations deleted)
(40 observations deleted)
(252 observations deleted)
(74,564 observations deleted)
(79 observations deleted)
(2,842 real changes made)
(42,311 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  variable zipcode was str6 now str5
  (1,692,792 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2015.dta saved
(169,193 real changes made)
(22,306 observations deleted)
(8,706 observations deleted)
(45 observations deleted)
(253 observations deleted)
(75,322 observations deleted)
(97 observations deleted)
(2,903 real changes made)
(41,499 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  variable zipcode was str6 now str5
  (1,686,690 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2016.dta saved
(170,903 real changes made)
(22,308 observations deleted)
(9,556 observations deleted)
(55 observations deleted)
(284 observations deleted)
(76,244 observations deleted)
(72 observations deleted)
(3,002 real changes made)
(40,502 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  variable zipcode was str6 now str5
  (1,684,557 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2017.dta saved
zipcode was int now str4
variable zipcode was str4 now str5
(172,841 real changes made)
(22,307 observations deleted)
(10,267 observations deleted)
(48 observations deleted)
(269 observations deleted)
(77,606 observations deleted)
(75 observations deleted)
(3,047 real changes made)
(39,426 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  (1,618,994 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2018.dta saved
zipcode was int now str4
variable zipcode was str4 now str5
(174,668 real changes made)
(22,445 observations deleted)
(10,831 observations deleted)
(59 observations deleted)
(232 observations deleted)
(78,902 observations deleted)
(42 observations deleted)
(3,168 real changes made)
(38,482 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  (1,616,082 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2019.dta saved
zipcode was int now str4
variable zipcode was str4 now str5
(175,052 real changes made)
(17,692 observations deleted)
(16,503 observations deleted)
(39 observations deleted)
(36 observations deleted)
(79,454 observations deleted)
(27 observations deleted)
(37,056 real changes made)
(37,057 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(9 real changes made)
(61,292 real changes made)
(3 real changes made)
(3 real changes made)
r_kitch: all characters numeric; replaced as byte
  variable living_area was long now int
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  (1,593,826 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2020.dta saved
zipcode was int now str4
variable zipcode was str4 now str5
(177,091 real changes made)
variable created as string: 
dollars1
dollars1: characters $ , removed; replaced as long
(18079 missing values generated)
(18,079 observations deleted)
(16,654 observations deleted)
(59 observations deleted)
(28 observations deleted)
(16,068 observations deleted)
(42 observations deleted)
(59,928 real changes made)
(59,928 real changes made)
(0 real changes made)
(5 real changes made)
(92,580 real changes made)
(9 real changes made)
  variable year_assessed was float now int
  variable yrs_since_built was float now int
  variable yrs_since_remodel was float now int
  variable heat_electric was float now byte
  variable heat_forced_hot_air was float now byte
  variable heat_pump was float now byte
  variable heat_space was float now byte
  variable heat_steam was float now byte
  variable heat_other was float now byte
  (3,027,864 bytes saved)
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/intermediate/property_assessments_ma_2021.dta saved

. 
. * Merge datasets from 2014-2021 into one dataset containing all years
. use "$MyProject/processed/intermediate/property_assessments_ma_2014.dta", clear

. forvalues y = 2015/2021 {
  2.         append using "$MyProject/processed/intermediate/property_assessments_ma_`y'.dta"
  3. }
(variable living_area was int, now long to accommodate using data's values)

. 
. * Only keep common building types
. replace lu = "A" if lu == "R4"
(13 real changes made)

. replace lu = "CD" if lu == "CC"
(1 real change made)

. replace lu = "E" if lu == "C"
(2 real changes made)

. replace lu = "R" if lu == "R1" | lu == "R2" | lu == "R3" | lu == "RC"
(494,676 real changes made)

. drop if lu == "EA" | lu == "XX"
(382 observations deleted)

. 
. * Save dataset containing all years
. compress
  (0 bytes saved)

. save "$MyProject/processed/property_assessments_ma.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/property_assessments_ma.dta saved

. 
. ** EOF
. 
end of do-file

. do "$MyProject/scripts/2g_clean_ma_home_values_data.do"

. ************
. * SCRIPT: 2g_clean_ma_home_values_data.do
. * PURPOSE: processes the zillow home value dataset in preparation for analysis
. ************
. 
. use "$MyProject/processed/intermediate/zillow_home_values_uncleaned.dta", clear

. 
. * Select only desired columns
. drop regionid sizerank regiontype statename city metro countyname

. 
. * Rename zipcode
. rename regionname zipcode

. 
. * Rename v10-v274 to their label (month/year)
. foreach v of varlist v* {
  2.         local x: variable label `v'
  3.         local year = substr("`x'", 1, 4)
  4.         local month = substr("`x'", 6, 2)
  5.         rename `v' hv_`month'_`year'
  6. }

. 
. save "$MyProject/processed/zillow_home_values.dta", replace
file /Users/anniebryan/Documents/College/2021-22/14.33/Project/processed/zillow_home_values.dta saved

. 
. * Filter to only include observations from Massachusetts
. keep if state=="MA"
(29,950 observations deleted)

. 
. * Make zipcode type string
. tostring zipcode, replace
zipcode was long now str4

. replace zipcode = "0" + zipcode
variable zipcode was str4 now str5
(518 real changes made)

. 
. * Add city name
. merge 1:1 zipcode using "$MyProject/processed/zip_code_centroids.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                            94
        from master                        18  (_merge==1)
        from using                         76  (_merge==2)

    Matched                               500  (_merge==3)
    -----------------------------------------

. drop if _merge!=3
(94 observations deleted)

. drop _merge latitude longitude min_dist_disp min_dist_2019 min_dist_2020 min_dist_2021 min_dist_2022 state

. order zipcode city

. 
. * Add MA zoning laws
. merge m:1 city using "$MyProject/processed/ma_zoning_laws.dta"
(variable city was str18, now str21 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           169
        from master                       137  (_merge==1)
        from using                         32  (_merge==2)

    Matched                               363  (_merge==3)
    -----------------------------------------

. drop if _merge!=3
(169 observations deleted)

. drop _merge

. 
. * Save dataset
. compress
  variable city was str21 now str16
  (1,815 bytes saved)

. save br
file br.dta saved

. , replace
, is not a valid command name
r(199);

end of do-file
r(199);

end of do-file

r(199);

. br

. do "/Users/anniebryan/Documents/College/2021-22/14.33/Project/run.do"

. **********************
. * OVERVIEW
. *   All raw data are stored in /data
. *   All tables are outputted to /results/tables
. *   All figures are outputted to /results/figures
. *
. * TO PERFORM A CLEAN RUN, DELETE THE FOLLOWING TWO FOLDERS:
. *   /processed
. *   /results
. **********************
. 
. global MyProject "/Users/anniebryan/Documents/College/2021-22/14.33/Project"

. 
. * Initialize log
. clear

. set more off

. cap mkdir "$MyProject/scripts/logs"

. cap log close
